[
  {
    "id": "21dc8e04-554c-44cd-aa3a-8b1f49ee4853",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "A - Initial KSA Analysis (KSA) Example\t56 B - Role Performance Statement (Role PS) Example\t56 C   Fidelity Analysis Example\t56"
  },
  {
    "id": "a2f9a92d-f90f-48ac-a012-ad943e446675",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Defence Training Support Manuals (DTSM) have been developed to support the understanding and implementation of the policy contained in JSP 822. JSP 822 is the authoritative policy that directs and guides Defence people to ensure that Defence Learning (training and education) is appropriate, efficient, effective and, most importantly, safe. DTSMs will be published every December, following the publication of the latest version of JSP 822. Throughout the year, different versions of the latest DTSM edition may also be published. When every new edition is published, the versions will reset to 1."
  },
  {
    "id": "01510d8d-1d22-47e4-aa44-67d177a545f2",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Using the DTSMs is entirely optional, and users may find there are alternative resources available to help them understand and implement the policy contained in JSP 822. Throughout this document there are references to other DTSMs, these references contains hyperlinks that will take you to the DTSMs that are held on the Defence Training Support Manuals SharePoint site. The DTSMs currently available are:"
  },
  {
    "id": "90e469e1-9642-463e-a32d-9e49b984db9e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "DTSM Number DTSM"
  },
  {
    "id": "654c8ae8-f44a-46ba-8448-f69dbbe800fa",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Name SharePoint Link DTSM 1"
  },
  {
    "id": "76ff87b2-51b9-456b-b6db-a51cc9e829ec",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Governance of Individual Training Link DTSM 2"
  },
  {
    "id": "d5129606-8e24-46b5-be37-6ff215b26a0e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Analysis of Individual Training Requirements Link DTSM 3"
  },
  {
    "id": "e1e2ae58-6d62-4608-a5ee-dbf55e1c8560",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Designing Individual Training Link DTSM 4"
  },
  {
    "id": "53c56e56-78e8-4535-8d71-195d85f5422e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Delivery of Individual Training Link DTSM 5"
  },
  {
    "id": "ffd34e56-5290-4d0b-b283-df3c55b05770",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Evaluation of Individual Training Link"
  },
  {
    "id": "da6e7ee6-4b4c-43b6-820d-718edfdb61d9",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "process with a number of specified outputs. However, it should be emphasised that this recommended approach is not necessarily linear nor does it have to be followed prescriptively. In many cases there may not be a requirement to produce all of the suggested output products, and there may be merit in conducting stages or activities concurrently."
  },
  {
    "id": "d8049558-c47e-49a1-8789-052528375208",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "a. TNA, Stage 1. (1) Scoping Exercise Report. This identifies the management of the TNA, programming and resourcing issues, policies, constraints, risks and assumptions. The key output is the Scoping Exercise Report (which recommends possible training solutions). It also identifies if training is not the solution and no further analysis is required. b. TNA, Stage 2."
  },
  {
    "id": "903c124e-7b5a-4090-8ac8-c3fa01a239cd",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "(1) Role Analysis (RA). This identifies the Role(s) that need to be trained for, the supporting duties, tasks, sub-tasks and task-elements, then analyses these to generate Performances, Conditions and Standards. The key outputs are the Role PS and/or Framework(s)1. (2) Training Gap Analysis (TGA). This states the training gaps in terms of KSA. The key outputs are the Statements of Training Gaps. (3) Initial Training Objectives (TOs). This is an initial draft of the TOs, based upon the Role PS and/or Framework(s), which are the key outputs. It may be that the initial TOs created at this stage are sufficient and do not need further refinement but they are certainly not endorsed at this stage."
  },
  {
    "id": "f9562b6b-8c41-441e-bb0e-483b7e6a9b31",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "(4) Training Options Analysis (TOA). The TOA considers each relevant Task in the Role PS / Competence Framework to assess the extent to which the training environment should replicate the workplace (real) environment to enable training to be effective. This is known as the Fidelity Analysis. The implications of locations and environment for training and Methods & Media options are then considered. The key outputs are the realistic options for Methods & Media and refinement (based upon fidelity, locations and environment) of the possible training solutions. Cost-effective options which take account of Whole Life training requirements (including refresher training) are considered. (5) Training Needs Report (TNR). The Training Needs Report analyses the cost benefits and then evaluates the merits of the training options, before confirming the TNASG endorsed training solution. The report includes the Role PS and/or Framework(s). The key output is a recommendation as to the most cost-effective training solution, which inputs into the SOTR. An implementation plan is also included."
  },
  {
    "id": "ac1a8450-7280-407f-bb6f-ca4bb51ce2bf",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "c. TNA, Stage 3 (conducted at DSAT, Element 4). (1) Training Needs Evaluation (TNE). This assesses and reports on the effectiveness of the TNA process as well as the ability of the implemented training solution to meet the Defence requirement. The TNE is conducted in 2 parts: evaluation of the process, and evaluation of the training solution. The key output is an assessment of how well the TNA outputs contributed to the provision of a training solution that meets the Defence requirement. This completes the TNA process. TNE is covered in DTSM 5."
  },
  {
    "id": "e2f212f0-14dc-4eea-95c1-a7dd051f9f65",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "a. the requirement being raised and the need to carry out a TNA. b. forming a TNA Steering Group (TNASG)3. c. assurance of the TNA process."
  },
  {
    "id": "09a7d2a5-02c9-496d-a9ae-21ab1d489937",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6",
    "content": "a. In support of a new fielded force or training equipment or service. b. In support of an enhancement to any equipment or support system already in service. c. A change in policy/legislation."
  },
  {
    "id": "30ec346f-73be-40a6-8964-d01808f34ee1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "d. A change to the doctrine underpinning the deployment of a capability. e. Changes to organisational structure, or changed competence requirements."
  },
  {
    "id": "e479b25e-576d-4a5d-9922-2aa92fd191b9",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "12. It should be noted that the cheapest option is not necessarily the most cost-effective option in meeting the training requirement. Also, the cheapest option is not necessarily to continue existing training within existing resources. Therefore,  effectiveness  is the key as it is the extent to which the training has prepared the individual for the Defence effect which matters. Cost is  efficiency  focused to optimise the use of resources to enable the execution of training (and required learning) and ensure Value for Money (VfM)."
  },
  {
    "id": "217aa56a-8e9a-4d94-8385-78dcca84aed8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "a. Training Requirements Authority (TRA). The complexity and size of the training requirement will dictate the level of involvement of the TRA and whether responsibilities are delegated. Training policy and training support representatives from the TRA should direct the TNA Scoping Exercise and the TRA will normally nominate the chair of the TNASG. See DTSM 1 for more information on the role the TRA. b. Defence Equipment & Support (DE&S). Where the training need is derived from new equipment or a service being brought into service by DE&S, representation from the Project Teams, or equivalent, is key to ensuring that the training requirement meets the technical needs of the new capability."
  },
  {
    "id": "c1f3c285-2b94-4398-9d83-bd75a010ba38",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "c. Training Delivery Authority (TDA). The TDA will need to be represented at the TNASG as it is responsible for the design stages of the DSAT process and will likely be closely tied to the Training Provider. See DTSM 1 for more information on the role of the TDA. d. Training Provider. It is not vital for the Training Provider to be represented at the early stages of TNA, unless a specific Training Provider is obvious from the outset. In that case, it is sensible to include the Training Provider in the TNASG."
  },
  {
    "id": "d748dfd3-f737-4223-8e72-fb59a70d615f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "See DTSM 1 for more information on the role of the Training Provider. e. Formation Command. The Formation Command4 is the final user of the new capability. The Formation Command therefore should be represented as it will be integral to achieving the balance of training between that delivered by the Training Provider and the remainder by the Formation Command in the workplace. f. Workforce Authority. The identification of appointments/posts/billets affected by a new Defence capability, as well as training throughput to resource it, are key aspects of the scoping exercise and RA. The involvement of the relevant Workforce Authority is therefore critical to the validity of the TNA and important in ensuring that the issues that overlap between personnel/workforce and training are fully integrated and understood by all parties from the outset."
  },
  {
    "id": "1f7be67f-6c32-4a03-9432-56d589a4bec9",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "g. Training SME. If necessary, a training management SME should be represented in order to advise the chair on TNA management and methodology, ensure that the TNASG is representative of all stakeholders, compliant with the DSAT process, and that an audit trail exists. h. Other members. Membership can be extended as needed to include any other interested parties. For example, it may be prudent to include representation from Diversity and Inclusion (D&I), legal or security staffs."
  },
  {
    "id": "3a3d3ef2-415e-4f53-8be7-67dac7373df0",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "a. develop and maintain a TSP. b. quality assure all TNA activities, particularly the (Stage 1) Scoping Exercise. c. brief potential Contractors and act as a point of contact for any requests for information or subject matter expertise."
  },
  {
    "id": "62d81b7c-3019-4f8e-853f-b4cf2b78b76f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "d. co-ordinate the activities of all contributors to the TNA. e. review and co-ordinate amendments to TNA outputs. f. endorse proposals affecting the TNA process or that amend outputs."
  },
  {
    "id": "b9bf3e9d-9b7c-452c-a8be-53780546c664",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "g. endorse the most cost-effective training solution recommendation. h. assist in the design and delivery of the chosen training solution."
  },
  {
    "id": "4ef28292-4106-4ef9-b75e-a6e7fd3500af",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "effective for a TNA to explore all possible options and identify the most suitable and cost- effective solution."
  },
  {
    "id": "eff1a481-a279-4db4-a747-37664003f052",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6",
    "content": "Figure 1: Training Support Plan (TSP) in the TNA Context"
  },
  {
    "id": "077f3cc1-03d1-4d28-97ad-a7c54c1be607",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "a. the scope and size of the TNA. b. constraints, risks and assumptions. c. outputs and reporting procedures."
  },
  {
    "id": "f807c625-7175-4e54-bcb4-a3ccec61096e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "d. timescales and resources available. e. the methodology to be adopted."
  },
  {
    "id": "5eff5d4e-d599-4984-9d14-1fce5c5addf4",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "7",
    "content": "a. training audience groupings, the number and type of groups that need to be addressed (e.g. operator, maintainer, manager, train-the-trainer; individual, team, unit etc). b. social and demographic characteristics of each of the training audience groups. c. subject matter competence (in terms of KSA) of each of the group on entering training. This could include identifying any key entry standards."
  },
  {
    "id": "cca916cb-9bde-4619-81c6-d1314a9744e8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "7",
    "content": "d. size and annual training throughput requirements of each of the training audience groups."
  },
  {
    "id": "8d49ff8a-789c-4dc8-90ca-647981ef620f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8",
    "content": "a. Individual. Users should identify all individuals who require training, and possibly at what stages in the training continuum they will be required to be trained. If possible, analysts should also identify the relevant individual career training pipelines and identify the optimal stage for any new training to be delivered. Users should identify the appropriate rank and branch/specialisation of all individuals requiring training; and consider individuals who could require training from across all Defence Lines of Development (DLoDs), and not limit thinking to a single area. b. Team and sub-team. Seldom will individuals operate alone; they will almost always constitute part of a team. Users should therefore identify the teams and sub- teams that will require training.  A team is a sub-division of an individual unit s"
  },
  {
    "id": "1f65a2b7-10a8-4591-a629-00cf9e9cc3ae",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6",
    "content": "personnel, (e.g. a ship would comprise teams operating on the bridge, in the operations room, in the ship control centre etc). Teams can sometimes then be sub- divided further into sub-teams. Users should identify the individuals who will constitute the teams/sub-teams so that the capacity and size of any potential team training solution can be determined."
  },
  {
    "id": "817e866a-a5d0-4888-8a4e-04649672d7ec",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "9",
    "content": "a. Physique, health and appearance. Such as particular requirements for eyesight, hearing, manual dexterity height, weight, fitness standards, build and appearance. b. Cognitive ability. It may be important to indicate either the general cognitive ability required, or minimum scores required on specific tests. c. Special aptitudes. Such as special aptitudes for mechanical ability, manual dexterity, skill with words, skill with figures, artistic ability, musical ability."
  },
  {
    "id": "5a5c8bd8-ea3c-4f9b-9aba-13726eda393b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "9",
    "content": "d. Digital literacy. Information and Communication Technology abilities and wider digital literacy characteristics should be considered and not assumed. This analysis should include the abilities of the trainees, trainers and course designers. e. Interests. A personal particular interest in a career-type, e.g. nursing or policing require people who have a desire to do this sort of work if they are to be successful at it. f. Disposition. Some roles require people with initiative while others require someone who can tolerate routine and repetitive work."
  },
  {
    "id": "b42f513d-12c6-42b4-b5c7-56bf1050256b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "9",
    "content": "g. Learning styles. Such as reading ability, attitudes towards potential training delivery systems, impact of Specific Learning Differences (SpLD), ICT etc. h. Motivation. Such as willingness or motivation to attend training or career implications and career cycles as they relate to the training. i. Personal data. Such as age, sex, rank, length of Service, ethnicity, cultural characteristics/biases etc."
  },
  {
    "id": "a9cdb931-6a87-4c32-9ecf-ada909b63968",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "9",
    "content": "j. Geographic location / organisational distribution. These factors may result in certain constraints/considerations."
  },
  {
    "id": "3887a4c5-1e34-488a-aa8c-f31d19693b8e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "a. experience with the training performance (and how it was obtained). b. ability to perform any part of the requirement. c. knowledge of the subject matter (and how it was acquired)."
  },
  {
    "id": "bc5e000d-3c47-47f8-9290-554deab91aa9",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "d. positive or negative perceptions of the subject matter. e. perception of the impact of mastering the Performance requirements on self, work, career."
  },
  {
    "id": "f0589a25-81de-4496-96db-50988018035e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "a. establishing whether or not an individual s existing competences are sufficient for them to safely operate or maintain the new capability. b. identifying what level of rank is required to exploit the capability. c. establishing the minimum level of experience required (such as, number of flying hours, previous command experience, specific operational experience etc)."
  },
  {
    "id": "142f0faf-55d9-4821-a60c-f9a09458179b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "d. establishing the minimum qualification required (such as, charge qualified, command qualified, category  A  nuclear watch keeper etc). 12. Pre-requisites analysis. Pre-requisites analysis can be used to inform the training solution recommendations and is an important measure of competence/entry standard prior to training. This enables more accurate measures of competence  before and after  training to be taken, thereby facilitating measures of effectiveness of the training solution in delivering the required output standards. 13. Training throughput. An estimate of training throughput numbers (total audience and annual throughput requirements) will inform requirements for the size and capacity of the potential training solution and must be made available to inform the SOTR process. The SOTR forecasts annual throughput requirements 4 years in advance, in order to help generate the required capability. Throughput numbers may be required in support of a variety of related training solutions for each distinct training audience group. Throughput figures should be calculated separately for each type of training required and for all affected Defence people, MoD civilians and Contractors. Training throughput figures should be presented in table or graph format, along with any throughput assumptions. Training throughput figures for all training audiences can then be used as separate requirements to be considered by users in generating potential training solutions. These factors should be considered when estimating the throughput numbers:"
  },
  {
    "id": "45c1722f-c09d-4106-ba43-6951b8d9c3cd",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "a. average lengths of assignment. b. per cent posted to similar role in a different location (such as, will not need to be retrained to assume role responsibilities). c. recertification issues (such as, how long is the training valid for)."
  },
  {
    "id": "075be58d-5b5c-4ab7-8751-981fc3c894ca",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "d. promotion cycle and its potential impact on training numbers (such as, number of target audience who will be promoted during their assignment). e. historic data on pass rates, if applicable. f. any known contractual constraints."
  },
  {
    "id": "c38000d4-c8f0-4e8a-b035-c9c01447e925",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "g. consideration for civilians and contractors who may need to attend the training. h. any known throughput constraints on pre-requisite training. i. potential competition with other training activities."
  },
  {
    "id": "2d7d6b2d-7813-430c-b6be-ef602975ea88",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "14. Any constraints affecting the TNA need to be analysed and highlighted to ensure that risks regarding financial, safety and technical issues are addressed. The TNA process should initially focus on satisfying the strategic need with the caveat that proposed training solutions are compared with the initial constraints as part of the TOA and/or EA. Further constraints are the timing/development of the TNA, accessibility to SMEs and Intellectual Property Rights (IPR). The TNA may be directed to examine a particular potential training solution, however, without prejudicing the final outcome. Constraints may also be identified in strategic trends, doctrine, concept documents (e.g. the Concept of Employment for a capability) or can be determined through contextual analysis (such as via PESTLE7 or other frameworks). They should also involve consideration of all the Defence Lines of Development (DLoDs)8. Key constraints include: a. Policy. On occasion, Defence Policy will dictate the Methods and Media to be used. The TNA should adhere to the DTEL Rules9 and Defence Policy for Modelling & Simulation (M&S) (JSP 939), as well as taking account of policies on the use of the Support Solutions Envelope, Integrated Logistic Support 10 and Human Factors Integration for Defence Systems (JSP 912). SCs may also mandate the use of specific training environments or solutions, which should be documented. b. Cost. Restrictions may be placed on the TNA by affordability considerations, which may restrict the number or scope of training options but could also take into account Value for Money (VfM) through-life (e.g. where investment has already been"
  },
  {
    "id": "f72a688f-2e46-4cb4-a318-8fa6a24c71ab",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "made in training and, for economic reasons11, it is advisable to build upon existing capability rather than acquire new systems). Any analysis of cost constraints should always consider capabilities through-life. c. Time. Analysis is invariably conducted under time pressures, including the need to meet deadlines such as Initial or Full Operating Capability (I/FOC). Therefore, the TNA should consider any prioritisation that needs to be taken account of and then constrain the analysis accordingly. d. Safety. Training environments can be constrained by safety considerations, such as on the use of live fire or requirements imposed by safety cases. Note that, regardless of training solution, there is likely to be a requirement to conduct operating assurance through the use of live equipment."
  },
  {
    "id": "61926c48-cebc-46a1-b461-2e4fe3ee4dbd",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "e. Legal. There may be restrictions on training due to legal requirements, such as mandated hours for aircraft control duties or flying, as well as Care and Welfare responsibilities. Acts of Parliament may also influence training options. f. Resource. Analysis should take into account the unavailability or limited availability of both training audiences and potential training support requirements12. 15. Given the significant impact these constraints may have, the TNA should commence with their identification and risk management13, noting the potential impact and options for mitigating any threats or the consequences of constraints. From this analysis, a constraints table, risk register and an assumptions register (including a Master Data Assumptions List as required) should be compiled and maintained by the analyst and reviewed by the TNASG, noting that a constraints analysis is an iterative process and may determine that a training intervention is not the most appropriate way to address the Defence need."
  },
  {
    "id": "2653048a-cc53-455b-863c-eaf9ac0f0616",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "16. The scoping exercise report is an output of the Scoping Exercise, detailing what is appropriate to the training need and, importantly, make training solution recommendations. It should include: a. references to the relevant training policies."
  },
  {
    "id": "3587bd7d-42e8-4492-8e63-21a62c3d99f7",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "b. assumptions, freedoms and constraints14."
  },
  {
    "id": "d254c524-e4ec-456b-9935-7b307969ad08",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "12 For example, access to training areas and the capacity of existing training solutions or infrastructure. 13 To be undertaken in accordance with the Cabinet Office s Management of Risk Best Practice Guidance. 14 Including current resourcing such as course design and the digital skills of trainers and designers."
  },
  {
    "id": "0a357d65-491f-424e-b147-c0e17a9c362b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "c. the conclusions, outputs or recommendations of previous relevant studies (if any). d. membership of TNASG that will oversee the subsequent analysis stage. e. recommendation to continue with the TNA if appropriate."
  },
  {
    "id": "807f54f7-bdf9-4b14-9561-08a0f24ea5ae",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "f. TNA outputs. g. TNA Terms of Reference (ToR). h. confirmation (or otherwise) that there is a training requirement that will fulfil the SOR (if there is not, the DSAT process should then cease)."
  },
  {
    "id": "a9173ddf-8e74-4854-9c4c-04f2b5f81f11",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "i. recommended possible training solution option(s) to be taken forward into the analysis and design stages. j. a section on risk. 17. Training solution recommendations. Training solution recommendations should be examined by the relevant stakeholders at the TNASG. Taking into account time and resources, it will decide the most appropriate way of taking the requirement forward. Where a training solution is recommended and agreed at the TNASG, a plan for subsequent analysis and design activities should be produced. If a training solution is not recommended, the DSAT process should be halted at this point. However, a response to the question,  what should we do to address these deficiencies?  should be given. The problem may not have anything to do with training and may require:"
  },
  {
    "id": "151acd59-7ae6-4f6a-804a-a66b67aabdcb",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "a. a revision of procedures and/or improvements to management and supervision. b. production of role/task aides and/or the reallocation of tasks. c. changes in the approach to personnel selection."
  },
  {
    "id": "05b583e7-18b0-45d6-829d-47163a0924a4",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "d. acquisition of equipment. e. workforce incentives, such as pay and civilian qualifications. 18. The Scoping Exercise Report may include as documented evidence to inform future decisions:"
  },
  {
    "id": "52fc03df-1799-4147-ae0a-97dc800379a1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "a. Summary of new/changed requirement. A summary description should outline the proposed capability or technology/equipment and the benefits of the new or changed training requirement in the context of the Defence effect. This will enable the identification of the nature of the training gap and underpin areas requiring analysis (e.g. are there any changes to CONOPS; what changes are system/equipment function related; are there any impacts upon workforce structures?). b. Policy. Influences concerning policy 15 can affect the TNA strategy and can include various freedoms and constraints placed upon the Training Provider, such as: roles, tasks, structures, workforce levels, finance limits, Health and Safety 15 Particular reference should be made to the Service policies/directives for individual training"
  },
  {
    "id": "d4909766-76b3-473a-9d45-149b721c4a25",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "requirements, minimum qualification levels for prospective role holders and/or tasks, and any accreditation or legislative issues. c. Previous/associated studies. Reference to and use of previous or associated studies is strongly recommended. Information sources include previous TNAs, Human Factors (HF) studies and evaluation reports on similar requirement(s). For major projects, where more than one TNA is being undertaken, it can be useful to indicate the relationship between the various TNAs. d. Potential training services. The major types of training Methods & Media likely to be considered or examined should be included at this stage and then re-examined later. This will reflect the current training policy and should specify any areas requiring particular attention, such as the possible need for synthetic training, embedded training or Public/Private Partnership or Private Finance Initiative (PPP/PFI) solutions. These are only possible options and may change during the TOA/EA as a result of developments in policy, technology etc. An estimate of the cost of these services should be provided. Any new training solutions may have to utilise existing training facilities and associated established support elements (ie course design) which should be recorded in the report."
  },
  {
    "id": "23be1ef8-6277-464f-94eb-6b52905dc225",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "e. Methodology. The TNA methodology should be tailored to suit the specific training requirement but should always provide a full audit trail. For example, in the case of a small change to training policy, a TGA followed by a TOA to establish the most cost-effective Methods & Media would be sufficient. Equally, if the training is to fit into an existing training activity using similar delivery techniques and Media, then a full blown TNA may be unnecessary. The outputs from the scoping exercise and subsequent analyses should be agreed during Stage 1 of the TNA, which will allow the user to select the correct methodology and tools based on the constraints and information available at the time. Analysis should not be conducted as a  check list exercise , but should only be undertaken if it adds value to the TNA. TNA is an iterative process and the TNA outputs are therefore subject to continuous review. f. Resources. An estimate of the resource allocation should be made to include the following: (1) sources of information required including documentation and access to SMEs."
  },
  {
    "id": "b95c759e-04a7-4717-9d92-e75d434b4c07",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "(2) procedure for the review and TNASG endorsement of the Training Needs Report. (3) Cost of Ownership (COO) concerning the responsibility and allocation of funding across the affected budget holders for the design, installation, operation and supportability of the recommended training solution. (4) sources of SME assistance, if applicable, the training workforce and facilities currently available."
  },
  {
    "id": "828e478c-3309-4d72-9638-5d4867ca541d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "a. role objective and responsibilities. b. principal duties and supporting tasks, i.e. the Performance and the Knowledge, Skills and Attitudes required to perform the Role. c. levels of supervision."
  },
  {
    "id": "b286b0a2-9e4a-4c58-bb63-83216e9d3865",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "d. the conditions which cover environment, work conditions and equipment, for example. e. Role Standards. f. aspects of the Role found to be distasteful or unpleasant."
  },
  {
    "id": "7a89e35f-8f23-4ba3-a178-b69d57d32dda",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "g. frequency of task performance and percentage of personnel performing the tasks. h. likely job changes and consequences of inadequate performance. i. task criticality."
  },
  {
    "id": "9bf294fe-b091-47e7-a9d5-81f7d2817a3f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "j. Role-related factors influencing knowledge and skill fade (or competence retention). 16Task is a major component of a Role or duty that can be produced, compiled, achieved and/or accomplished by itself. 17 A  job  can be made up of many Roles. Therefore, it can be argued that jobs (in the traditional sense of a person conducting a single task requiring a single skill, for example) seldom exist. Accordingly, it is more appropriate to analyse a Role that a person will fulfil. An example would be a RN Catering Services rating, who is trained in the primary Role but routinely has other Roles and duties aboard ship that are not related to the primary role (such as firefighting and First Aid). Training that person for the job of Catering Services/Fire Fighter/First Aider is impractical, but training that person for the primary Role , then the Role of fire fighter and the First Aider makes more sense. Thus RA is a more logical term than Job Analysis and more reflective of what this analysis actually does."
  },
  {
    "id": "2b17a5b4-4840-4c63-a0da-ed0da2eaec80",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "a. higher level context, including strategic context operational doctrine and team/collective scenarios. b. external context, including wider environment and conditions, for both individual and team/collective, and number of personnel fulfilling the Role. c. internal context, such as organisational structures, Role dependencies, relationships and responsibilities, and the training audience, throughput and selection processes."
  },
  {
    "id": "b5ddf60e-82d8-44ec-a904-872e9b26b231",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "a. Role objectives. (1) Main. A short, concise statement of the main objective of the Role, phrased in terms of the Performance expected. It should begin with a verb denoting action. Vague terms such as  to know  or  to understand  should be avoided. (2) Subsidiary. Written in the same format, these either amplify the main objective by showing what must be done to achieve it or indicate additional areas of Performance within the Role."
  },
  {
    "id": "02272f4e-fc1d-40e3-b310-95eb3801d33f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "b. Duties and tasks. Duties are the principal activities of the Role holder, are directly related to the Role and are subordinate to the overall Role objectives. They can then be broken down into their component tasks, sub-tasks and task-elements. This is achieved through the Production of a Role Scalar which is discussed later. c. Standards. The Standards necessary for the satisfactory Role Performance should be considered and recorded. d. Conditions. The Conditions under which the Role is performed. An exhaustive list of every trivial condition is not necessary and only the important Conditions should"
  },
  {
    "id": "ba7b1412-6c0e-48f8-9b88-56f703451ace",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "18 TAFMIS has forms entitled  Role Specification  and  Role Description  to assist with this process. be recorded. The breakdown of Conditions into categories of  physical ,  intrinsic ,  social  and  psychological  may be used. e. Responsibilities. Responsibilities should be listed under the headings of  to superiors  and  for subordinates . It would also be convenient to include under  responsibilities  information to the degree of supervision exercised over the Role holder and the extent to which they would be held accountable for their own work or the work of others. This helps set the context."
  },
  {
    "id": "67c3d5c2-0902-404c-bc3d-a5b38ada8935",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "f. Difficulties and distastes. This information can indicate the areas that need to be emphasised in training. g. Criticality. The relative criticality of a task within a given Role should be listed using pre-defined categories (e.g. high, moderate, low). This information can be used to inform risk management activities and decision-making relating to refresher training requirements. h. Role-related factors influencing skill fade. An identification of key factors influencing skill fade. It will be useful to consider both positive and negative influences on skill fade so that the impact of changes to the design of the Role (e.g. increased or reduced complexity, modifications to equipment design and associated resources) can be assessed. This information, along with the KSA, Difficulty, Importance, Frequency (DIF) and criticality analyses will help to inform the identification of appropriate training Methods & Media for both the acquisition and refreshment of Role-related skills and knowledge."
  },
  {
    "id": "0bb99aa1-305d-48a3-8c6b-12b42a9c4e79",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "a. a specific action. b. performed by an individual. c. recognised by a definite beginning and an end."
  },
  {
    "id": "de405db1-3f19-43a1-99bf-2d2f81279cb8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "19 The choice of verb is critical when writing tasks, sub-tasks (and, later, training objectives). Verbs must be observable and measurable. More guidance on this aspect of Analysis and Design is given on the DSAT courses delivered at DCTS. d. performed for a relatively short period of time (could be hours but rarely days). e. observable and measurable."
  },
  {
    "id": "28ab24d5-ddd3-4229-90d9-edfee9891ea9",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "a. Duties. The major functions, or areas of responsibility, of the Role. They have no specific start or finish and tend to be general in nature (e.g. act as Unit Health and Safety Advisor). b. Tasks. Major components of the Role that can be produced, compiled, achieved and/or accomplished by the individual. Each duty usually contains a number of closely related tasks that are essential for carrying out the duty. c. Sub-tasks. Sub-tasks are the component parts of each task."
  },
  {
    "id": "51d61ede-e8e7-42c2-af4b-1c2867faca2d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "d. Task-elements. Task-elements are the sequenced step-by-step component of each sub-task."
  },
  {
    "id": "bbbe387b-43af-4a3e-b01e-471116f20d0a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6",
    "content": "Figure 2: Role Scalar Levels"
  },
  {
    "id": "29da45e2-0ddd-4838-bfbb-b9f5251c439a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "7",
    "content": "Figure 3: Role Scalar Numbering System"
  },
  {
    "id": "d431d46a-a8a7-440f-97be-48b3faf76650",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8",
    "content": "a. displaying a structure to the Role that may not be apparent in real life. b. illustrating the relationship and interdependence of the various parts of the Role. The impact of a failure to perform any particular task can therefore be determined. c. showing areas of commonality and difference between closely related Roles, thus indicating where rational restructuring could take place."
  },
  {
    "id": "679728fc-6faa-4946-9656-45c9e2af0d52",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8",
    "content": "d. showing tasks to be performed with new equipment, related to existing Roles, and thus help assess the impact of new equipment. e. the production of a Role PS, Framework(s) and TOs."
  },
  {
    "id": "22d91910-4fb4-47d9-9974-3b16e09a2055",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "Difficulty Importance Frequency"
  },
  {
    "id": "48950048-8eca-4238-ac02-1860174cba22",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "Training Category Very Difficult Very Important"
  },
  {
    "id": "aaad6eb2-d0f2-41c9-a8d4-17d35dd92fb9",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "Very Frequent"
  },
  {
    "id": "570d0e90-885f-4c20-bd01-0ff6b228caed",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "Moderately Frequent"
  },
  {
    "id": "7896fd14-f81f-48fd-802e-8a998050bf46",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Infrequent"
  },
  {
    "id": "b20d1248-53bd-4635-9caa-fdca87e5a011",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Moderately Important Very Frequent"
  },
  {
    "id": "0d427d29-bb7f-486c-b1dd-a18bc2dac23c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "Moderately Frequent"
  },
  {
    "id": "00bda4ec-ad7c-4210-aa29-ed849cc33d3b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "Infrequent"
  },
  {
    "id": "542ef0e7-566e-4246-bd15-ee6ceea06d53",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Not Important Very Frequent"
  },
  {
    "id": "dee69bf2-9f26-4e92-9676-9dc8fb671f74",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "Moderately Frequent"
  },
  {
    "id": "b8698b45-505e-4369-9eaf-5361b9472367",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "Infrequent"
  },
  {
    "id": "48ebf8a8-969c-4946-ad52-27f111f2c353",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "Moderately Difficult Very Important Very Frequent"
  },
  {
    "id": "94aba4d5-fcc0-404c-a083-8790e9b88bba",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "Moderately Frequent"
  },
  {
    "id": "83a40956-15e0-4580-8978-c38e7582da9f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "Infrequent"
  },
  {
    "id": "f7f195de-4f4b-45a1-960d-0db5165ac927",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "Moderately Important Very Frequent"
  },
  {
    "id": "5993e8dd-4590-46f9-ba93-977162770673",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "Moderately Frequent"
  },
  {
    "id": "a9ffff38-ad76-4882-a451-c5fffcf8b996",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "Infrequent"
  },
  {
    "id": "60a49da5-6d15-4d86-8777-b32b418dd5ca",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "Not Important Very Frequent"
  },
  {
    "id": "a697901a-c70f-451c-b0a4-c3d485089a36",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "Moderately Frequent"
  },
  {
    "id": "8255aa41-a85d-444d-94c3-17003c38f35e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "Infrequent"
  },
  {
    "id": "89636789-d613-4c9e-8c62-35006b143cc8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Not Difficult Very Important Very Frequent"
  },
  {
    "id": "8a96ae3a-c4a5-47ba-8655-a4312125734e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "Moderately Frequent"
  },
  {
    "id": "58f0c293-5321-46c3-9db2-93dced7d5334",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "Infrequent"
  },
  {
    "id": "74176816-f1cf-40f6-8b02-35fdd3cf598c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "Moderately Important Very Frequent"
  },
  {
    "id": "14c107ac-4cf0-4aac-bc3a-21286bfb08b8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "Moderately Frequent"
  },
  {
    "id": "dafb8b76-1445-48ce-8dcd-6acb939a071c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "Infrequent"
  },
  {
    "id": "64eb88e2-a965-4712-9d71-998be31af772",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "Not Important Very Frequent"
  },
  {
    "id": "0270deae-15c2-4344-a416-885eb5757442",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Moderately Frequent"
  },
  {
    "id": "3f366be7-60b2-4b37-888f-a15d4bae7d9d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6",
    "content": "Infrequent"
  },
  {
    "id": "afa09634-b3f0-4504-b76e-7cd35c076769",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6",
    "content": "Table 1: A DIF Analysis Algorithm 20 In TAFMIS, Initial Training Categories are listed as DIF Training Categories."
  },
  {
    "id": "b23a33c6-b3f6-4dcc-a5c0-8009b8bc7886",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "a. Difficulty assesses the chance of performance error by asking the question:  What is the possibility of inadequate performance from the average job holder?  The range can be defined by using two extreme statements, namely,  The task is easily performed once learnt  to,  The task requires constant practice and supervision . b. Importance, assumes that performance error is made and assesses the impact of the error by asking the following question:  What is the impact/consequence to operational capability, safety, lost revenue and public relations if the task is performed inadequately?  Once again the range can be defined by using two extreme statements, for example,  Failure is unlikely to have any impact upon operational capability or well being of personnel or equipment  to  Failure will have an immediate and severe impact upon operational capability or risk of severe injury or damage to equipment . c. Frequent tasks may or may not be Important or Difficult and scales may range from  Once or more a day  to  Once a year  to  Never  (if the task has changed then the requirement to carry out specific sub-tasks may have reduced to nothing). Task frequency becomes significant, however, when considering retraining, since frequently performed tasks do not require retraining if performance is adequate. The following factors may be included during analysis to collect information for future use:"
  },
  {
    "id": "244b13b8-bc84-403c-9473-b1d1474cf3fc",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "(1) Relative time spent on the task (very much above average, above average, below, average, average, very much below average). (2) Actual time spent on task. (3) Frequency of performance (day, week, month, year)."
  },
  {
    "id": "71f96be3-2be0-46d1-9175-82679a85a9db",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "12. An assessment of difficulty encountered in carrying out each task, the importance of each task to the achievement of the main job objective and the frequency with which tasks are performed, are key factors in making training decisions and priorities. DIF analysis is a useful technique which contributes to providing a rational basis for making decisions on the design of training which is superior to guesswork or intuition. However, other criteria may be used to decide upon levels of training; including numbers of service personnel performing the task, ease of training within the unit, how soon after training someone is expected to perform the task and how much time is spent performing the task."
  },
  {
    "id": "fba5633b-9f64-4df8-9814-bed9f461877e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "13. A KSA Analysis is a systematic analysis of  Performance  and/or  Standards  in order to identify the necessary KSA required to perform a Role. A KSA Analysis moves on from what the Role holder does (captured in the Role Scalar), to identifying the KSA that have to be learned to perform the task. The results of an Initial KSA Analysis will help with the generation of Training Objectives and Enabling Objectives and the selection of the most appropriate training Methods & Media, during Element 2 (Design). Two examples of Initial KSA Analysis relating to a Role are at Annex A. 14. Knowledge. Knowledge is information acquired through experience or education; the theoretical or practical understanding of a subject. Knowledge generally involves recalling information, e.g. the knowledge of rules and regulations, names, sequences, classifications, methodology, events, principles or theories. Whenever a task is performed, knowledge is required. When carrying out a task, a possible pre-requisite is knowledge of: a. When to perform; what are appropriate tactics, techniques, procedures, tools or materials?"
  },
  {
    "id": "5c9ca0aa-3a47-4612-8ffd-5dffa891388a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "b. Where are the tactics, techniques, procedures, components, materials and/or equipment? c. How to use/operate the tactics, techniques, procedures, materials, tools and/or equipment? d. What are the safety procedures or constraints; what possible dangers are there?"
  },
  {
    "id": "29401631-aa82-45e2-af81-a4a3cbce337a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "e. What are the testing or checking requirements and procedures involved? f. What constitutes task completion? 15. It is important to note that a Role PS can refer directly to a requirement for knowledge when it is linked to the practical performance in a Role as stated in the Role PS. KSA Analysis identifies the supporting knowledge required for task performance. Training should only contain knowledge which is essential to the satisfactory performance of a task. For example, where key references are available at the time a task is performed, there may only be a requirement to learn how to access the information rather than learn the contents. Wider knowledge acquisition and application is the remit of education."
  },
  {
    "id": "24ad042b-a50c-4d2a-bc8f-f59f88d47ec0",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "16. Skills. A skill is defined as an organised and co-ordinated pattern of mental and/or physical activity. It is the ability to do something well. It is built up gradually by repeated correct training or practice. At Initial KSA analysis, the skills listed are kept quite high level. Later on in the Design process the split into mental and physical/practical skills can be further refined: a. Mental skills. These constitute the knowing how (procedural knowledge) as opposed to the knowing what (facts) (e.g. knowing how to calculate percentages, knowing how to interpret technical data, knowing how to classify sonar contacts). It would not be possible for the trainee to learn all of these things as facts because too many individual instances exist. The mental skills the trainee learns, therefore, enable them to respond to entire classes of situations, e.g. to make decisions when presented with information and alternative courses of action. b. Physical/practical skills. These can be described as learned capabilities of performing actions in an organised and fluid manner. They are overt and observable during their performance. Skills may be discrete (operate a switch) or continuous (fly/drive a vehicle). These skills are learned in connection with common activities such as using a computer, driving a car or playing a musical instrument. Many tasks performed in Defence can be categorised as having a large physical component, e.g. stripping and assembling a weapon (discrete), flying an aircraft (continuous) and tying a bowline (discrete). Complex physical skills can often be broken down into smaller sub-skills, which can be learned separately and then put together for total performance. An example of this is swimming, which has 3 sub-skills (arm action, leg action and breathing technique), which can be learned and practised separately and then performed as one. More complex skills such as flying/driving, are similarly broken down into their component parts and taught as discrete skills in discrete lessons."
  },
  {
    "id": "6fcc4893-9b64-408a-b209-0d4edf77804e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "17. Attitudes. An Attitude is a way of thinking and feeling about something, often but not always demonstrated through behaviour. The identification of Standards relating to personal qualities and Attitudes is perhaps the most challenging part of the KSA Analysis. This is because Attitudes cannot always be observed directly and hence the creation of definable standards can prove difficult. Attitude is defined as a predisposition resulting in a tendency to act or react in a certain manner when confronted with another person, group, object, situation or idea. It is important to understand that this predisposition to think and feel in a certain way does not necessarily result in observable behaviours. An example of this could be an individual who holds an Attitude that all dogs are dangerous. However, this attitude may not be obvious to others when the individual is handling a dog with which they are familiar and have learned is friendly. Table 2 illustrates how Attitudes can manifest themselves. Attitudes generally: * are learned from experience (or from others);"
  },
  {
    "id": "0a5237fa-bc01-4dff-914c-808b6bb0cbb9",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "* may include thoughts, feelings and behaviours; * influence our behaviours towards people or objects; * may be stable and persist over time; but"
  },
  {
    "id": "9e9441ac-e688-4e8d-beb5-0bdc3ee66bfe",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "* can be changed rapidly through experiences, circumstances, education or training. Attitudes have three main components: * what we think, e.g.  all dogs are dangerous ."
  },
  {
    "id": "b90b03c6-5d35-407f-8d69-8862ab364ed7",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "* what we feel,  anxiety or fear near dogs . * how we act,  avoid or approach dogs  (observable behaviour). Table 2: Attitudes"
  },
  {
    "id": "b276a1a5-cbb9-4a03-9bbe-683baff36da5",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "18. Within each role there are tasks that have an attitudinal component related to their performance. Initial KSA Analysis identifies Attitudes associated with role performance to determine the required direction of that attitude. At this stage the Analysis of Attitude can be quite high level. The depth of the analysis within the attitudinal domain will occur at course design stage/A Spec stage. Once the Attitudes required to fulfil a Role are identified, training can be designed to achieve them. Knowledge and skill training can be wasted if attitudinal training is ignored. A lecture on computer security may be successful in imparting information on how viruses are transmitted but unless it develops an attitude of security consciousness the trainees may not use the knowledge they have gained on the subject. 19. To assess an attitude, behaviour must be observed, possibly over a period of time. To assist subjective judgements on attitude an objective criteria should, where possible, be used to support the decision. Defining the negative, what is unacceptable behaviour, can result in a simpler and more precise Standard. A Behaviourally Anchored Rating Scale (BARS) is an example of a tool which can be used to assess observable behaviour objectively. Although a BARS (Table 3) can be used to measure attitude indirectly through observing behaviour, much care is needed when inferring Attitudes from observable behaviours alone. Attitudes may also be directly measured using validated questionnaires or other psychometric instruments21. Some examples are presented in Table 3. Note that whilst BARS is predominantly a tool used in the training environment, forming part of the ASpec if appropriate, it is mentioned here because it is useful to bear it in mind at the RA stage."
  },
  {
    "id": "53dc9df5-1ab8-4870-8fae-08a5f0935129",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "COMMUNICATION Rating Tick"
  },
  {
    "id": "9339716c-2410-48be-8b53-6e4258cb53e8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Behavioural Indicators Unsatisfactory (-1) Speaks to others in an aggressive manner."
  },
  {
    "id": "86e4c17a-fbfe-4998-8b0a-cf8e5c983106",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Fails to listen effectively Ignores the opinions of his/her peers Does not articulate logically or clearly"
  },
  {
    "id": "9568ac8d-e12d-4fd2-a723-6e48d1e1d060",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Meets expectations (+1) Can adapt style of communication appropriately Communicates clearly and logically so others understand"
  },
  {
    "id": "dc56cbce-1321-45a5-b221-e1e01f584e6a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Actively takes part in group discussions Demonstrates active listening skills Exceeds expectations (+2)"
  },
  {
    "id": "b7924480-c82a-4bf7-8ecb-67e612833e3c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Leads group discussions effectively and appropriately Chooses specific language and detail to capture and maintain attention of others Demonstrates appropriate confidence and assertion without arrogance"
  },
  {
    "id": "7dd8d3c9-bda0-48a0-9062-ac823cda158e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Can present arguments logically and clearly without aggression Overall Score obtained during observation = Table 3: Behaviourally Anchored Rating Scale"
  },
  {
    "id": "73ef0bbe-6b58-48ec-b172-4b6ffc6da073",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "20. Although Attitudes may be inferred from observable behaviours this is prone to biases (e.g. a group of soldiers may set up an Observation Point (OP) with no attempt to camouflage their position.  This might infer that they do not care (Attitude) about 21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life. concealment. However, they may simply not know (Knowledge), or have forgotten about concealment rather than not care about it. Similarly, they may lack the ability (Skill) to properly conceal their OP). Before remedial training is implemented, identifying the correct domain is critical. Targeting an Attitude may be inappropriate if the knowledge or practical Skill is lacking."
  },
  {
    "id": "8360f31d-a7f2-423b-abcd-79fe380f3326",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "21. In order to develop an optimised training system it is important to consider both how Knowledge, Skills and Attitudes are acquired and how they are retained over time. Understanding the rate at which different types of Knowledge and Skills fade can inform training design and the setting of refresher training intervals. In order to conduct refresher training interval analysis, it can be useful to use a more detailed breakdown of Knowledge and Skills than that discussed in DSAT activity   Initial Knowledge, Skills, Attitudes (KSA) Analysis. Literature from psychology and cognitive science suggests that Knowledge and Skills can be broken down as shown in Table 4. Type Description"
  },
  {
    "id": "094d5bbe-a87d-4aa0-92c0-df81eaf1b5d2",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Task Examples Continuous Psychomotor Skills"
  },
  {
    "id": "4403ba11-67d1-41b2-b862-620aaa2247ed",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "The ability to perform (repeated) motor actions that do not have distinct beginnings or endings. Flying aircraft, driving, soldering and welding."
  },
  {
    "id": "bac679c7-68be-434b-9556-7adb7dfc30b1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Discrete Psychomotor The ability to conduct physical tasks with discrete beginnings and endings. These physical tasks have a procedural element."
  },
  {
    "id": "40200b75-a727-4291-84d8-2b5ce8c115fa",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Weapon handling e.g. assembling and dis-assembling a rifle; exchange steering box assembly. Explicit Knowledge"
  },
  {
    "id": "773eb446-f352-44c2-b717-9d8406b8333e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Explicit knowledge required to conduct a task such as facts, principles, concepts, and theories. Quality and engineering hygiene measures; safety regulations; knowledge of how to use hand tools and testing equipment."
  },
  {
    "id": "756bb311-6191-41ed-b952-f6733b6715cb",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Decision Making Application of cognitive processes such as judgement, problem solving, reasoning and analysis in order for an individual to arrive at a decision."
  },
  {
    "id": "aa0f4c9d-9219-459a-ba70-26359b4b78d9",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Fault diagnosis Procedural Skills Ability to remember a sequence of steps and their order so as to execute a task. Application of this type of skill relies on the working memory capacity of an individual, and hence the procedural aspect of the execution of the task is inherently cognitive in nature. Motor or"
  },
  {
    "id": "5f1adb03-40d0-4b57-9b78-0ec7fc1af5dc",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "physical elements are minimal. Fault finding; Navigating through menus and submenus on a digital Battlefield Management System to execute a command. Table 4: Knowledge and Skills Domains"
  },
  {
    "id": "846f9c2c-8d88-43b9-814e-d38d645c3d3f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "22. Without practice, continuous psychomotor skills and explicit knowledge are retained for the longest; discrete psychomotor and decision-making skills have moderate retention over time and procedural skills fade the most quickly. The retention of Knowledge and Skills over time is moderated or influenced by how often the task is performed or practised. Table 5 shows the impact of task performance frequency on the retention of the different types of Knowledge and Skills. For example, if discrete psychomotor skills are performed very frequently then the retention level is High. However, if performed infrequently then the retention level is reduced to moderate. Type Frequency of task performance"
  },
  {
    "id": "0ae389a5-140d-47c7-a6f5-1c347dd22318",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Retention level Continuous Psychomotor skills Explicit Knowledge"
  },
  {
    "id": "405c418c-3855-4975-b9ce-5a37ee0df5be",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Very Frequent High Moderately Frequent"
  },
  {
    "id": "4e115a53-957c-486b-859b-4bec68a602f5",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "High Infrequent High"
  },
  {
    "id": "d260daa8-bff0-4ae0-8479-1a758c1ebc7e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Discrete psychomotor skills Decision- making skills Very Frequent High"
  },
  {
    "id": "edcb5912-5b9a-4b40-941c-ecfee10ffb68",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Moderately Frequent Moderate Infrequent"
  },
  {
    "id": "3bf2e56c-eb70-4af8-b0a1-2ce603a026f5",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Moderate Procedural skills Very Frequent"
  },
  {
    "id": "f029bdc9-e730-449b-8589-a3c3d7049de1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Moderate Moderately Frequent Low"
  },
  {
    "id": "6d20d50a-6aad-40d5-9863-9916632a0912",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Infrequent Low Table 5: Effect of Task Frequency on Knowledge/Skill Retention"
  },
  {
    "id": "7d73c7b6-b9f5-42b0-9a27-e6b249585d48",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "23. The retention level of the Knowledge and Skills for a given task should be taken into account when setting refresher training intervals. It is important to note that a number of role-related factors (in addition to frequency of task performance) can also influence Knowledge and Skill fade, e.g. designing equipment, job aids and operating procedures in accordance with good practice (which includes built-in user feedback for equipment and interfaces, logical steps within procedures). 24. Training methods, media and assessment regimes which ensure the effective acquisition of knowledge and skills in the first place also help to reduce skill fade. Table 6 provides a summary of training  strategies  which can be used to improve knowledge and skill retention. The first column indicates which types of knowledge and skill the strategy is relevant to. Training Strategies"
  },
  {
    "id": "4de7f3ef-3c2c-428e-8dfe-47e587db916e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Description Job aids (Relevant to all knowledge and skill types)"
  },
  {
    "id": "88efa04d-4300-45eb-8778-370f3a5f5e0d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Provision of a job aid. Job aids can reduce operator memory load and the likelihood of skill fade. Their influence depends on their quality and practicality. Feedback (Relevant to all knowledge and skill types)"
  },
  {
    "id": "00531487-4826-466d-989e-c4a220e7c99a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Provision of quality feedback. Detailed feedback stemming from a learner s performance, combined with a chance to improve performance, is important to skills acquisition. Reducing the frequency of feedback during training promotes long term retention and skill transfer. Communicate utility of training"
  },
  {
    "id": "a413f165-8471-4339-97b2-b73a04106df7",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "(Relevant to all knowledge and skill types) Training is perceived as having high utility when a link is perceived between required performance and outcomes valued by trainees. Those who perceive training as valuable are more likely to apply newly acquired knowledge, skills and behaviours to the job than trainees who do not."
  },
  {
    "id": "b4a4037c-ebdd-43cf-9513-c7890f625ef1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Assessment enhanced learning (Relevant to all knowledge and skill types) Assessment enhances retention, whereas continuous training without assessment has a limited effect on retention. When used frequently during initial training, assessment of performance enhances skill acquisition and retention. Assessment combined"
  },
  {
    "id": "1290be21-ef9a-4667-bd69-53ddc36adb8e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "with the provision of feedback on performance assists learning and retention. Provision of recognition cues (Procedural skill type)"
  },
  {
    "id": "5f2c3374-efc2-45c8-a19d-72f3848747e3",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Providing recognition cues to learners has been shown to have a beneficial effect on learning and retention, particularly in the retrieval of aspects of long, complex or procedural tasks.  For example, recognition cues can be used to  prompt  a user as to"
  },
  {
    "id": "ff0f1bb3-da9d-4f0d-811c-0035fe90bab4",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "what the next step should be in a task performed on a digital Battlefield Information Management System (BIMS). Part-task training (e.g. continuous and discrete psychomotor and procedural skill types)"
  },
  {
    "id": "852d5a27-8261-493e-9140-49ca18fd8d49",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Tasks can be decomposed into components e.g. subtasks. Part- task training involves trainees learning and practising these task components in isolation. Once mastered the whole task should be practised.  This strategy is particularly beneficial for very complex tasks with cognitive (e.g. procedural) and psychomotor components. Appropriate simulation fidelity"
  },
  {
    "id": "ea69f2e0-cd17-486d-9df4-026cabd2da1f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "(e.g. continuous and discrete psychomotor, procedural, and decision- making skill types) When the acquisition of cognitive skills (procedural/decision making) is required, it is the psychological fidelity of a task and not its physical fidelity that drives skill acquisition and consolidation. However, where cognitive and psychomotor skills are combined high fidelity simulation helps the consolidation of skills."
  },
  {
    "id": "691e8cfa-dfb8-4c8c-83c0-6dab937993a8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Procedural instructions (Procedural skill type) Structure instructions in a way that will induce learners to expend the cognitive effort needed for effective learning. Inclusion of more general steps helps learning transfer; they force the learner to try to understand the system or domain and engage in effortful cognitive strategies. Inclusion of examples with general instructions supports initial performance, because it helps the"
  },
  {
    "id": "cc40e4b0-16cc-4c6b-9408-91a88f420b32",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "learner understand what they needed to do. Refresher Assessment (e.g. discrete psychomotor, procedural and decision- making skill type) Assessment of core knowledge, skills and behaviours reduces the burden on refresher training. Training is only required for those task components where performance is below the required level of proficiency. This can exploit advances in new training technologies for the assessment of core knowledge, skills and behaviours at any point in time. Decision-making skills can be"
  },
  {
    "id": "cb7688f3-af76-4f45-b826-fbe8499bb146",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "assessed using novel scenarios. Standardised and recorded assessment (Relevant to all knowledge and skill types)"
  },
  {
    "id": "bf866ae4-2151-42c5-9527-d65da9cb4fa7",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Recording trainee performance helps trainers in making objective assessments of learners  skill acquisition and in targeting the provision of feedback. Match between training and operational environment (Relevant to all knowledge and skill types)"
  },
  {
    "id": "5d2ba652-428b-4307-967f-acd84d8cb4d9",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Retention is enhanced if the training context and situational cues are similar to those which are experienced in the operational environment. Individuals should be exposed to as many different situations and content-based scenarios as possible to promote knowledge and skill transfer. Overlearning (overtraining) (e.g. discrete and"
  },
  {
    "id": "1e21aa9f-ce02-4857-adeb-4ce92f0c31f7",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "continuous psychomotor, and procedural skill types) Overlearning refers to the continuation of practising a task after error free performance has been achieved. It can enhance speed of performance after accuracy has reached a ceiling. Effective for both psychomotor and cognitive skills, although any benefits provided are stronger for tasks with a cognitive element (e.g. memory for procedures).  Overlearning can benefit, e.g. the acquisition and retention of safety critical drills which can be proceduralised. It has little effect on long-term retention."
  },
  {
    "id": "3777d45a-4835-4503-97a3-c291f678c3a1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Variable practice training (Relevant to all knowledge and skill types) Varying the practice of knowledge and different skills so that items are intermixed across the training programme rather than repeated in concentrated blocks; this enhances long term retention after extended periods of no practice. Acquisition can take less total time and the retention can be 50% better. The optimal inter study interval in distributed training protocols lies between 10-30% of the retention interval with longer inter-study intervals enhancing retention more than shorter inter-study interval.  A longer-than-optimal spacing is better than shorter- than-optimal spacing."
  },
  {
    "id": "61bbe400-199d-4561-91fc-5a25cd86d9eb",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Active learning (Procedural and decision- making skill types) Active learning can be more effective than guided learning. The instructor creates a training environment in which the trainee can: i) learn to organise new information into existing mental frameworks which hold prior knowledge in order to generate new knowledge about the context; and ii) practise the application of newly acquired knowledge and skills. Knowledge, skills and behaviours attained at a higher (cognitive) level are retained for longer. An example is error management training where trainees are given the opportunity to make errors and learn from them. Trainers should do the following: i) Present trainees with a series of practice examples illustrating the range of different conditions that they may subsequently encounter in the field including any unusual situations; and ii) Encourage trainees to think about these situations, make errors and learn from them."
  },
  {
    "id": "7d527d0a-0f83-4403-86c4-63f6ef6d303b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Guided training can be blended with active learning for complex tasks by directing trainees in how to explore training resources and make errors so that it is clear that they are an expected aspect of training. This ensures that trainees experience the same set of errors and do not feel responsible for them. Task-oriented training (e.g. knowledge and decision-making skill types)"
  },
  {
    "id": "84c6f7a5-c3e0-4f1f-83aa-3742b230ba18",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Use the context of a given task to train the knowledge, cognitive skills and behaviours required instead of teaching material at an abstract level without reference to how it will be applied on the job. This strategy optimises the level of original learning and retention. Standard training scenario (Relevant to all knowledge and skill types)"
  },
  {
    "id": "58994324-2622-4b9c-914c-0ec3bea76583",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Use of standard scenarios that are progressive in difficulty would allow students to build on knowledge and skills already gained. Standardisation also enables comparisons to be made between students and training facilities as all trainees would have a standard background. Table 6: Training Strategies to Improve Retention of Knowledge and Skills"
  },
  {
    "id": "f7a827c8-9920-44a9-bc15-dc0a131e2ea0",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "25. A thoroughly conducted RA will be wide ranging and will include consideration of levels of supervision, work conditions, task criticality, difficulties and distastes, frequency of task performance, Role-related skill fade factors, percentage of personnel performing the Role and consequences of inadequate performance. All of this information, in conjunction with information on trainee entry standards, trainee throughput and knowledge of the likely training environment, can lead to conclusions regarding the balance between training delivered as part of the TPS and training delivered as part of the WTS. These conclusions are expressed through the use of training categories. A number of techniques may be used to derive training categories, with the main analytical tool being the DIF Analysis already conducted. Training categories are defined in Table 7. Training Category Definition"
  },
  {
    "id": "5d9b8314-d4d4-4942-871d-da1ad280616e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "By the end of the training activity the trainees will have performed the whole task several times, to the full Role Standard, and under realistic scenarios and conditions in which the physical, functional and environmental fidelities were accurately reproduced. The trainee will be able to perform the task competently, immediately on arrival in the workplace."
  },
  {
    "id": "61ff235a-67e9-4540-9f69-3eeb8b6b0003",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "By the end of the training activity the trainee will have performed the whole task at least once to full Role Standards, under realistic physical, functional and environmental conditions and in a realistic scenario. The trainee should be able to perform the task on arrival in the workplace."
  },
  {
    "id": "5979d0d7-d391-4c52-a106-461f0fb8ef8e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "By the end of the training activity the trainee will have performed the whole task in a training environment to a lesser Standard than required in the Role (safety Standards to be met in full)."
  },
  {
    "id": "4f4059dc-03b3-4e9f-bb84-46bc1159538b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "By the end of the training activity the trainee will have demonstrated an adequate level of underpinning Knowledge and principles required but will not have applied it to develop the Skills required to perform the task."
  },
  {
    "id": "bb614e92-20c4-405d-b1d1-07a7ffafc007",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "All training delivered in, or under the auspices of, the workplace."
  },
  {
    "id": "6332812b-c374-43de-8bef-674065ace809",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6",
    "content": "Trainees do not require any training. Table 7: Training Category Definitions22 26. Other criteria influencing training categories. Once a suggested training category has been selected (using information from the DIF Analysis), it should be subject to further review as other factors may result in an increase or decrease in category. Other criteria that may influence the training categories that relate to the Role environment are listed below:"
  },
  {
    "id": "4e3ba8af-bdfa-4110-9ad3-18270ffe3cd6",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6",
    "content": "a. How many people perform the task? This may determine the need for training and the priority given. b. How much time is spent on the task? This can sometimes be more important than frequency. c. Realism and safety. These considerations may make it impossible to conduct any training. Tasks falling into this category, and how they are dealt with, are covered in the next section (Element 2, Design, 2.2.3, RTGS)."
  },
  {
    "id": "8fad89e8-82b0-47fa-8859-6955b9c76e60",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6",
    "content": "d. Degree of supervision in the workplace. If closely supervised when performing a task, the training category may be reduced since the supervisor can detect errors in- role and then correct them. e. Time interval between training and first performing the task. The training Standards may deliberately be higher than the required Defence standard in terms of timing or accuracy to avoid knowledge/skill fade. 22 It is recognised that Training Categories require further review to reflect the blended approach to Defence training."
  },
  {
    "id": "c6058946-c833-440a-aecd-7f226fe3a14e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6",
    "content": "f. Legislation, regulations and government policy. Regardless of training category, a task may have to be included in training if those trained are to be authorised to carry out the task. g. Legally mandated civilian accreditation. The inclusion of training for a task originally allocated a low category may be critical for obtaining legally mandated civilian accreditation, which is a mandated requirement of that Role. An example is the requirement to obtain a civilian driving licence before progressing to driving military vehicles."
  },
  {
    "id": "23350db4-0bb5-4afe-aadc-687adb927c5a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "a. Role Scalar. Carry across the duty, task and, if appropriate, sub-task statements from the Role Scalar. The numbering system used should be used on the Role PS to ensure the two documents are linked. b. Conditions. Identify and list the important Conditions under which the tasks will be performed (an exhaustive list of every trivial condition is not necessary). The Conditions statements should specify the physical location, level of supervision and any other particular environmental factors associated with the task. It may be helpful to breakdown the Conditions into categories of  physical ,  intrinsic ,  social  and  psychological . c. Standards. Identify and list the Standards to which the tasks will be performed. They will be either:"
  },
  {
    "id": "32b9c377-334f-4489-98ab-c1ecade31074",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "(1) Product Standards. Minimum absolute Standards, such as time, accuracy and safety limits. (2) Process Standards. It may be important that certain procedures are followed in a particular sequence in order to successfully achieve the Performance. Often these will be listed in a technical manual and the Standard may include a reference to this. If not, these steps may be given as process Standards and are the essential sub-tasks and task-elements from the HRA."
  },
  {
    "id": "9aacc2a3-8423-46e1-9708-bcc8816abaa3",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "(3) Combination of Process and Product Standards. Where Standards are defined in more detail in other documents, the references should be in full and include the issue number and date. Where publications change frequently reference may be made to the  most recent issue 23."
  },
  {
    "id": "d2f59b3a-c64d-4252-92e4-f93b443fdf39",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "a. Competency (plural: competencies) is the underlying characteristic(s) of an individual which results in effective and/or superior performance within a Role. OJAR/SJAR is an example of an organisational level competency framework that is common to all Service personnel. Professional competency frameworks can also be used in order to provide guidance to defined professional groups, such as the Royal Navy s Command Competency Framework, where there is a need for longer term individual professional development and/or selection. b. Competence (plural: competences) is the measured ability of an individual to consistently perform a particular occupational skill or range of skills to a required Standard, under prescribed Conditions. The Role PS serves as the statement of the 23 In this instance, however, analysts must ensure that their references are up to date."
  },
  {
    "id": "efc4ece7-9722-4a8f-bc54-e3a883aa85f2",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "Competence performance required for Defence under the DSAT model, articulating the skill orientated requirements of a Role."
  },
  {
    "id": "4853f828-53ac-4bac-8d43-e331fff03ead",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "INDIVIDUAL\tJOB What they are like\tWhat they can do Select & Develop"
  },
  {
    "id": "1bcda64b-1bad-4991-9085-9335b0737c19",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "COMPETENCY Source: Young, M. (2005).  A model linking competency, competence and performance . Competency and Emotional Intelligence. Summer 2005."
  },
  {
    "id": "f84c1e17-0472-4be4-bead-3eaaec75746d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "Figure 4: Relationships between Competency, Competence and Performance"
  },
  {
    "id": "ba82808a-bf61-4ca0-9db2-968d131aa71e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "framework for particular professions/trades in Defence. The use of an established competence framework does not absolve the analyst from capturing both the requirement and solution within the TrAD along with the necessary documentation; ensuring it is endorsed by the CEB. In particular, where a competence framework is used, CEBs should assure themselves that the solution does not greatly exceed the requirements of the role just in order to meet desirable external accreditation or to save resource expenditure on the analysis phase, which may be detrimental to the final training solution."
  },
  {
    "id": "6b184271-7ea8-4d7f-a2e8-de709fa5f6f4",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Competence Retention Analysis (CRA) is a scientific methodology developed as a practical approach to predicting the retention of different knowledge and skills that underpin military tasks at the workforce level. CRA is intended to assist Defence to reduce the impact of skill fade and enhance competence retention. It is relevant to two audiences as follows: Training analysts can use the outputs of CRA during the Training Needs Analysis (TNA) process to justify training solutions and the training budget; and Training designers can use the outputs of CRA during the design phase to inform the scheduling of refresher training or practice intervals, and during the development of training to mitigate knowledge and skills fade. CRA can also be used retrospectively to improve training design and to inform decision making about the specification of training priorities (initial and refresher), where issues are identified during the TNA evaluation process."
  },
  {
    "id": "42697351-3c77-4f8b-a0c4-4ff39b918da3",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Link: Competence Retention Analysis Handbook"
  },
  {
    "id": "55b9cd2b-2ea0-49c2-a57e-7d6337608280",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "a. an update of the information contained in the Scoping Exercise Report and RA (if required). b. the additional learning requirements, if any, of the Role holders in terms of KSA at the sub-task and task-element levels. c. a summary statement of the tasks identified for training."
  },
  {
    "id": "21cf719c-f3c6-4fd5-9d5e-01f44b1d10a2",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "d. statements of Training Gaps24, in terms of any Performance delta, between the requirements of the Role PS / Framework(s) and any existing TOs. e. The decision whether to provide additional training or not, by providing a summary of the implications of the new Performance requirements when compared to existing training. This should be presented as statements for each task, identifying additional workplace and unit training requirements with a statement of any associated penalties regarding reduction in capability. If the option to continue existing training with existing resources is an acceptable risk for all Role PS identified in the RA, then the TNA is complete and a TOA may not be required. f. Whilst the TNA is designed to look at the gap that cannot be delivered by existing training, it should also consider the resource implications on existing training activities and the ability of those Training Providers to deliver in respect of a change in training throughput."
  },
  {
    "id": "e7d82897-df28-41b3-bd9d-1d1785381612",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "24 There may be multiple training gaps. For example, there will be two gaps if some personnel are migrating from a predecessor system to a new system, while others are coming directly from basic training to the new system. Early knowledge of workforce plans is important; if this information is unavailable, assumptions must be made and clearly stated."
  },
  {
    "id": "0ad4310b-016c-4baf-947b-566e556c7e29",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "Individual Training Objectives (three part format) Performance Conditions"
  },
  {
    "id": "93dac2cf-3519-4e52-86e6-fe23947c92f5",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "Standard What the trainee should be able to Do after training... Use an observable and measurable action verb"
  },
  {
    "id": "2e5532c5-3adf-4050-9ec7-1ea4fca2527a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "with What and Where... Specify the circumstances of the Performance and How well."
  },
  {
    "id": "a13a7e39-0601-4f38-a509-275b4ad9f4b8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4",
    "content": "State the Standard to be achieved for the Performance Table 8: Individual Training Objectives (Performance, Conditions, Standards) 25 A lesson, series of lessons, a course, exercise, or training activity."
  },
  {
    "id": "19de38f9-c761-476d-b215-527ba99c8230",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "a. if the task wording is not precise b. if the task has more than one objective. c. to make the Performance absolutely clear to any reader."
  },
  {
    "id": "594d73bb-86bf-4905-bbcb-e61c435ef34d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "7",
    "content": "a. Limitations to the range of Performance.\tSuch as, security, safety or legislative. b. Equipment. Such as tools, role aids, clothing, equipment. c. General situation. Indication of location, terrain, weather, daylight, climate, the threat, psychological, physical and social factors under which the training Performance is delivered should be detailed."
  },
  {
    "id": "2189d295-c033-44e2-8b9b-c2de92183992",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "7",
    "content": "d. Support. People, agencies, orders, standard and emergency operating procedures, manuals, references, check lists etc that are available to the trainee."
  },
  {
    "id": "ee486cef-c78c-4d8e-ba4a-1f9ba41f04ca",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "9",
    "content": "26 Derived from the task but not always a directly matching the task. 27 Verbs such as  know  or  understand  do not adequately define an action on the part of the trainee and are not observable or measurable.  Diagnose ,  assess ,  select ,  identify ,  distinguish  are much more readily witnessed and can be assessed more easily. taught and how the trainee is assessed. For example, if a very high Standard is required, the trainee will receive a large amount of training for the Performance (creating the possibility of becoming over-trained) and may be subject to strict assessment, such as no mistakes. The Standard should be accurate. Some Performances may be subject to external rules and regulations, i.e. the Standard is dictated such as28:"
  },
  {
    "id": "75997b41-0ace-4ea0-ac07-53c923277fdd",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "9",
    "content": "a. Health and Safety. b. Nuclear. c. Weapons handling."
  },
  {
    "id": "f47d2ec9-e649-44dd-9b0a-6dcdcb2573bd",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "9",
    "content": "d. Flying regulations (such as Civil Aviation Authority). e. Legal requirements, both national and international."
  },
  {
    "id": "8b1c9d76-8c40-454c-886a-c529d83f4801",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "12. TO Tagging and Numbering. TOs should be tagged to identify them as a Core (training) requirement, Legal requirement and/or Accreditation requirement, which is denoted using a letter (C, L, A) or a mark in the relevant column on the training statements with amplifying comments if appropriate. To ensure that training is allocated to all tasks, the link between tasks and TOs should be shown through an auditable numbering/identification system. This can be achieved by using the task numbers from the Role PS to identify their dependent TOs. An example is at Table 10. Original task number:"
  },
  {
    "id": "bef6c917-6eec-4d6d-b818-1bc17cd9f567",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "Single TO derived from one task: TO 2.1 Multiple TOs derived from one task:"
  },
  {
    "id": "e3a1acea-bcbd-4551-a316-18632564c21f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "TO 2.1a TO 2.1b Table 9: Task Numbering System 28 If a performance is affected by such factors, the document or regulation should be clearly referenced in the Standards element, such as,  in accordance with publication/law/act, section X, paragraph Y, date and version."
  },
  {
    "id": "a26132b8-def0-428b-94c7-c151b93a5c2c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "29 Not all organisations carry out Fidelity Analysis at this stage. Some organisations carry it out later on in the design process. 30 For example, if the Role conducted in the workplace environment (the real world) must be done at 100%, and the training environment can only replicate the workplace environment to 89%, then that is the fidelity to which the training requirement matches the role requirement. It is not to be confused with Gap Analysis, as fidelity is about replicating the totality of the real environment in training, rather than seeking the gap between existing training and new/changed training requirements. a. Physical fidelity. Physical fidelity can be useful to familiarise trainees with the visual, spatial and tactile characteristics of equipment, consoles, compartments, platforms and threats (including applicable reference manuals, Standing and Emergency Operating Procedures etc). Physical fidelity can be broken down into these sub-categories:"
  },
  {
    "id": "292c0877-e546-4707-ae10-087cab77f82a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "(1) Layout. Position of the controls etc, relative to each other. (2) Look. Shape, colour, luminescence and size of interface. (3) Feel. Feel and movement of the interface during use."
  },
  {
    "id": "11034683-a941-4286-9b6c-8f576ec685dd",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "b. Functional fidelity. Functional fidelity is useful in providing trainees with exposure to equipment functionality, doctrinal procedures, and maintenance routines which are required to be exploited in order to deliver the desired military effect. Functional fidelity can be broken down into these sub-categories: (1) Format. Format of data displayed, or action taken. (2) Content. Information displayed or heard, frequency, text colour etc."
  },
  {
    "id": "c742b84c-fffd-41ed-b91d-f630d4399026",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "(3) Response. Data change rate and display response times. c. Environmental fidelity. Environmental fidelity can be useful in preparing or  acclimatising  trainees for the conditions they will be operating under and simulating some of the conditions that can hinder Performance. It can be easy to  gold plate  environmental fidelity requirements beyond what is essential to provide the necessary cues, stimuli and responses, but high levels of environmental fidelity can be beneficial in exposing trainees to complex operating environments and  fog of war  type issues. Environmental fidelity can be broken down into these sub-categories: (1) Sound. Background noise, conversation and sympathetic resonance."
  },
  {
    "id": "5700ae03-6001-44c8-bb74-b23fc4a032df",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "(2) Motion. Incidental movement of the system, equipment or platform. (3) Ambience. Heat, light, smell, smoke, humidity etc. (4) Geographic features. Effects on sensors, infrastructure, SOPs etc."
  },
  {
    "id": "c2bed6d6-40d8-4b55-842b-681181a44b7f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "d. Tactical and cultural31 fidelity. Tactical and cultural fidelity will help identify requirements that enable individuals and teams to train as they intend to operate. Exposing trainees to the types of units, threats, allies (including neutral or  white  forces), cultural issues and geographical locations that they will experience on operations, can also be used for mission rehearsal training or tactical development. Modern training technology, particularly simulation, enables accurate representations to be included in training quickly and cheaply. Tactical and cultural fidelity can be broken down into these sub-categories: 31 To succeed on many operations, UK Armed Forces will need to understand and interpret the nuances of local cultures with and within which they will be operating. Introducing cultural elements into training will be essential in many cases - Future Operating Environment 2035, Development, Concepts and Doctrine Centre, 2015. (1) Threats. Enemy characteristics (number, tactics, equipment etc)."
  },
  {
    "id": "460fa315-4ff2-49ee-84f6-66d90a3e7b8a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "(2) Allies/Neutrals. Allied and neutral forces characteristics (number, tactics, equipment, culture etc). (3) Conflict character and location. Type of operation, presence of media and/or Very Important Persons (VIPs), cultural/religious behaviours, historical implications, infrastructure and building implications etc. (4) Team interactions. Command and control (C2) relationships, communications, situational awareness."
  },
  {
    "id": "5dd0a34f-91de-4fea-a13b-3ecd187b3148",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "Fidelity Requirements"
  },
  {
    "id": "b4a3efab-df33-459d-9a44-d0b4ba331c6b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6",
    "content": "Factor Indicator Definition"
  },
  {
    "id": "e1a811c7-b561-4c81-a98f-fbfacd9805f6",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6",
    "content": "Impact 0 None"
  },
  {
    "id": "b68418e1-bed5-4307-ab28-0709ce95a315",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6",
    "content": "Not applicable Has no impact on training"
  },
  {
    "id": "964b492d-abd5-4322-851d-d3f3af3ba4b4",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Low Replication not important Little impact would be made on training except to add realism"
  },
  {
    "id": "f87e8177-2859-4796-98bf-987aab304267",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "Medium Replication moderately important Significant impact would be made on the training. The task contains elements which requires exact replication"
  },
  {
    "id": "2e4f8740-f890-449b-8fbb-05e8d3270a10",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "High Exact replication important Has a significant impact and is essential to training"
  },
  {
    "id": "950d64a5-741c-48df-b0e5-759a8d67b29f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "Table 10: Levels of Fidelity"
  },
  {
    "id": "5c438a1a-8ab1-4d19-9e08-27ae34c9d263",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8",
    "content": "a. Methods. These are the strategies or techniques used to achieve the required KSA. b. Media. These are the tools and means used to apply the Methods selected. 32 Which all form parts of the FTS. These are covered in Element 2 (Design, 2.2)."
  },
  {
    "id": "841f52e5-683e-4cdf-9ef3-259c11548f25",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8",
    "content": "FACTORS\tTO\tBE\tCONSIDERED\tWHEN\tDETERMINING\tTHE\tTRAINING EFFECTIVENESS OF DIFFERENT METHODS Learning factors."
  },
  {
    "id": "3adf7426-4975-426b-8b93-195dc2538bbf",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "Trainee characteristics. 12. Motivation. Learners are motivated to learn when they know the relevance of the learning, and when they are enabled to learn through a learner-centric way. For knowledge acquisition, motivation best comes through a flipped classroom, where the learners are required to access the learning (through e-learning for example) before they consolidate and reflect on what they have learnt, in the classroom. 13. Literacy level. Information should only be presented to learners in a form they can cope with. Information should not be at a level that they cannot comprehend, nor should it be at a level which will patronise. Key questions should include  What is the literacy level of the trainees?  and  What is the most appropriate language for passing information?"
  },
  {
    "id": "1e6ce8ca-2348-4402-852c-951ee667d0ff",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "14. Numbers. How many trainees should there be in each group? A large group will make trainer demonstrations difficult to plan. A small group will limit trainee discussions and peer learning. Practical constraints. 15. Facilities and resource availability are likely to limit the choice of Method and the most appropriate Media are not always practical or within budget. The medium may be unavailable; there may not be time to meet all the TOs; it may be difficult logistically or financially; or the group may be of mixed ability and unable to make the best use of the Media selected. Where resources to support the optimum training Method are not available, lack of availability is likely to affect the successful achievement of the TOs. Such constraints should be captured in the Constraints Analysis and/or the Risk Register. The TRA and Customer should be advised of this fact and made aware of the likely consequences."
  },
  {
    "id": "82e0eab4-8c18-4581-b326-9e7c312d68b4",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "Trainer attitude and ability. 16. A question that will need to be asked is: can, or will, the trainers be able to use the Media selected? Trainers are unlikely to use Media that they do not understand, which increases their workload, or which is complex to manage. If new teaching Methods are to be introduced, then due regard must be given to ensuring that trainers are both willing and able to cope. To avoid such issues designers should: a. involve trainers in the Design process as early as possible."
  },
  {
    "id": "b0dec082-49bb-4e07-a3b8-d7ad052465c4",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "b. identify any additional trainer training requirements. c. develop a trainer training strategy to enable trainers to explore new technologies followed by localised CPD activity to ensure awareness is maintained on TEL developments, including opportunities for TEL exploitation; as a minimum, trainers should be able to facilitate learning using the DLE. Training designers."
  },
  {
    "id": "b48133b9-2b62-4ca6-87b5-59f19d9a3589",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "17. Training designers should maintain awareness of emergent TEL and have a working knowledge of the DLE as a minimum. The requirement to design training to meet the needs of different types of learners, including skill fade and learner-centric approaches in an increasing resource constraint environment places the training designer at the centre of the training design process. Training Providers and 3rd Party Contractors will need to ensure their training designers are provided with sufficient training, expertise and resources in order to design training to meet the needs of Defence. The TDA should ensure the following: a. Liaison with the DLE Subcategory Manager for potential DLE inclusion. b. Creation of a DLE front page for every course iteration."
  },
  {
    "id": "e257dff3-0ea6-4d8e-8d23-ceef4377b463",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "c. For any NTS training design, key training design personnel should be invited to the TNA WG during TOA and TNR stage to plan for TEL interventions. d. Training Providers/3rd Party Contractors to develop a training designer training strategy and plan to enable training designers to intelligently utilise TEL to facilitate a blended learning approach as to optimise efficiencies. This should be followed by ongoing coaching CPD to ensure training designers maintain TEL and blended learning currency. e. Where applicable, ensure that Training Providers /3rd Party Contractors  training designers are provided with OEM Train the Trainer (TtT) training prior to RFTD for all NTS capabilities."
  },
  {
    "id": "19832e0c-ec1d-441e-96a7-3dcd2161b760",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "f. Ensure the training designers are provided with all OEM TEL training documentation (hardcopy, electronic (Word, PDF, Interactive Electronic Training Manuals/Publications (IETM/Ps), media prior to any training design. g. Develop a trainer training strategy to enable trainers to explore new technologies followed by localised CPD activity to ensure awareness is maintained on TEL developments, including opportunities for TEL exploitation. As a minimum, trainers should be able to facilitate learning using the DLE. Time availability."
  },
  {
    "id": "6bccd5e4-88be-4317-9c90-c7aaec810825",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "18. Care should be taken to avoid false economies. A lecture may seem to be an attractive option for passing large amounts of information in a relatively short time, but the information received by the trainees may be processed at only the most superficial level. This is why lectures should be front-loaded into a flipped classroom. Need for transfer of learning. 19. Apart from some types of workplace training, the training environment will differ to some extent from the work environment. It is therefore important that the training Method chosen should minimise this difference to make the transfer of KSA from the training environment to the work environment as easy as possible."
  },
  {
    "id": "e0f111d8-f79b-44ff-b9c1-26453710cae8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "Priority of learning. 20. It is unlikely that the various subjects to be trained will all be of equal importance to the trainees in their future Role. Some Skills may be used on a daily basis while others may be only used sporadically but, when they are used, are essential. This requires Performance to be maintained at a consistently high Standard. The results of the DIF Analysis (1.3.3), the consideration of skill fade factors and/or the analysis of Critical Errors (1.3.3B) may have a significant influence on the Method selection. In subjects where the possibility of skill fade could have dire consequences, consideration must be given to ensuring that appropriate Methods & Media are implemented to enhance retention. This may or may not require the allocation of extra training time. THE DIFFERENT CHARACTERISTICS OF MEDIA"
  },
  {
    "id": "0fd226db-b165-437d-a49b-12fb11165259",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "Variety of Media. 21. Consideration should be given to the characteristics of Media, in terms of whether they are essential or optional: a. Essential Media characteristics. Essential Media characteristics control the clarity of the message. For example, learning a foreign vocabulary requires print (to recognise words) and audio Media (to pronounce them). Training designers should consider:"
  },
  {
    "id": "1052b130-ef6a-48b6-9ca6-7880b9f545aa",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "(1) media that is appropriate to deliver the desired learning outcomes. (2) media that provides an appropriate level of fidelity. (3) media that can cope with trainee throughput."
  },
  {
    "id": "d81dd7a3-c17e-471c-ad1a-1d3a61528343",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "b. Optional Media characteristics. Optional Media characteristics improve the quality of the training. There are some considerations that can influence selection: (1) attractiveness to the learner: colour, animation, illustration. (2) the trainees  study habits."
  },
  {
    "id": "18e3260d-e66b-456a-b99d-5c53af1ac088",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "(3) the trainers  style, habits and Skills. (4) media that, from experience and research, improves learning efficiency. (5) media that allows the efficient management of training."
  },
  {
    "id": "d2b78a0e-fa85-43ac-85c4-5eaeb071f851",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "(6) media that has low risk of failure (for whatever reason)."
  },
  {
    "id": "c4375297-9ba7-4c32-8b0f-2d9608f4dcbf",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8",
    "content": "22. In accordance with Defence and HM Treasury guidelines, an examination of the broad order costs of various options to recommend the most cost-effective training solution must be undertaken. It is important that costing and investment appraisal are undertaken strictly in accordance with the current Defence and Service or Strategic Command policies and conventions. If training specialists become involved with costing or investment appraisal, they should obtain current advice from the TNASG or other authoritative body. CBA activity does not start at this stage of the TNA but the result of it is included in the Training Needs Report hence its inclusion here. Like many aspects of DSAT, CBA is an iterative process with initial activity commencing much earlier in the TNA process, as appropriate. The CBA will likely be further refined during the Method & Media selection process in Element 2 (Design). An estimate of the financial risks and/or opportunities associated with each training solution option should be undertaken. Training staffs are unlikely to be qualified to conduct financial risk analysis at anything other than a superficial level33. However, these analyses will be a significant factor in selecting training solution options. 33 Trainers should therefore seek specialist advice and support from Defence, or, for industry, from specialists in the field."
  },
  {
    "id": "5640cbfe-6d57-4fac-bb34-2a9cb4832b21",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8",
    "content": "23. The final activity of the TNA is to decide on training options. To evaluate the merits of the training locations and/or environments one of them should be selected as a baseline option. The selection of a baseline will depend on the context, which then permits the construction of a table to display the relative merits of each option against the baseline. Options can be assessed via several criteria: a. The extent to which the option meets the requirements. b. Through-life cost 34 , including the costs of maintenance, trainers and integration with existing training locations/environments."
  },
  {
    "id": "1b4f2c48-11e2-4e8a-b3b6-5748992e9f85",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8",
    "content": "c. Implementation time, which may prove important to meet an operational need or a RFTD. d. Trainer load, or any consideration of the availability and competence of trainers to support training. e. An assessment of the risk35 associated with the options."
  },
  {
    "id": "0cd5b5d5-1282-4e40-a6d8-b6163d205e97",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8",
    "content": "f. Flexibility, or the ease with which the new training can be integrated with existing and potential future training, as appropriate. 24. It will typically be appropriate for the options evaluation to be undertaken in consultation with SMEs before presentation to the TNASG for endorsement. Table 12 provides an example format: Option"
  },
  {
    "id": "0f4ad61a-6c30-46ad-922f-55bc1e3bfd05",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8",
    "content": "Meets the requirement Through- life Cost Implementation time"
  },
  {
    "id": "a341d4e6-5766-496b-897d-463a50051e1a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8",
    "content": "Trainer load Risk Flexibility"
  },
  {
    "id": "01984cf8-0b01-46d2-98a2-68b77714f69d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8",
    "content": "Option 1 (baseline) Option 2 Option 3"
  },
  {
    "id": "1259606e-dc8a-4f11-8338-1ae69399a773",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8",
    "content": "Table 11: Example of an Options Evaluation Table 34 It may be necessary to break down costs into greater detail to conduct evaluation. 35 This may include safety considerations or it may be appropriate to assess safety separately."
  },
  {
    "id": "087fdd32-ed85-4844-b455-ff859ff7fcf4",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8",
    "content": "- Fidelity Analysis This guidebook is intended to support staff in the MOD, and contractors working for the MOD, in the challenges faced in understanding the effectiveness of training prior to it being delivered. The aim of the Guidebook is to review the range of tools, methods and approaches that is available and recommend the most suitable approach. Part 7 of the handbook provides checklists for training fidelity and instructional features to assist the training designer."
  },
  {
    "id": "4411b7c2-8462-4865-99a7-9363bede8cd8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8",
    "content": "Link: Guidebook of Decision Support Tools for Training Design and Delivery   Part 7 Fidelity Analysis"
  },
  {
    "id": "e3031a36-e7e1-47ab-988a-c23bb9239bdc",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "a. Identification of the Performance requirement: a Role PS / Framework(s) for each Role holder, as identified in the RA. b. Identification of the training requirement: the results of the TGA. c. A Role PS and/or Framework(s) for the Role(s) affected by the recommended training solution with recommended training categories and supportive notes to amplify specific requirements to be included as appropriate to assist designers with the production of the FTS."
  },
  {
    "id": "ea4d80fd-3b58-43f1-8e86-a745ee99c3a2",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "d. Implementation plan, including where responsibilities lie (e.g. conversion training, date of new legislation and/or policy change, and design). At this stage the draft TOs endorsed by the TNASG should be available and expressed as Performance, Conditions and Standards to enable implementation by the design team. Any recommendation regarding estimation of resources, timings and assessments should be clearly referenced to aid the design team. e. Input to inform or refine the SOTR (for formal endorsement), to focus and direct the design stages. f. TNE strategy."
  },
  {
    "id": "8adf93bc-f6e2-4422-ab1a-7ebfbfb79f32",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "g. The TNASG endorsed training solution, resulting from the CBA and final selection using the Options Evaluation. Fidelity requirements and associated risks, assumptions, constraints should be included in the Report."
  },
  {
    "id": "a6409ba4-3c09-4261-b12f-3890ec903ab2",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "A - Initial KSA Analysis (KSA) Example B - Role Performance Statement (Role PS) Example C   Fidelity Analysis Example"
  },
  {
    "id": "902ff7c0-09eb-4660-9ee7-48e497cab530",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "ANNEX A TO DTSM 2 2023 EDITION, V1.0"
  },
  {
    "id": "c6b05829-2ec4-435f-b72c-a37e087c7def",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "Initial KSA Analysis (KSA) Example PDF / WORD Formats ROLE TITLE"
  },
  {
    "id": "0454cbdd-abf3-4fd8-9255-9b3122380f63",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "Motivational Outreach Team (MOT) ID NUMBER TRA"
  },
  {
    "id": "3511556e-6c20-49a8-9e3b-75a01228ee1c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "Inspectorate of Recruiting ROLE PS NUMBER 123/01"
  },
  {
    "id": "c688877e-a7af-4535-b19d-d8ac4132a62d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "TDA ISSUE STATUS V1-00"
  },
  {
    "id": "f03b6f94-51b3-4282-9bb2-22d0a7dea669",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "Performance (number) TASK Underpinning Knowledge"
  },
  {
    "id": "3db1159f-b377-4b06-81db-d01d0afd2b17",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "Skills Attitudes Attributes"
  },
  {
    "id": "c0e6b4db-81de-4f58-92a0-03f6239b0589",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Advertise and market the RAF Knowledge of the RAF trades, branches, entry procedures and entry requirements Ability to communicate effectively with members of the public; adjusting communication style depending on audience."
  },
  {
    "id": "593a2b25-6d1e-40c7-b2ad-38887e6a6cce",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "With due regard for AP1 Ethos, Core Values and Standards With positivity, enthusiasm and tact."
  },
  {
    "id": "ad4b2c34-48b1-4536-b189-1a1fa7a5715a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "ROLE TITLE ID NUMBER TRA"
  },
  {
    "id": "2884e4d6-eeae-4a63-8b3c-b9bca77d6e4f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "ROLE PS NUMBER TDA ISSUE STATUS"
  },
  {
    "id": "10ba6e28-46da-4453-855b-c377716119a9",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Performance (number) TASK Underpinning Knowledge"
  },
  {
    "id": "5753385a-2424-4edc-a439-035f75a8316c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Skills Attitudes Attributes"
  },
  {
    "id": "d1a32f3f-3bc1-43f3-9f2f-5a9a37a4af2a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Conduct immediate aircrew actions Knowledge of SE, SSLR and MSLR (as necessary), content of survival kits and winchman procedure. Ability to apply sea survival procedures to reduce risk of exposure and drowning whilst awaiting rescue from SAR helicopter or boat. If SAR helicopter, there is a need to apply suitable procedures to assist a winchman"
  },
  {
    "id": "1acd1903-a1e8-49c4-92e1-301a1772b4ff",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "With due regard to all safety and survival procedures within time constraints. Determination, confidence of own and team and ability. ANNEX B TO"
  },
  {
    "id": "17f27208-a457-4ee4-9038-7f495c083c14",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "DTSM 2 2023 EDITION, V1.0 Role Performance Statement (Role PS) Example"
  },
  {
    "id": "241246c6-96c5-4ed4-9e10-0e9fc8d8a4cd",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "PDF / WORD Formats OFFICIAL JOB NUMBER (S):"
  },
  {
    "id": "6fbeb605-ccff-44a7-a7b3-887697d6bfb8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "2008/JUL/001 ROLE TITLE(S): Weapon Technician Tradesmen For Initial Employment"
  },
  {
    "id": "ce71b2ee-c748-4bd9-ae4b-e1d5d6280397",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "DUTY NUMBER: 13.0 DUTY TITLE:"
  },
  {
    "id": "fe65dd45-e82a-4231-a12d-88dae0777d4f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Carry out Aircraft Area Based Maintenance RPS REFERENCE: 76/09"
  },
  {
    "id": "1a98d29a-c2d1-428d-92e8-9a39f61d82e2",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "TRA: Engineering Branch & Trades Sponsor ISSUE STATUS:"
  },
  {
    "id": "cd59991f-9583-4738-8f1b-4291a0f36f08",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Version 3-00 Task/ Sub Task Number"
  },
  {
    "id": "ed89367f-b9bc-47f6-9ec3-9b3484337e83",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Performance Condition Standard"
  },
  {
    "id": "6b2eabf8-6498-4ba5-83c5-ae91576ba1aa",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Training Category Notes 13.34"
  },
  {
    "id": "970efe79-5646-4756-ba1a-11a4c0cd5113",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Carry out bomb"
  },
  {
    "id": "9f371b6c-a58a-43d1-8670-b3e1dadc18ed",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "loading on In times of conflict aircraft."
  },
  {
    "id": "bdaa1e97-ffdf-4449-9ead-256a42315407",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "operations, peace enforcement operations, and transition to war"
  },
  {
    "id": "d71cd5af-c19a-49ff-bf29-088ef51fe181",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Nuclear (CBRN) environment."
  },
  {
    "id": "05cb7017-101d-4596-ad5e-52e9ff1c22ae",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6",
    "content": "Code of Practice (DCOP) and Shelters, Flight line. Guidance Material for In-Service and"
  },
  {
    "id": "22f0464c-50ee-4126-b59a-be2bb3308109",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "7",
    "content": "Operational Safety Management of references. OME (Replaced JSP 482)"
  },
  {
    "id": "b93ee903-e71b-4beb-b347-cee804039b1e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "Safety and Environmental Protection."
  },
  {
    "id": "a47c1ac4-7355-4471-a6a6-b43e4c0bffef",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8",
    "content": "aircraft Maintenance Manuals."
  },
  {
    "id": "318ad488-4226-4441-8ad8-6b3da625bbc6",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "ANNEX C TO DTSM 2 2023 EDITION, V1.0"
  },
  {
    "id": "190b8e0e-83d1-418b-89d7-a129cb87a90d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10",
    "content": "Fidelity Analysis Example PDF / WORD Formats Training Task"
  },
  {
    "id": "8a112295-5e38-4bc1-aae3-73483d18017e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Sub-task (if applicable)"
  },
  {
    "id": "b175ef9f-71ef-4d6c-b91a-d32aa8e2765a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Physical Fidelity Requirements Subcategory Fidelity Factor"
  },
  {
    "id": "deafc6ec-9942-497d-9c6b-66a1a15af208",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5",
    "content": "Justification Layout"
  },
  {
    "id": "a0a12e34-3aa1-40f1-b9d6-77e43240465f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "Controls and switches must be in the correct position in relation to the operator s position Look"
  },
  {
    "id": "63e85c93-f45b-41f5-a869-48692e80ef1a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Actual feel of controls is not required for training Feel"
  },
  {
    "id": "a9a67421-1d19-4226-a5eb-1fc3c1cbf9aa",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Appearance not important to training but spatial representation of the console is required Functional Fidelity Requirements Subcategory"
  },
  {
    "id": "58202bec-2cf9-40c9-b8ad-7767535a528f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Fidelity Factor Justification Format"
  },
  {
    "id": "1895f975-7e21-4032-b066-e179300d7962",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "Essential that data displayed is an accurate representation to provide the correct cues to the operator Content"
  },
  {
    "id": "3513111a-75de-4fdf-992d-46c9f1e63a73",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "Essential that the content of the data is accurate to ensure correct interpretation of the data Response"
  },
  {
    "id": "bdcffea8-44f3-477c-8b3c-8bd18d171832",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "Essential that response is exact to ensure correct identification of faults and interpretation of data Environmental Fidelity Requirements Subcategory"
  },
  {
    "id": "36c5932b-2f91-4cbc-bc72-1b6ba3368ff9",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "Fidelity Factor Justification Sound"
  },
  {
    "id": "18323c59-29c7-4502-ab53-ec9a70996ee7",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Typical control room sounds would enhance realism Motion 0"
  },
  {
    "id": "7b8f3c68-77d7-41ae-b8c4-8cb557196b92",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Not applicable Ambience 0"
  },
  {
    "id": "79c92eac-a617-440a-b921-74633ca9fe6c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Not applicable Geographic Areas 0"
  },
  {
    "id": "5700eb49-d81c-4af7-9c08-96f476d10917",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Not applicable Tactical/Cultural Fidelity Requirements Subcategory"
  },
  {
    "id": "f903c3ea-6145-425b-888d-d91c3b68a47e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Fidelity Factor Justification Threats"
  },
  {
    "id": "62cfb7af-dbff-4489-8541-9404d1df68e2",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "Essential that all threats be realistically portrayed Allies/Neutrals"
  },
  {
    "id": "6f1b477a-ab78-4aa6-9f18-fcbc87885a60",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "Essential that all Allies/Neutrals be realistically portrayed Conflict Character/ Location"
  },
  {
    "id": "eb965d85-d81f-49eb-98f1-21a1f9a6dacb",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Actual conflict character and location not important Team Interactions"
  },
  {
    "id": "09f10ea9-5d47-4373-a3fc-d35b739ca905",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "Interaction with team through radio communications only Factor Indicator"
  },
  {
    "id": "e68b1041-9185-4e46-ba72-b5f6d42ed110",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "Definition Impact 0"
  },
  {
    "id": "5c6b6133-b3bf-4f53-bba9-3bdaa85bedc8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "None Not applicable Has no impact on training"
  },
  {
    "id": "21cef0ad-7f80-4bd1-b63d-54bf01034f60",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Low Replication not important Little impact would be made on training except to add realism"
  },
  {
    "id": "b3f9a9c2-5569-4f18-b207-8cae419b77a5",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2",
    "content": "Medium Replication moderately important Significant impact would be made on the training. The task contains elements which requires exact replication"
  },
  {
    "id": "ffcc8a8b-36ea-4527-a18e-b308808dec7d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3",
    "content": "High Exact replication important Has a significant impact and is essential to training"
  },
  {
    "id": "e33afcb3-0351-4ca6-b9ea-08003a1b52bc",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "This DTSM supersedes all previous DTSMs on Analysis of Individual Training The totality of DTSMs included in the DTSMs Suite, of which this document is a part, are listed on the DTSMs SharePoint site"
  },
  {
    "id": "5df73666-d857-4bff-b38c-145aacb2c2c3",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "Filename: Analysis of Individual Training Document ID:"
  },
  {
    "id": "f44a56f0-a2fd-49a0-8d38-b57dce88e6f9",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "DTSM 2 Owning Function / Team: Talent, Skills, Learning and Development (TSLD)"
  },
  {
    "id": "60361808-6655-480d-a98f-4f8793e98c56",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "Service Owner (1*): People-TSLD-Hd OF6"
  },
  {
    "id": "9b931cfa-e653-403f-9028-154e38a9280e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "Edition Edition Version Publication Date"
  },
  {
    "id": "a2fb7eea-7a8c-4923-97d6-e7551237e657",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11",
    "content": "Revision History Revised Pages 2023"
  },
  {
    "id": "76300115-3636-4265-88d0-687e8c95ca37",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "17/10/2023 First Edition N/A"
  },
  {
    "id": "f21433a2-dedb-4b88-adf2-0b223452e682",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1",
    "content": "Annual editions of this DTSM will be published every December in time for upcoming year relevant to the DTSM. Throughout the year, different versions of the current edition may also be published. When every new edition is published, the versions will reset to 1."
  }
]