[
  {
    "id": "1f0c4c95-f4e6-4e92-8de4-7616b12715f0",
    "document": "JSP 912 Human Factors Integration in Defence Systems (Part 1 Directive).docx",
    "section": "Uncategorised",
    "content": "JSP 912 provides the policy for Human Factors Integration (HFI) within Defence acquisition and capability management. It outlines the principles, governance, and requirements necessary to effectively integrate human-related considerations into the lifecycle of defence systems, ensuring systems are safe, usable, and fit for purpose."
  },
  {
    "id": "c5e64028-2941-4df6-9822-5f0203d12e17",
    "document": "JSP 912 Human Factors Integration in Defence Systems (Part 2 Guidance).docx",
    "section": "Uncategorised",
    "content": "Part 2 of JSP 912 provides guidance on applying HFI principles in practice. It supports project teams by outlining methods and techniques for implementing HFI during system development. It also provides checklists, role descriptions, and case studies to demonstrate successful HFI integration."
  },
  {
    "id": "f2680732-82c5-4f82-b5ee-26ebd97ccacd",
    "document": "JSP 939 Defence Policy for Modelling & Simulation (M&S) Part 1.docx",
    "section": "Uncategorised",
    "content": "JSP 939 Part 1 establishes Defence policy on the use of Modelling and Simulation (M&S). It sets out strategic objectives, governance structures, and core principles to ensure effective, consistent and interoperable application of M&S across Defence capabilities."
  },
  {
    "id": "e458bc1a-94d6-4ea8-8ab2-260e5c89a5d2",
    "document": "JSP 939 Defence Policy for Modelling & Simulation (M&S) Part 2.docx",
    "section": "Uncategorised",
    "content": "Part 2 of JSP 939 supports the implementation of M&S policy. It provides detailed procedures, roles and responsibilities for M&S management and delivery, including lifecycle considerations, assurance processes, and standards."
  },
  {
    "id": "1f2e0ddf-f9fc-4c95-b2ea-3c5bc7d05a7e",
    "document": "Maritime Acquisition Training Guide (MATG) Part 1 Project Team Guidance V2.0.docx",
    "section": "Uncategorised",
    "content": "The MATG Part 1 offers guidance to Maritime Project Teams on how to ensure training considerations are addressed throughout the acquisition process. It introduces the Defence Systems Approach to Training (DSAT) and outlines team responsibilities, key documents, and timelines."
  },
  {
    "id": "d8be799c-5cb5-4d7a-b5f2-e015974dc56c",
    "document": "Maritime Acquisition Training Guide (MATG) Part 2 Training Analysis Standards V2.0.docx",
    "section": "Uncategorised",
    "content": "MATG Part 2 details the standards and methodology for Training Needs Analysis (TNA) within the maritime acquisition context. It complements DSAT guidance by providing practical steps, data collection techniques, and quality assurance expectations."
  },
  {
    "id": "6f3de5ec-99bb-497b-8e83-1ea982e45703",
    "document": "New Taxonomy of Educational Objectives.docx",
    "section": "Uncategorised",
    "content": "This document introduces a revised taxonomy for educational objectives to enhance instructional design and learner assessment. It builds on Bloom's taxonomy by incorporating modern cognitive science insights and aligning learning levels with measurable outcomes."
  },
  {
    "id": "d6c6f888-57b7-4e46-81a2-b4d1b030aa45",
    "document": "Personalisation of Learning Final Technical Report.docx",
    "section": "Uncategorised",
    "content": "This report summarises findings from research on personalised learning systems within Defence training environments. It explores adaptive content delivery, learner profiling, and the integration of data-driven feedback mechanisms."
  },
  {
    "id": "c00e9bb0-1f96-4d08-bd62-749fe8f74d67",
    "document": "Team and Collective Training Needs Analysis (Human Factors in Defence).docx",
    "section": "Uncategorised",
    "content": "This guide supports analysts conducting collective TNAs with a focus on Human Factors. It covers group dynamics, team roles, and cognitive requirements, aligning findings with training design and delivery."
  },
  {
    "id": "ef192c24-fc4f-405a-b1f5-0a6eaa57e7ef",
    "document": "The Defence Modelling Simulation MSOffice DMSO Blueprint.docx",
    "section": "Uncategorised",
    "content": "This blueprint outlines strategic plans for integrating Microsoft Office tools into Defence Modelling and Simulation workflows. It includes standard templates, automation options, and interoperability frameworks."
  },
  {
    "id": "92649735-b800-4ab6-b9d5-6452d6f8b0ef",
    "document": "HS 1.004 Skill Fade Competence Retention Analysis Handbook 2022 V3.0",
    "section": "Section 1 Introduction",
    "content": "This handbook provides guidance on analysing skill fade and retention of competence within Defence training. The aim is to help ensure training solutions are designed to maintain competence over time."
  },
  {
    "id": "caec4a6c-10f5-43c0-8262-f35ad86f84b6",
    "document": "HS 1.004 Skill Fade Competence Retention Analysis Handbook 2022 V3.0",
    "section": "Section 2 Principles of Skill Fade",
    "content": "Skill fade is the decay in performance over time when knowledge, skills or attitudes (KSAs) are not practiced. This section explores theoretical foundations and evidence-based factors contributing to skill fade."
  },
  {
    "id": "2eab6fd9-cd0a-4566-818d-73f2f92e6103",
    "document": "Maritime Acquisition Training Guide (MATG) Part 1 Project Team",
    "section": "Section 1 Overview",
    "content": "MATG Part 1 provides a structured guide for project teams acquiring maritime capabilities. It focuses on integrating training needs into acquisition planning from the outset."
  },
  {
    "id": "c3e10c49-dae0-41fc-a5d5-bd2470cf63a3",
    "document": "Maritime Acquisition Training Guide (MATG) Part 2 Training Analysis",
    "section": "Section 2 Training Analysis Process",
    "content": "MATG Part 2 outlines the process for conducting training analysis as part of the acquisition lifecycle, ensuring that training is considered as a fundamental component of capability integration."
  },
  {
    "id": "57a10df3-56a1-47f3-b388-fc1bd4f7f160",
    "document": "JSP 912 Human Factors Integration in Defence Systems (Part 1)",
    "section": "Section 1 Human Factors Overview",
    "content": "JSP 912 describes how Human Factors (HF) considerations must be embedded throughout the systems engineering lifecycle to enhance safety, performance and user experience."
  },
  {
    "id": "a4b4c307-f3b1-44ac-bcc1-44d0b6a41856",
    "document": "JSP 912 Human Factors Integration in Defence Systems (Part 1)",
    "section": "Section 3 HFI in Training",
    "content": "This section discusses how HF principles influence the design and delivery of training. Topics include ergonomics, cognitive load, and user-centred instructional design."
  }
]
