[
  {
    "id": "26ed538a-7249-4e9f-a8d6-5e4c99305029",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 Edition",
    "content": "Version: 1.0 Contents"
  },
  {
    "id": "362bcea0-ea8d-4b3f-8876-9996836ddaca",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10 Annexes\t56",
    "content": "A - Initial KSA Analysis (KSA) Example 56 B - Role Performance Statement (Role PS) Example 56 C Fidelity Analysis Example 56"
  },
  {
    "id": "20a9dcab-b749-4cfb-8222-6c5f8f8bc5f7",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1 How to use this Manual",
    "content": "Defence Training Support Manuals (DTSM) have been developed to support the understanding and implementation of the policy contained in JSP 822. JSP 822 is the authoritative policy that directs and guides Defence people to ensure that Defence Learning (training and education) is appropriate, efficient, effective and, most importantly, safe. DTSMs will be published every December, following the publication of the latest version of JSP 822. Throughout the year, different versions of the latest DTSM edition may also be published. When every new edition is published, the versions will reset to 1."
  },
  {
    "id": "156c21cb-6930-45f5-8edb-56ccc44d6769",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1 How to use this Manual",
    "content": "Using the DTSMs is entirely optional, and users may find there are alternative resources available to help them understand and implement the policy contained in JSP 822. Throughout this document there are references to other DTSMs, these references contains hyperlinks that will take you to the DTSMs that are held on the Defence Training Support Manuals SharePoint site. The DTSMs currently available are:"
  },
  {
    "id": "ab95b2f3-b1fc-4bd2-92bf-e23800ba4727",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1 How to use this Manual",
    "content": "DTSM Number DTSM"
  },
  {
    "id": "53708f69-7d8d-42b5-a20d-e32bf8c5642b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1 How to use this Manual",
    "content": "Name SharePoint Link DTSM 1"
  },
  {
    "id": "22303a46-e598-4bb4-93ae-442d2c72fc6f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1 How to use this Manual",
    "content": "Governance of Individual Training Link DTSM 2"
  },
  {
    "id": "35505712-f947-49bd-8098-3aa2f16b6d1e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1 How to use this Manual",
    "content": "Analysis of Individual Training Requirements Link DTSM 3"
  },
  {
    "id": "04d1aac2-f95d-4060-b1b4-46aecf60a349",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1 How to use this Manual",
    "content": "Designing Individual Training Link DTSM 4"
  },
  {
    "id": "aff2af36-26b3-4f2b-bce9-4c301a87a010",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1 How to use this Manual",
    "content": "Delivery of Individual Training Link DTSM 5"
  },
  {
    "id": "af2569ea-340a-4a04-ae71-984b5157298a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1 How to use this Manual",
    "content": "Evaluation of Individual Training Link"
  },
  {
    "id": "25392562-a3c8-4075-8d2f-c098d3f90559",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2.1 Training Needs Analysis",
    "content": "1. This Section of the Guidance outlines the Defence approach that allows training specialists to adopt a structured, methodical approach to the analysis of the training need, or requirement. It sets out the various activities, collectively termed the TNA, which may be used in order to conduct a TNA, which informs subsequent Elements and forms part of the overall Training System."
  },
  {
    "id": "3cf67070-426c-40e3-a428-53a34a945f9c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2.1.1 Overview of the TNA",
    "content": "1. A TNA is a structured analysis of training need arising as a result of new equipment acquisition, doctrinal change, organisational change, or changes to policy/legislation. It generally includes an analysis of different training Methods and technologies, with a view to recommending the optimum training solution which balances cost and quality. It is a highly flexible procedure with the choice of supporting tools and techniques to suit different Training Systems. In all cases, however, a TNA is an output based, iterative process that provides an audit trail for all decisions and is closely mapped to the requirements of the QMS. A TNA does not, and should not, imply that training will be the only solution. If training is not the solution, this will become apparent in the Scoping Exercise, after which, analysis activity will cease. 1. The TNA provides an audit trail of analysis to determine the need for training and, if required, enable design of a training solution. The process described below is a 3-stage process with a number of specified outputs. However, it should be emphasised that this recommended approach is not necessarily linear nor does it have to be followed prescriptively. In many cases there may not be a requirement to produce all of the suggested output products, and there may be merit in conducting stages or activities concurrently."
  },
  {
    "id": "3b9a7bb9-fa2d-40d6-bacf-5e18941fef26",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2.1.1 Overview of the TNA",
    "content": "2. The principal activities of the TNA process, grouped together into the 3 Stages, are: a. TNA, Stage 1. (1) Scoping Exercise Report. This identifies the management of the TNA, programming and resourcing issues, policies, constraints, risks and assumptions. The key output is the Scoping Exercise Report (which recommends possible training solutions). It also identifies if training is not the solution and no further analysis is required."
  },
  {
    "id": "4521c922-c33c-4bee-96b0-78b7e1ebd073",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2.1.1 Overview of the TNA",
    "content": "b. TNA, Stage 2. (1) Role Analysis (RA). This identifies the Role(s) that need to be trained for, the supporting duties, tasks, sub-tasks and task-elements, then analyses these to generate Performances, Conditions and Standards. The key outputs are the Role PS and/or Framework(s)1. (2) Training Gap Analysis (TGA). This states the training gaps in terms of KSA. The key outputs are the Statements of Training Gaps."
  },
  {
    "id": "e8d4c3fc-771b-4bc5-ae8a-e399ab78fecc",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2.1.1 Overview of the TNA",
    "content": "(3) Initial Training Objectives (TOs). This is an initial draft of the TOs, based upon the Role PS and/or Framework(s), which are the key outputs. It may be that the initial TOs created at this stage are sufficient and do not need further refinement but they are certainly not endorsed at this stage. (4) Training Options Analysis (TOA). The TOA considers each relevant Task in the Role PS / Competence Framework to assess the extent to which the training environment should replicate the workplace (real) environment to enable training to be effective. This is known as the Fidelity Analysis. The implications of locations and environment for training and Methods & Media options are then considered. The key outputs are the realistic options for Methods & Media and refinement (based upon fidelity, locations and environment) of the possible training solutions. Cost-effective options which take account of Whole Life training requirements (including refresher training) are considered. (5) Training Needs Report (TNR). The Training Needs Report analyses the cost benefits and then evaluates the merits of the training options, before confirming the TNASG endorsed training solution. The report includes the Role PS and/or Framework(s). The key output is a recommendation as to the most cost-effective training solution, which inputs into the SOTR. An implementation plan is also included."
  },
  {
    "id": "a5cc4550-6553-4561-89eb-4b1938ca0b5b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1 E.g. Competency or Competence Frameworks.",
    "content": "c. TNA, Stage 3 (conducted at DSAT, Element 4). (1) Training Needs Evaluation (TNE). This assesses and reports on the effectiveness of the TNA process as well as the ability of the implemented training solution to meet the Defence requirement. The TNE is conducted in 2 parts: evaluation of the process, and evaluation of the training solution. The key output is an assessment of how well the TNA outputs contributed to the provision of a training solution that meets the Defence requirement. This completes the TNA process. TNE is covered in DTSM 5. 3. Why or when should a TNA be conducted? Before a TNA can begin, a clear evidence-based Statement of Requirement (SoR) is to be produced, preferably in a written format (letter, e-mail, request form or tasking order, for example). Then, prior to the commencement of the analysis, a scoping exercise is conducted which may identify that the most cost-effective means of achieving the required Defence need, is a training solution2. Once the requirement for training has been established, a TNA should be undertaken to ascertain the type and scope of the training requirement that meets the Defence need. It should be noted that a TNA may range from a simple interview to a process lasting several months. See DTSM 1 for more information on a SoR."
  },
  {
    "id": "e101b7b4-fa4a-43f0-b33d-f50d1b652be7",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "1 E.g. Competency or Competence Frameworks.",
    "content": "4. Responsibility. It is expected that the Training Requirements Authority (TRA) will take the lead on the production of the DSAT activities, processes and outputs required to be completed during Element 1. The TRA may wish to delegate specific tasks, but will retain overall responsibility for them. The TRA will also be expected to ensure that those activities deemed critical to the development of the Training System are conducted. A key activity is the establishment of a TNA Steering Group (TNASG), upon receipt of a SOR, or other authority, to begin the TNA process. The TRA is ultimately responsible to the Customer for the work conducted during this Element. See DTSM 1 for more information on a TRA."
  },
  {
    "id": "43830842-d1ef-4ee2-baba-fff7bd0d4d6f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2.1.2 Considerations with a TNA",
    "content": "5. Training activities should meet Defence outputs; and, should these change, the training need should be re-analysed, via a TNA, and if necessary, adapted to support the new requirement(s). If a TNA is to be conducted, the user should consider: a. the requirement being raised and the need to carry out a TNA. b. forming a TNA Steering Group (TNASG)3."
  },
  {
    "id": "71b1fcb0-5e62-46e1-98de-986f5dfd6d01",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2.1.2 Considerations with a TNA",
    "content": "c. assurance of the TNA process. 6. There may be different reasons for undertaking a TNA: a. In support of a new fielded force or training equipment or service."
  },
  {
    "id": "ee50ef07-a58e-4a08-ab08-b49af189082f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2.1.2 Considerations with a TNA",
    "content": "b. In support of an enhancement to any equipment or support system already in service. c. A change in policy/legislation."
  },
  {
    "id": "8684a4ad-6afb-4342-97c2-412f7ab28a97",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3 Across Defence this SG may be known by alternative names.",
    "content": "d. A change to the doctrine underpinning the deployment of a capability. e. Changes to organisational structure, or changed competence requirements. 7. As a general rule, a TNA should be used when a change in Defence capability is likely to have a significant impact on the training resources required to generate trained output. The TNA should be fit for purpose, provide an auditable trail and determine the most cost- effective training solution. The TNA may vary in complexity from a simple scoping exercise to an extensive process requiring a dedicated team of Needs Analysts."
  },
  {
    "id": "f0313d8f-89b3-4f6b-879e-c223b11ee216",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3 Across Defence this SG may be known by alternative names.",
    "content": "8. Non-training specialist involvement in a TNA. Stakeholders often have a limited knowledge of the MTS and are unfamiliar with the TNA process. At the start of a TNA, time is often well spent in educating those who are to be involved in the TNA about the process. They should be aware of their responsibilities, including the provision of information and staffing routines. Whilst it is not usually the TNA author s responsibility to the implement the training solution, post TNA, it is possible that they may be involved in subsequent working groups, to provide training support advice. 9. Exploiting existing training activities. The need to design training from scratch on a blank sheet of paper is a very unusual occurrence, as it is much more likely that existing training can be modified. It follows, therefore that it is often desirable to analyse the current training first. Where current role information, Role PS / Framework(s) or TOs do not exist for any current training, more comprehensive RA may be required, before any determination of a training requirement can be made. Analysis of similar, existing, training is also useful to support this. 10. Audit trail. A TNA should generate a clear audit trail which plots the sequence of events and decisions leading to a training solution. The justification and supporting evidence used as the basis for these decisions should be readily apparent (such as: references to, and/or copies of, academic research literature; the deliberations of the Analysts; minutes of TNASG meetings and Defence/Contractor publications). A quality audit trail requires full disclosure of, and rationale for, the methodology, tools and data sources used in the analysis, with copies of any specialist or bespoke software made available to the TNASG."
  },
  {
    "id": "3955ad00-0cbc-49bf-9d91-58d00af73309",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3 Across Defence this SG may be known by alternative names.",
    "content": "11. Iterative/selective nature of TNAs. Whilst a TNA is carried out by completing a number of activities in sequence, it is important to note that the process is iterative in nature. Many influencing factors, risks and assumptions are liable to change during the conduct of a TNA. It is therefore important that at every stage of a TNA, the key outputs are reviewed to ensure their continuing validity, and that stages of the process be repeated if necessary. Processes for reviewing the TNA outputs should be capable of amendment where changes are required. Tight control should be exercised by the TNASG, which approves all changes to the TNA. Follow-on changes to the training requirement and the impact on training may be managed through a system of configuration control but this does not remove the responsibility of the TNASG for ensuring that changes are reflected in the TNA. 12. It should be noted that the cheapest option is not necessarily the most cost-effective option in meeting the training requirement. Also, the cheapest option is not necessarily to continue existing training within existing resources. Therefore, effectiveness is the key as it is the extent to which the training has prepared the individual for the Defence effect which matters. Cost is efficiency focused to optimise the use of resources to enable the execution of training (and required learning) and ensure Value for Money (VfM)."
  },
  {
    "id": "b1c83f9a-a590-4b08-bf30-052c66b550ea",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3.1 Introduction",
    "content": "1. The name TNA Steering Group (TNASG) is commonly used for this this governance group; however, it may be known by alternative names example: Training Steering Group (TSG). Although TNA SG is used within JSP 822 and the DTSMs, personnel should consult local policy documents to see if a preferred, alternative name is in use. 2. For most training, the Chair of the TNA SG will normally be filled by the TRA, however, under certain scenarios e.g. Short Term Training Requirements, the role of Chair may need to be filled by an alternative individual e.g. Member of a Project Team. 3. TNASG membership may include:"
  },
  {
    "id": "921892ff-6328-49e3-be31-e93503c306f7",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3.1 Introduction",
    "content": "a. Training Requirements Authority (TRA). The complexity and size of the training requirement will dictate the level of involvement of the TRA and whether responsibilities are delegated. Training policy and training support representatives from the TRA should direct the TNA Scoping Exercise and the TRA will normally nominate the chair of the TNASG. See DTSM 1 for more information on the role the TRA. b. Defence Equipment & Support (DE&S). Where the training need is derived from new equipment or a service being brought into service by DE&S, representation from the Project Teams, or equivalent, is key to ensuring that the training requirement meets the technical needs of the new capability."
  },
  {
    "id": "1f116c0b-5e22-4279-b965-e8389b7b55b3",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3.1 Introduction",
    "content": "c. Training Delivery Authority (TDA). The TDA will need to be represented at the TNASG as it is responsible for the design stages of the DSAT process and will likely be closely tied to the Training Provider. See DTSM 1 for more information on the role of the TDA. d. Training Provider. It is not vital for the Training Provider to be represented at the early stages of TNA, unless a specific Training Provider is obvious from the outset. In that case, it is sensible to include the Training Provider in the TNASG."
  },
  {
    "id": "10cfbe24-cc4c-4d77-a49d-1c411468b5e1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3.1 Introduction",
    "content": "See DTSM 1 for more information on the role of the Training Provider. e. Formation Command. The Formation Command4 is the final user of the new capability. The Formation Command therefore should be represented as it will be integral to achieving the balance of training between that delivered by the Training Provider and the remainder by the Formation Command in the workplace. f. Workforce Authority. The identification of appointments/posts/billets affected by a new Defence capability, as well as training throughput to resource it, are key aspects of the scoping exercise and RA. The involvement of the relevant Workforce Authority is therefore critical to the validity of the TNA and important in ensuring that the issues that overlap between personnel/workforce and training are fully integrated and understood by all parties from the outset."
  },
  {
    "id": "b85de6e9-f43a-4ba2-9665-11f2723afd5b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3.1 Introduction",
    "content": "g. Training SME. If necessary, a training management SME should be represented in order to advise the chair on TNA management and methodology, ensure that the TNASG is representative of all stakeholders, compliant with the DSAT process, and that an audit trail exists. h. Other members. Membership can be extended as needed to include any other interested parties. For example, it may be prudent to include representation from Diversity and Inclusion (D&I), legal or security staffs. 4. Role of the TNASG. The TNASG is responsible for ensuring that the training requirements are identified and met. It should therefore perform the following tasks, which should form the basis for its ToRs:"
  },
  {
    "id": "85bdbaa1-bee3-4d76-ab15-a97f4234afe1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3.1 Introduction",
    "content": "a. develop and maintain a TSP. b. quality assure all TNA activities, particularly the (Stage 1) Scoping Exercise. c. brief potential Contractors and act as a point of contact for any requests for information or subject matter expertise."
  },
  {
    "id": "b7f37f1a-07d3-43a4-9d85-cbaf44ad60a1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3.1 Introduction",
    "content": "d. co-ordinate the activities of all contributors to the TNA. e. review and co-ordinate amendments to TNA outputs. f. endorse proposals affecting the TNA process or that amend outputs."
  },
  {
    "id": "4b7322dd-3ed8-48cc-86c3-38606048abc3",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3.1 Introduction",
    "content": "g. endorse the most cost-effective training solution recommendation. h. assist in the design and delivery of the chosen training solution. 5. Subjectivity. TNA governance is often complicated as individuals who act as stakeholders often double as the steering/working group representatives and are therefore closely involved in the development of the TNA. In other words there is potential for an element of subjectivity in the final decisions made. The TRA may have already decided on a training solution and wants the TNA to justify it. SMEs may have pre-conceptions regarding the operation/use of different Methods & Media (SMEs may not be training professionals and may not be fully aware of the options available); so the user should be aware of the potential to influence their decisions or statements. It is therefore much more"
  },
  {
    "id": "4ea0af8e-2bec-4c5a-bff6-525fb470f51f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4 Such as, for example: a Warship, a Brigade, or an Air Wing.",
    "content": "effective for a TNA to explore all possible options and identify the most suitable and cost- effective solution."
  },
  {
    "id": "7d68f823-b32d-4bcb-b4a5-0c6e5db6ab1d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "3.2 Training Support Plan",
    "content": "6. The TNASG should manage the TNA via the production and maintenance of a TSP. The TSP should identify any constraints on the TNA in terms of training policy or funding, ensuring that all the actions required to produce cost-effective training support are identified and the appropriate agencies tasked. The TSP should also specify when the TNA activities are to be conducted, who is responsible for the management and conduct of the TNA process and when and how the outputs are to be assured. Figure 2 illustrates the TSP in the wider TNA context. The TSP, governed by the TNASG should identify the milestones sufficient to meet the RFTD5. A RFTD should be considered at this stage, agreed and stated later as a hard stop point, as part of the Training Authority Document (TrAD), which is produced at the end of Element 2 (Design). Figure 1: Training Support Plan (TSP) in the TNA Context"
  },
  {
    "id": "eaf93108-6d21-48e4-a6c7-8e9207dd7251",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4.1 Introduction",
    "content": "1. The scoping exercise involves the initial analysis of the requirement and, where applicable, suggested options for meeting the requirement including a broad order estimate of the resource implications associated with each option. This is articulated in the Scoping Exercise Report. The scoping exercise should be completed as early as possible and starts by acquiring as much relevant information as possible about the training need and the Customer requirement. It defines the TNA management, risk, programming and resourcing within the boundaries of policy, assumptions and constraints. It also highlights issues that impact upon, or will need to be considered, during Stage 2. It will advise the TNA strategy for the proposed training solution and provide the parameters of the new or changed Defence requirement where TNAs will be, or have been, carried out. The scoping exercise does not have to be a long and protracted document and can utilise electronic references such as minutes of meetings, records of conversations to provide an auditable trail. 2. Provided that a training need is confirmed then a search of existing training activities across Defence, including the DLE, is to be conducted to ascertain if training, already designed, could satisfy, or partly satisfy, the need. The scoping exercise should then outline the aim, constraint, assumptions, proposed methodology and timescales, and provide an estimate of the resources required for the subsequent analysis and design stages. 3. The scoping exercise is the initial investigation and should derive a strategy and tentative solution for meeting the need for a training intervention. As this investigation progresses, decisions about how to apply the DSAT process should be made. For example, is it necessary to complete a full Role Analysis (RA) from first principles, or is it sufficient to confirm that an existing Role PS / Framework is still valid? Likewise, the strategy may recommend the process focuses on certain elements of a Role/task Performance which need further development or perhaps recommends targeting the TOs to ensure they support a Role PS and/or Framework. It may be decided that the sequence of training be reviewed if this is highlighted as a potential problem or that further consideration is given to current refresher training intervals. The scoping exercise should also cover a list of the resources required to complete the subsequent activities and an agreement as to which organisation(s) will provide them."
  },
  {
    "id": "83d4a646-7a5b-401a-acdb-1eba15c6b7c6",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4.3 TNA Terms of References",
    "content": "4. It is important that clear TNA ToRs are produced to guide the subsequent analysis stages. They should be agreed and clearly understood by the TRA, stakeholders and the personnel undertaking the DSAT activities. A considerable amount of resources may be required to carry out these analyses and these should be made explicit within the ToRs. Although the layout of ToRs may be adjusted to meet specific circumstances there are a number of key areas that should be considered: a. the scope and size of the TNA. b. constraints, risks and assumptions."
  },
  {
    "id": "8d162c1a-8c39-40f9-85a1-405f55d17195",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4.3 TNA Terms of References",
    "content": "c. outputs and reporting procedures. d. timescales and resources available. e. the methodology to be adopted."
  },
  {
    "id": "5ca235fa-a0ce-40f3-b6af-00ff94e7cb16",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4.3 TNA Plan",
    "content": "5. In order to estimate the timescales for the TNA it may be necessary to generate a plan, for inclusion with the ToRs. A plan should detail the milestone dates for each activity to enable reviews by the relevant stakeholders. The TNASG is responsible for ensuring that these activities take place. It need not be detailed but as a minimum it should include what is to be done, by whom and when."
  },
  {
    "id": "44c308c6-e1b6-4f5f-9c63-6c9888418523",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4.4 Training Audience (and Throughput) Description",
    "content": "6. An estimate of who will be affected by the new or changed Defence requirement is required to ensure that it is representative and to determine throughput and input standards. It should include an estimate of the population to be trained in terms of their personal characteristics, the annual throughput and the input standard6. This information can then be used to inform and refine the SOTR (5.5). 7. Identification of personal characteristics. In the course of analysing a particular role, it is often the case that to carry out the role effectively, an individual should possess certain characteristics. If this is so, then it is important to determine an appropriate balance between selection and training in order to provide people who have these characteristics and who are, therefore, capable of doing the role. The training audience is the group of learners for whom the training requirement is intended. The purpose of this description is to identify the: a. training audience groupings, the number and type of groups that need to be addressed (e.g. operator, maintainer, manager, train-the-trainer; individual, team, unit etc)."
  },
  {
    "id": "78dee3c1-d793-430d-8f9a-d8e25522dbb6",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4.4 Training Audience (and Throughput) Description",
    "content": "b. social and demographic characteristics of each of the training audience groups. c. subject matter competence (in terms of KSA) of each of the group on entering training. This could include identifying any key entry standards. d. size and annual training throughput requirements of each of the training audience groups."
  },
  {
    "id": "691355bc-f200-4576-807c-ca10e2ecb325",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4.4 Training Audience (and Throughput) Description",
    "content": "8. Training audience. Analysts should consider potential members of the training audience from across the training continuum, from individual through team to collective. This is critical to assist in determining cost-effective training options. a. Individual. Users should identify all individuals who require training, and possibly at what stages in the training continuum they will be required to be trained. If possible, analysts should also identify the relevant individual career training pipelines and identify the optimal stage for any new training to be delivered. Users should identify the appropriate rank and branch/specialisation of all individuals requiring training; and consider individuals who could require training from across all Defence Lines of Development (DLoDs), and not limit thinking to a single area. b. Team and sub-team. Seldom will individuals operate alone; they will almost always constitute part of a team. Users should therefore identify the teams and sub- teams that will require training. A team is a sub-division of an individual unit s"
  },
  {
    "id": "a1286004-f98b-4916-813f-60883026d099",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6 The Defence Human Factors Integration Policy for Defence Systems (JSP 912) also requires the development of a Target Audience Description so there is the potential for re-use of information here.",
    "content": "personnel, (e.g. a ship would comprise teams operating on the bridge, in the operations room, in the ship control centre etc). Teams can sometimes then be sub- divided further into sub-teams. Users should identify the individuals who will constitute the teams/sub-teams so that the capacity and size of any potential team training solution can be determined. 9. Social and demographic characteristics. Social and demographic characteristics of the training audience provide an early training analysis that assists in determining appropriate and cost-effective training solutions. The type and scope of information required for each training audience should be determined by the complexity of the performance requirement and the size and complexity of the training audience. This list, whilst not exhaustive, should serve as a guide as to what to consider: a. Physique, health and appearance. Such as particular requirements for eyesight, hearing, manual dexterity height, weight, fitness standards, build and appearance."
  },
  {
    "id": "07127961-f8d8-43df-a7de-0a402ea6a98a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6 The Defence Human Factors Integration Policy for Defence Systems (JSP 912) also requires the development of a Target Audience Description so there is the potential for re-use of information here.",
    "content": "b. Cognitive ability. It may be important to indicate either the general cognitive ability required, or minimum scores required on specific tests. c. Special aptitudes. Such as special aptitudes for mechanical ability, manual dexterity, skill with words, skill with figures, artistic ability, musical ability. d. Digital literacy. Information and Communication Technology abilities and wider digital literacy characteristics should be considered and not assumed. This analysis should include the abilities of the trainees, trainers and course designers."
  },
  {
    "id": "da0f8a8b-1041-4045-8647-07cc85d5d0eb",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6 The Defence Human Factors Integration Policy for Defence Systems (JSP 912) also requires the development of a Target Audience Description so there is the potential for re-use of information here.",
    "content": "e. Interests. A personal particular interest in a career-type, e.g. nursing or policing require people who have a desire to do this sort of work if they are to be successful at it. f. Disposition. Some roles require people with initiative while others require someone who can tolerate routine and repetitive work. g. Learning styles. Such as reading ability, attitudes towards potential training delivery systems, impact of Specific Learning Differences (SpLD), ICT etc."
  },
  {
    "id": "5e19f349-2e98-42a4-bb74-7ebd6ee3fa91",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6 The Defence Human Factors Integration Policy for Defence Systems (JSP 912) also requires the development of a Target Audience Description so there is the potential for re-use of information here.",
    "content": "h. Motivation. Such as willingness or motivation to attend training or career implications and career cycles as they relate to the training. i. Personal data. Such as age, sex, rank, length of Service, ethnicity, cultural characteristics/biases etc. j. Geographic location / organisational distribution. These factors may result in certain constraints/considerations."
  },
  {
    "id": "57f1be70-9209-4035-9633-5198307b0764",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6 The Defence Human Factors Integration Policy for Defence Systems (JSP 912) also requires the development of a Target Audience Description so there is the potential for re-use of information here.",
    "content": "10. Subject matter competence. Information needs to be collected on (or assumptions made about) the role-related competences (KSAs) in which the training audience is already proficient. The training audience s level of KSA with respect to the Performance requirements is a factor, which depends mainly on previous related training, experience and recruitment profiles. Information should be obtained on: a. experience with the training performance (and how it was obtained). b. ability to perform any part of the requirement."
  },
  {
    "id": "679cbe21-d635-46d9-91ca-722bc410f8a5",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6 The Defence Human Factors Integration Policy for Defence Systems (JSP 912) also requires the development of a Target Audience Description so there is the potential for re-use of information here.",
    "content": "c. knowledge of the subject matter (and how it was acquired). d. positive or negative perceptions of the subject matter. e. perception of the impact of mastering the Performance requirements on self, work, career."
  },
  {
    "id": "eafce296-b014-4137-b76f-e3dc00112eec",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6 The Defence Human Factors Integration Policy for Defence Systems (JSP 912) also requires the development of a Target Audience Description so there is the potential for re-use of information here.",
    "content": "11. Existing competences. When identifying the training audience, analysts should also establish whether individuals will be required to have any existing competences or experience levels prior to exploiting the new capability (pre-requisite analysis). Some of these competences may also be required by trainer/training support staff to enable them to assess performance and develop training activities. Example criteria include: a. establishing whether or not an individual s existing competences are sufficient for them to safely operate or maintain the new capability. b. identifying what level of rank is required to exploit the capability."
  },
  {
    "id": "bfaacb56-bd12-4fbb-aa89-f7ba9c0335f0",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6 The Defence Human Factors Integration Policy for Defence Systems (JSP 912) also requires the development of a Target Audience Description so there is the potential for re-use of information here.",
    "content": "c. establishing the minimum level of experience required (such as, number of flying hours, previous command experience, specific operational experience etc). d. establishing the minimum qualification required (such as, charge qualified, command qualified, category A nuclear watch keeper etc). 12. Pre-requisites analysis. Pre-requisites analysis can be used to inform the training solution recommendations and is an important measure of competence/entry standard prior to training. This enables more accurate measures of competence before and after training to be taken, thereby facilitating measures of effectiveness of the training solution in delivering the required output standards."
  },
  {
    "id": "425df8c7-67a7-400b-bf00-11cc8460155d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6 The Defence Human Factors Integration Policy for Defence Systems (JSP 912) also requires the development of a Target Audience Description so there is the potential for re-use of information here.",
    "content": "13. Training throughput. An estimate of training throughput numbers (total audience and annual throughput requirements) will inform requirements for the size and capacity of the potential training solution and must be made available to inform the SOTR process. The SOTR forecasts annual throughput requirements 4 years in advance, in order to help generate the required capability. Throughput numbers may be required in support of a variety of related training solutions for each distinct training audience group. Throughput figures should be calculated separately for each type of training required and for all affected Defence people, MoD civilians and Contractors. Training throughput figures should be presented in table or graph format, along with any throughput assumptions. Training throughput figures for all training audiences can then be used as separate requirements to be considered by users in generating potential training solutions. These factors should be considered when estimating the throughput numbers: a. average lengths of assignment. b. per cent posted to similar role in a different location (such as, will not need to be retrained to assume role responsibilities)."
  },
  {
    "id": "16df56d7-d65f-46a6-9e66-71f90cbd88b5",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6 The Defence Human Factors Integration Policy for Defence Systems (JSP 912) also requires the development of a Target Audience Description so there is the potential for re-use of information here.",
    "content": "c. recertification issues (such as, how long is the training valid for). d. promotion cycle and its potential impact on training numbers (such as, number of target audience who will be promoted during their assignment). e. historic data on pass rates, if applicable."
  },
  {
    "id": "c7b26f5f-74a2-4ac3-b75a-7ae9e03fa0f1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6 The Defence Human Factors Integration Policy for Defence Systems (JSP 912) also requires the development of a Target Audience Description so there is the potential for re-use of information here.",
    "content": "f. any known contractual constraints. g. consideration for civilians and contractors who may need to attend the training. h. any known throughput constraints on pre-requisite training."
  },
  {
    "id": "11e5b7b8-b778-4dad-a3eb-c867bfac0c64",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6 The Defence Human Factors Integration Policy for Defence Systems (JSP 912) also requires the development of a Target Audience Description so there is the potential for re-use of information here.",
    "content": "i. potential competition with other training activities."
  },
  {
    "id": "8a6cb2ec-e9f1-48ac-b215-46a76a1a1c14",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4.5 Constraints Analysis",
    "content": "14. Any constraints affecting the TNA need to be analysed and highlighted to ensure that risks regarding financial, safety and technical issues are addressed. The TNA process should initially focus on satisfying the strategic need with the caveat that proposed training solutions are compared with the initial constraints as part of the TOA and/or EA. Further constraints are the timing/development of the TNA, accessibility to SMEs and Intellectual Property Rights (IPR). The TNA may be directed to examine a particular potential training solution, however, without prejudicing the final outcome. Constraints may also be identified in strategic trends, doctrine, concept documents (e.g. the Concept of Employment for a capability) or can be determined through contextual analysis (such as via PESTLE7 or other frameworks). They should also involve consideration of all the Defence Lines of Development (DLoDs)8. Key constraints include: a. Policy. On occasion, Defence Policy will dictate the Methods and Media to be used. The TNA should adhere to the DTEL Rules9 and Defence Policy for Modelling & Simulation (M&S) (JSP 939), as well as taking account of policies on the use of the Support Solutions Envelope, Integrated Logistic Support 10 and Human Factors Integration for Defence Systems (JSP 912). SCs may also mandate the use of specific training environments or solutions, which should be documented. b. Cost. Restrictions may be placed on the TNA by affordability considerations, which may restrict the number or scope of training options but could also take into account Value for Money (VfM) through-life (e.g. where investment has already been"
  },
  {
    "id": "7781d852-4ef3-4ed7-ae75-107b17fef474",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10 See http://aof.uwh.diif.r.mil.uk/aofcontent/tactical/sse/content/ksa2/gp208.htm.",
    "content": "made in training and, for economic reasons11, it is advisable to build upon existing capability rather than acquire new systems). Any analysis of cost constraints should always consider capabilities through-life. c. Time. Analysis is invariably conducted under time pressures, including the need to meet deadlines such as Initial or Full Operating Capability (I/FOC). Therefore, the TNA should consider any prioritisation that needs to be taken account of and then constrain the analysis accordingly. d. Safety. Training environments can be constrained by safety considerations, such as on the use of live fire or requirements imposed by safety cases. Note that, regardless of training solution, there is likely to be a requirement to conduct operating assurance through the use of live equipment."
  },
  {
    "id": "0e3988c4-6389-47da-bc13-3237c6570f36",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10 See http://aof.uwh.diif.r.mil.uk/aofcontent/tactical/sse/content/ksa2/gp208.htm.",
    "content": "e. Legal. There may be restrictions on training due to legal requirements, such as mandated hours for aircraft control duties or flying, as well as Care and Welfare responsibilities. Acts of Parliament may also influence training options. f. Resource. Analysis should take into account the unavailability or limited availability of both training audiences and potential training support requirements12. 15. Given the significant impact these constraints may have, the TNA should commence with their identification and risk management13, noting the potential impact and options for mitigating any threats or the consequences of constraints. From this analysis, a constraints table, risk register and an assumptions register (including a Master Data Assumptions List as required) should be compiled and maintained by the analyst and reviewed by the TNASG, noting that a constraints analysis is an iterative process and may determine that a training intervention is not the most appropriate way to address the Defence need."
  },
  {
    "id": "0dbaa722-6a46-415f-8b61-9ff581ecac8b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4.6 The Scoping Exercise Report",
    "content": "16. The scoping exercise report is an output of the Scoping Exercise, detailing what is appropriate to the training need and, importantly, make training solution recommendations. It should include: a. references to the relevant training policies."
  },
  {
    "id": "3815554d-c9fc-4d6c-8ac4-deb2af497913",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "4.6 The Scoping Exercise Report",
    "content": "b. assumptions, freedoms and constraints14."
  },
  {
    "id": "3f979992-7e55-46b5-9f60-13552e731630",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "14 Including current resourcing such as course design and the digital skills of trainers and designers.",
    "content": "c. the conclusions, outputs or recommendations of previous relevant studies (if any). d. membership of TNASG that will oversee the subsequent analysis stage. e. recommendation to continue with the TNA if appropriate."
  },
  {
    "id": "f665ba6b-c367-4ded-b9f4-7df3e8a63823",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "14 Including current resourcing such as course design and the digital skills of trainers and designers.",
    "content": "f. TNA outputs. g. TNA Terms of Reference (ToR). h. confirmation (or otherwise) that there is a training requirement that will fulfil the SOR (if there is not, the DSAT process should then cease)."
  },
  {
    "id": "7e4727df-05a4-4f5b-9c7a-1072b708b5bf",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "14 Including current resourcing such as course design and the digital skills of trainers and designers.",
    "content": "i. recommended possible training solution option(s) to be taken forward into the analysis and design stages. j. a section on risk. 17. Training solution recommendations. Training solution recommendations should be examined by the relevant stakeholders at the TNASG. Taking into account time and resources, it will decide the most appropriate way of taking the requirement forward. Where a training solution is recommended and agreed at the TNASG, a plan for subsequent analysis and design activities should be produced. If a training solution is not recommended, the DSAT process should be halted at this point. However, a response to the question, what should we do to address these deficiencies? should be given. The problem may not have anything to do with training and may require:"
  },
  {
    "id": "fa2739f0-e33c-4487-b4f7-e8e4b1ba540a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "14 Including current resourcing such as course design and the digital skills of trainers and designers.",
    "content": "a. a revision of procedures and/or improvements to management and supervision. b. production of role/task aides and/or the reallocation of tasks. c. changes in the approach to personnel selection."
  },
  {
    "id": "816cd8c4-2ed8-413e-b4d2-cf9f57ae707f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "14 Including current resourcing such as course design and the digital skills of trainers and designers.",
    "content": "d. acquisition of equipment. e. workforce incentives, such as pay and civilian qualifications. 18. The Scoping Exercise Report may include as documented evidence to inform future decisions:"
  },
  {
    "id": "05da13b3-3a26-4dec-91ee-a4b15de8036f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "14 Including current resourcing such as course design and the digital skills of trainers and designers.",
    "content": "a. Summary of new/changed requirement. A summary description should outline the proposed capability or technology/equipment and the benefits of the new or changed training requirement in the context of the Defence effect. This will enable the identification of the nature of the training gap and underpin areas requiring analysis (e.g. are there any changes to CONOPS; what changes are system/equipment function related; are there any impacts upon workforce structures?). b. Policy. Influences concerning policy 15 can affect the TNA strategy and can include various freedoms and constraints placed upon the Training Provider, such as: roles, tasks, structures, workforce levels, finance limits, Health and Safety"
  },
  {
    "id": "7c77cb6d-1dc0-4551-8f0b-d160eb1fe377",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "15 Particular reference should be made to the Service policies/directives for individual training",
    "content": "requirements, minimum qualification levels for prospective role holders and/or tasks, and any accreditation or legislative issues. c. Previous/associated studies. Reference to and use of previous or associated studies is strongly recommended. Information sources include previous TNAs, Human Factors (HF) studies and evaluation reports on similar requirement(s). For major projects, where more than one TNA is being undertaken, it can be useful to indicate the relationship between the various TNAs. d. Potential training services. The major types of training Methods & Media likely to be considered or examined should be included at this stage and then re-examined later. This will reflect the current training policy and should specify any areas requiring particular attention, such as the possible need for synthetic training, embedded training or Public/Private Partnership or Private Finance Initiative (PPP/PFI) solutions. These are only possible options and may change during the TOA/EA as a result of developments in policy, technology etc. An estimate of the cost of these services should be provided. Any new training solutions may have to utilise existing training facilities and associated established support elements (ie course design) which should be recorded in the report."
  },
  {
    "id": "df1e7aa3-fa71-4242-a5bf-7ec5def8b667",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "15 Particular reference should be made to the Service policies/directives for individual training",
    "content": "e. Methodology. The TNA methodology should be tailored to suit the specific training requirement but should always provide a full audit trail. For example, in the case of a small change to training policy, a TGA followed by a TOA to establish the most cost-effective Methods & Media would be sufficient. Equally, if the training is to fit into an existing training activity using similar delivery techniques and Media, then a full blown TNA may be unnecessary. The outputs from the scoping exercise and subsequent analyses should be agreed during Stage 1 of the TNA, which will allow the user to select the correct methodology and tools based on the constraints and information available at the time. Analysis should not be conducted as a check list exercise , but should only be undertaken if it adds value to the TNA. TNA is an iterative process and the TNA outputs are therefore subject to continuous review. f. Resources. An estimate of the resource allocation should be made to include the following: (1) sources of information required including documentation and access to SMEs."
  },
  {
    "id": "657c2d07-c95c-43e7-bcbf-721e621fa016",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "15 Particular reference should be made to the Service policies/directives for individual training",
    "content": "(2) procedure for the review and TNASG endorsement of the Training Needs Report. (3) Cost of Ownership (COO) concerning the responsibility and allocation of funding across the affected budget holders for the design, installation, operation and supportability of the recommended training solution. (4) sources of SME assistance, if applicable, the training workforce and facilities currently available."
  },
  {
    "id": "2fd5e9d5-bf8e-4c95-a3fd-81e84ad61a35",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.1 Introduction",
    "content": "1. The duties, tasks16, sub-tasks and task-elements performed by an individual constitute the Role 17. The RA is the process of examining a specific Role in detail, in order to identify all the component duties and tasks, the Conditions under which the Role is performed, and the Standards to be achieved when performing the Role. The person in the Role should also be considered. In this way, it will be possible to identify the Knowledge, Skills and Attitudes/behaviours necessary for effective performance. The RA should examine: a. role objective and responsibilities. b. principal duties and supporting tasks, i.e. the Performance and the Knowledge, Skills and Attitudes required to perform the Role."
  },
  {
    "id": "add49175-47a4-4bb0-907a-30d2c37d0857",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.1 Introduction",
    "content": "c. levels of supervision. d. the conditions which cover environment, work conditions and equipment, for example. e. Role Standards."
  },
  {
    "id": "59b2df57-d23a-409a-8457-231f08625234",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.1 Introduction",
    "content": "f. aspects of the Role found to be distasteful or unpleasant. g. frequency of task performance and percentage of personnel performing the tasks. h. likely job changes and consequences of inadequate performance."
  },
  {
    "id": "b51e3e52-55ed-4fe3-a39e-285958094770",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.1 Introduction",
    "content": "i. task criticality. j. Role-related factors influencing knowledge and skill fade (or competence retention). 16Task is a major component of a Role or duty that can be produced, compiled, achieved and/or accomplished by itself."
  },
  {
    "id": "5e8954ae-456e-4e33-a6bc-45c8f40d3b09",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.2 Identification of Role",
    "content": "2. There is a danger of concentrating wholly on the Role and so there is a requirement to widen the perspective to consider it in context. A Role does not exist in isolation but within the context of a particular organisation and situation. This context may affect not only the way the RA is conducted but also the eventual design of the training solution. As part of the identification process, users may wish to produce a Role Specification 18 and/or Role Description within the context of the individual Role, taking into consideration the factors listed below. Any identification process should consider: a. higher level context, including strategic context operational doctrine and team/collective scenarios. b. external context, including wider environment and conditions, for both individual and team/collective, and number of personnel fulfilling the Role."
  },
  {
    "id": "f3b324b0-27d2-4c36-b801-79dfdd12e9e3",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.2 Identification of Role",
    "content": "c. internal context, such as organisational structures, Role dependencies, relationships and responsibilities, and the training audience, throughput and selection processes. 3. As part of the Role identification process, it may be useful to consider: a. Role objectives."
  },
  {
    "id": "bfa9a25a-2cde-4c2d-b5cd-0a235fb614e3",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.2 Identification of Role",
    "content": "(1) Main. A short, concise statement of the main objective of the Role, phrased in terms of the Performance expected. It should begin with a verb denoting action. Vague terms such as to know or to understand should be avoided. (2) Subsidiary. Written in the same format, these either amplify the main objective by showing what must be done to achieve it or indicate additional areas of Performance within the Role. b. Duties and tasks. Duties are the principal activities of the Role holder, are directly related to the Role and are subordinate to the overall Role objectives. They can then be broken down into their component tasks, sub-tasks and task-elements. This is achieved through the Production of a Role Scalar which is discussed later."
  },
  {
    "id": "2abe345b-7779-48bd-bb1d-92e7202f2c85",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.2 Identification of Role",
    "content": "c. Standards. The Standards necessary for the satisfactory Role Performance should be considered and recorded. d. Conditions. The Conditions under which the Role is performed. An exhaustive list of every trivial condition is not necessary and only the important Conditions should"
  },
  {
    "id": "5b747e6c-9e4f-4a36-9f47-f469d0d372c0",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "18 TAFMIS has forms entitled  Role Specification  and  Role Description  to assist with this process.",
    "content": "be recorded. The breakdown of Conditions into categories of physical , intrinsic , social and psychological may be used. e. Responsibilities. Responsibilities should be listed under the headings of to superiors and for subordinates . It would also be convenient to include under responsibilities information to the degree of supervision exercised over the Role holder and the extent to which they would be held accountable for their own work or the work of others. This helps set the context. f. Difficulties and distastes. This information can indicate the areas that need to be emphasised in training."
  },
  {
    "id": "96f7ca4e-29ce-4cba-a0e4-b37df2dcb8e8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "18 TAFMIS has forms entitled  Role Specification  and  Role Description  to assist with this process.",
    "content": "g. Criticality. The relative criticality of a task within a given Role should be listed using pre-defined categories (e.g. high, moderate, low). This information can be used to inform risk management activities and decision-making relating to refresher training requirements. h. Role-related factors influencing skill fade. An identification of key factors influencing skill fade. It will be useful to consider both positive and negative influences on skill fade so that the impact of changes to the design of the Role (e.g. increased or reduced complexity, modifications to equipment design and associated resources) can be assessed. This information, along with the KSA, Difficulty, Importance, Frequency (DIF) and criticality analyses will help to inform the identification of appropriate training Methods & Media for both the acquisition and refreshment of Role-related skills and knowledge."
  },
  {
    "id": "64d1ee52-3315-4380-954a-181d496da4be",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.7 Production of Role Scalar",
    "content": "4. A Role Scalar is produced by analysing the duties, tasks, sub-tasks and task-elements (Performance) that have to be performed and recording them diagrammatically. The Production of the Role Scalar is a key part of the RA process as it defines the minimum Performance to be achieved in the Defence environment. Tasks within a Role should contain an object, a verb19 and sometimes a qualifier. An example of a task statement would be: 'perform a daily routine service on a diesel engine . A task can be defined as: a. a specific action. b. performed by an individual."
  },
  {
    "id": "2edfb8c0-cbd7-4ce1-a914-8f173bccc95b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.7 Production of Role Scalar",
    "content": "c. recognised by a definite beginning and an end."
  },
  {
    "id": "82fe6cda-f7d7-4dbf-87ed-a8a295785b05",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "19 The choice of verb is critical when writing tasks, sub-tasks (and, later, training objectives). Verbs must be observable and measurable. More guidance on this aspect of Analysis and Design is given on the DSAT courses delivered at DCTS.",
    "content": "d. performed for a relatively short period of time (could be hours but rarely days). e. observable and measurable. 5. The four levels within a Role Scalar are as follows:"
  },
  {
    "id": "f1b8820e-b491-4ad5-8e34-ce076578f6c7",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "19 The choice of verb is critical when writing tasks, sub-tasks (and, later, training objectives). Verbs must be observable and measurable. More guidance on this aspect of Analysis and Design is given on the DSAT courses delivered at DCTS.",
    "content": "a. Duties. The major functions, or areas of responsibility, of the Role. They have no specific start or finish and tend to be general in nature (e.g. act as Unit Health and Safety Advisor). b. Tasks. Major components of the Role that can be produced, compiled, achieved and/or accomplished by the individual. Each duty usually contains a number of closely related tasks that are essential for carrying out the duty. c. Sub-tasks. Sub-tasks are the component parts of each task."
  },
  {
    "id": "a7729654-43f4-4ad2-8898-5e5107241050",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "19 The choice of verb is critical when writing tasks, sub-tasks (and, later, training objectives). Verbs must be observable and measurable. More guidance on this aspect of Analysis and Design is given on the DSAT courses delivered at DCTS.",
    "content": "d. Task-elements. Task-elements are the sequenced step-by-step component of each sub-task. 6. The usual convention for the levels of a Role Scalar is shown in Figure 3. Figure 2: Role Scalar Levels"
  },
  {
    "id": "39b438fb-bddf-4235-a50e-8e15bbad9cac",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "19 The choice of verb is critical when writing tasks, sub-tasks (and, later, training objectives). Verbs must be observable and measurable. More guidance on this aspect of Analysis and Design is given on the DSAT courses delivered at DCTS.",
    "content": "7. Numbering system. It is important to employ a hierarchical numbering system within a Role Scalar, as often it is cross-referenced to other training documentation. The numbering system should indicate the level and relationship of the particular components of the Role. An example of a numbering system is shown in Figure 4. Figure 3: Role Scalar Numbering System 8. Role Scalars are particularly useful tools for:"
  },
  {
    "id": "39bf982c-0991-4052-8c21-dc54997850d4",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "19 The choice of verb is critical when writing tasks, sub-tasks (and, later, training objectives). Verbs must be observable and measurable. More guidance on this aspect of Analysis and Design is given on the DSAT courses delivered at DCTS.",
    "content": "a. displaying a structure to the Role that may not be apparent in real life. b. illustrating the relationship and interdependence of the various parts of the Role. The impact of a failure to perform any particular task can therefore be determined. c. showing areas of commonality and difference between closely related Roles, thus indicating where rational restructuring could take place."
  },
  {
    "id": "2b322701-ad29-49ac-9ddd-3c37f44460f1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "19 The choice of verb is critical when writing tasks, sub-tasks (and, later, training objectives). Verbs must be observable and measurable. More guidance on this aspect of Analysis and Design is given on the DSAT courses delivered at DCTS.",
    "content": "d. showing tasks to be performed with new equipment, related to existing Roles, and thus help assess the impact of new equipment. e. the production of a Role PS, Framework(s) and TOs. 9. Role Scalars also have disadvantages that should be considered: they do not contain Standards and Conditions and appear to give all tasks an equal importance. An important consideration in developing the structure of a Role is the aim to describe what the Role holder does, or should be capable of doing, and not what they need to know. Determining the knowledge that is required to successfully perform a task happens during the KSA Analysis. Role Scalars cannot in themselves be used to design training and should be supported by a full Role PS and/or Framework(s). However, they are a vital step in the production of required outputs such as a Role PS, Framework(s) and TOs."
  },
  {
    "id": "b4db312b-d00a-484a-9837-9f55cb9bc2d1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "10. DIF Analysis is a method of analysing Role information through the Difficulty, Importance and Frequency (DIF) of tasks and sub-tasks, with the aim of enabling early training decisions, such as the generation of Initial Training Categories20. DIF Analysis provides an indication of the priority and standard to be applied to the training. The DIF Analysis assesses the difficulty, importance and frequency of tasks using a simple algorithm, which is shown in Table 1. Difficulty Importance"
  },
  {
    "id": "c21afc44-ae14-48db-86ab-7fe796921a24",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "Frequency Training Category Very Difficult"
  },
  {
    "id": "04e66a4b-cf72-418c-b951-14aeafabe1a2",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "Very Important Very Frequent 2"
  },
  {
    "id": "c831454e-ecf5-4955-bc58-2b2ea1e48247",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "Moderately Frequent 1 Infrequent"
  },
  {
    "id": "8ab8be10-3f2c-4b55-be52-921b7b072cd0",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "1 Moderately Important Very Frequent"
  },
  {
    "id": "49a10fb3-c7e6-464d-8574-fca04382ba18",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "2 Moderately Frequent 2"
  },
  {
    "id": "addc335e-8495-4f39-973a-477f6e3bef13",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "Infrequent 1 Not Important"
  },
  {
    "id": "82ca6540-d5be-4664-88c4-e05ea76be691",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "Very Frequent 3 Moderately Frequent"
  },
  {
    "id": "d2fd7370-5482-417d-b171-cef64233257e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "3 Infrequent 2"
  },
  {
    "id": "d11225e1-c27c-46f4-a180-5ec29482f037",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "Moderately Difficult Very Important Very Frequent"
  },
  {
    "id": "3b4f1e55-dcfe-464a-9b73-9a11874b7e03",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "2 Moderately Frequent 2"
  },
  {
    "id": "6a8a6b7d-0c36-40b4-88c3-aa9ba918793a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "Infrequent 2 Moderately Important"
  },
  {
    "id": "ec16f579-0307-4a12-b5d4-66496ff635b3",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "Very Frequent 3 Moderately Frequent"
  },
  {
    "id": "a4033948-f658-4bf0-8339-753fdb70801c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "2 Infrequent 2"
  },
  {
    "id": "ea1734b7-d06e-4c10-a521-bb1c61e2c7e1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "Not Important Very Frequent 3"
  },
  {
    "id": "6f9cb473-0307-43bc-b120-d2f8877f8529",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "Moderately Frequent 4 Infrequent"
  },
  {
    "id": "d3e328ef-9395-4bb3-b5f5-eb16729b7b86",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "5 Not Difficult Very Important"
  },
  {
    "id": "a4fc0028-2325-4c43-8665-0dd29c46674b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "Very Frequent 3 Moderately Frequent"
  },
  {
    "id": "0c37e813-4da4-4634-bd72-fafa8cc69393",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "3 Infrequent 2"
  },
  {
    "id": "a1267888-f270-40ef-ba39-a371059317d8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "Moderately Important Very Frequent 3"
  },
  {
    "id": "2826cdc4-f0c2-472d-af14-4981bf4090e6",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "Moderately Frequent 4 Infrequent"
  },
  {
    "id": "4b9d143b-8148-4ac9-9b08-1a28ab5c964f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "4 Not Important Very Frequent"
  },
  {
    "id": "cfae5347-f34c-42bf-8df9-e9a1f19650bf",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "5 Moderately Frequent 6"
  },
  {
    "id": "f7ef9b6f-6e7f-4f6c-a367-8061330d75e3",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.4 DIF Analysis",
    "content": "Infrequent 6 Table 1: A DIF Analysis Algorithm"
  },
  {
    "id": "46cfb407-f4f4-4f50-b26a-9df2192f055b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "20 In TAFMIS, Initial Training Categories are listed as DIF Training Categories.",
    "content": "11. As DIF Analysis relies on subjective data it is essential that each level is clearly defined to try and increase the reliability of the data. Suggested definitions used within the DIF Analysis are as follows: a. Difficulty assesses the chance of performance error by asking the question: What is the possibility of inadequate performance from the average job holder? The range can be defined by using two extreme statements, namely, The task is easily performed once learnt to, The task requires constant practice and supervision . b. Importance, assumes that performance error is made and assesses the impact of the error by asking the following question: What is the impact/consequence to operational capability, safety, lost revenue and public relations if the task is performed inadequately? Once again the range can be defined by using two extreme statements, for example, Failure is unlikely to have any impact upon operational capability or well being of personnel or equipment to Failure will have an immediate and severe impact upon operational capability or risk of severe injury or damage to equipment ."
  },
  {
    "id": "c8f3595a-387b-46a4-b267-4a517687e71b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "20 In TAFMIS, Initial Training Categories are listed as DIF Training Categories.",
    "content": "c. Frequent tasks may or may not be Important or Difficult and scales may range from Once or more a day to Once a year to Never (if the task has changed then the requirement to carry out specific sub-tasks may have reduced to nothing). Task frequency becomes significant, however, when considering retraining, since frequently performed tasks do not require retraining if performance is adequate. The following factors may be included during analysis to collect information for future use: (1) Relative time spent on the task (very much above average, above average, below, average, average, very much below average). (2) Actual time spent on task."
  },
  {
    "id": "85579d1f-1020-49ff-b9a6-344041f59b10",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "20 In TAFMIS, Initial Training Categories are listed as DIF Training Categories.",
    "content": "(3) Frequency of performance (day, week, month, year). 12. An assessment of difficulty encountered in carrying out each task, the importance of each task to the achievement of the main job objective and the frequency with which tasks are performed, are key factors in making training decisions and priorities. DIF analysis is a useful technique which contributes to providing a rational basis for making decisions on the design of training which is superior to guesswork or intuition. However, other criteria may be used to decide upon levels of training; including numbers of service personnel performing the task, ease of training within the unit, how soon after training someone is expected to perform the task and how much time is spent performing the task."
  },
  {
    "id": "d266cefd-3cf8-4fa9-b8ee-f5f8d5734074",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.5 Knowledge, Skills and Attitude Analysis",
    "content": "13. A KSA Analysis is a systematic analysis of Performance and/or Standards in order to identify the necessary KSA required to perform a Role. A KSA Analysis moves on from what the Role holder does (captured in the Role Scalar), to identifying the KSA that have to be learned to perform the task. The results of an Initial KSA Analysis will help with the generation of Training Objectives and Enabling Objectives and the selection of the most appropriate training Methods & Media, during Element 2 (Design). Two examples of Initial KSA Analysis relating to a Role are at Annex A. 14. Knowledge. Knowledge is information acquired through experience or education; the theoretical or practical understanding of a subject. Knowledge generally involves recalling information, e.g. the knowledge of rules and regulations, names, sequences, classifications, methodology, events, principles or theories. Whenever a task is performed, knowledge is required. When carrying out a task, a possible pre-requisite is knowledge of: a. When to perform; what are appropriate tactics, techniques, procedures, tools or materials?"
  },
  {
    "id": "d54d63b0-1a66-4e84-9ef6-7c9cdca1c176",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.5 Knowledge, Skills and Attitude Analysis",
    "content": "b. Where are the tactics, techniques, procedures, components, materials and/or equipment? c. How to use/operate the tactics, techniques, procedures, materials, tools and/or equipment? d. What are the safety procedures or constraints; what possible dangers are there?"
  },
  {
    "id": "a510754e-7892-4cb4-a7dd-ca84b4e24d1e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.5 Knowledge, Skills and Attitude Analysis",
    "content": "e. What are the testing or checking requirements and procedures involved? f. What constitutes task completion? 15. It is important to note that a Role PS can refer directly to a requirement for knowledge when it is linked to the practical performance in a Role as stated in the Role PS. KSA Analysis identifies the supporting knowledge required for task performance. Training should only contain knowledge which is essential to the satisfactory performance of a task. For example, where key references are available at the time a task is performed, there may only be a requirement to learn how to access the information rather than learn the contents. Wider knowledge acquisition and application is the remit of education."
  },
  {
    "id": "8393c4ad-6618-4151-9d1d-eb20f1351f97",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.5 Knowledge, Skills and Attitude Analysis",
    "content": "16. Skills. A skill is defined as an organised and co-ordinated pattern of mental and/or physical activity. It is the ability to do something well. It is built up gradually by repeated correct training or practice. At Initial KSA analysis, the skills listed are kept quite high level. Later on in the Design process the split into mental and physical/practical skills can be further refined: a. Mental skills. These constitute the knowing how (procedural knowledge) as opposed to the knowing what (facts) (e.g. knowing how to calculate percentages, knowing how to interpret technical data, knowing how to classify sonar contacts). It would not be possible for the trainee to learn all of these things as facts because too many individual instances exist. The mental skills the trainee learns, therefore, enable them to respond to entire classes of situations, e.g. to make decisions when presented with information and alternative courses of action. b. Physical/practical skills. These can be described as learned capabilities of performing actions in an organised and fluid manner. They are overt and observable during their performance. Skills may be discrete (operate a switch) or continuous (fly/drive a vehicle). These skills are learned in connection with common activities such as using a computer, driving a car or playing a musical instrument. Many tasks performed in Defence can be categorised as having a large physical component, e.g. stripping and assembling a weapon (discrete), flying an aircraft (continuous) and tying a bowline (discrete). Complex physical skills can often be broken down into smaller sub-skills, which can be learned separately and then put together for total performance. An example of this is swimming, which has 3 sub-skills (arm action, leg action and breathing technique), which can be learned and practised separately and then performed as one. More complex skills such as flying/driving, are similarly broken down into their component parts and taught as discrete skills in discrete lessons."
  },
  {
    "id": "5332b8a6-c7d7-439f-882f-87e4ed65e0fb",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.5 Knowledge, Skills and Attitude Analysis",
    "content": "17. Attitudes. An Attitude is a way of thinking and feeling about something, often but not always demonstrated through behaviour. The identification of Standards relating to personal qualities and Attitudes is perhaps the most challenging part of the KSA Analysis. This is because Attitudes cannot always be observed directly and hence the creation of definable standards can prove difficult. Attitude is defined as a predisposition resulting in a tendency to act or react in a certain manner when confronted with another person, group, object, situation or idea. It is important to understand that this predisposition to think and feel in a certain way does not necessarily result in observable behaviours. An example of this could be an individual who holds an Attitude that all dogs are dangerous. However, this attitude may not be obvious to others when the individual is handling a dog with which they are familiar and have learned is friendly. Table 2 illustrates how Attitudes can manifest themselves. Attitudes generally: * are learned from experience (or from others);"
  },
  {
    "id": "5e167dee-99c7-45b8-b452-b119d6745d84",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.5 Knowledge, Skills and Attitude Analysis",
    "content": "* may include thoughts, feelings and behaviours; * influence our behaviours towards people or objects; * may be stable and persist over time; but"
  },
  {
    "id": "f9b64a76-fc52-4f64-b71c-620b0e69358c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.5 Knowledge, Skills and Attitude Analysis",
    "content": "* can be changed rapidly through experiences, circumstances, education or training. Attitudes have three main components: * what we think, e.g. all dogs are dangerous ."
  },
  {
    "id": "f442cfc4-23d4-4f97-802e-d5198646e037",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.5 Knowledge, Skills and Attitude Analysis",
    "content": "* what we feel, anxiety or fear near dogs . * how we act, avoid or approach dogs (observable behaviour). Table 2: Attitudes"
  },
  {
    "id": "f99f6b2b-e5de-492d-8dfa-76115dbbb52a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.5 Knowledge, Skills and Attitude Analysis",
    "content": "18. Within each role there are tasks that have an attitudinal component related to their performance. Initial KSA Analysis identifies Attitudes associated with role performance to determine the required direction of that attitude. At this stage the Analysis of Attitude can be quite high level. The depth of the analysis within the attitudinal domain will occur at course design stage/A Spec stage. Once the Attitudes required to fulfil a Role are identified, training can be designed to achieve them. Knowledge and skill training can be wasted if attitudinal training is ignored. A lecture on computer security may be successful in imparting information on how viruses are transmitted but unless it develops an attitude of security consciousness the trainees may not use the knowledge they have gained on the subject. 19. To assess an attitude, behaviour must be observed, possibly over a period of time. To assist subjective judgements on attitude an objective criteria should, where possible, be used to support the decision. Defining the negative, what is unacceptable behaviour, can result in a simpler and more precise Standard. A Behaviourally Anchored Rating Scale (BARS) is an example of a tool which can be used to assess observable behaviour objectively. Although a BARS (Table 3) can be used to measure attitude indirectly through observing behaviour, much care is needed when inferring Attitudes from observable behaviours alone. Attitudes may also be directly measured using validated questionnaires or other psychometric instruments21. Some examples are presented in Table 3. Note that whilst BARS is predominantly a tool used in the training environment, forming part of the ASpec if appropriate, it is mentioned here because it is useful to bear it in mind at the RA stage."
  },
  {
    "id": "056fade1-1504-44ae-86ff-aad96fdf80a2",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.5 Knowledge, Skills and Attitude Analysis",
    "content": "COMMUNICATION Rating Tick"
  },
  {
    "id": "fcc9e925-d5ee-4301-a6e9-92680ed7be4c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.5 Knowledge, Skills and Attitude Analysis",
    "content": "Behavioural Indicators Unsatisfactory (-1) Speaks to others in an aggressive manner."
  },
  {
    "id": "df3ef3b4-d7f1-416f-838e-f42992f97dac",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.5 Knowledge, Skills and Attitude Analysis",
    "content": "Fails to listen effectively Ignores the opinions of his/her peers Does not articulate logically or clearly"
  },
  {
    "id": "4ee28715-76ac-4836-9921-1ed34985c98e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.5 Knowledge, Skills and Attitude Analysis",
    "content": "Meets expectations (+1) Can adapt style of communication appropriately Communicates clearly and logically so others understand"
  },
  {
    "id": "ba540f98-4d91-432a-a34c-a4e13808dd6e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.5 Knowledge, Skills and Attitude Analysis",
    "content": "Actively takes part in group discussions Demonstrates active listening skills Exceeds expectations (+2)"
  },
  {
    "id": "090f4c17-8b1c-4a53-9388-77f037b8340c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.5 Knowledge, Skills and Attitude Analysis",
    "content": "Leads group discussions effectively and appropriately Chooses specific language and detail to capture and maintain attention of others Demonstrates appropriate confidence and assertion without arrogance"
  },
  {
    "id": "5c81ef2c-8284-44da-b736-f7ca6029a410",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.5 Knowledge, Skills and Attitude Analysis",
    "content": "Can present arguments logically and clearly without aggression Overall Score obtained during observation = Table 3: Behaviourally Anchored Rating Scale"
  },
  {
    "id": "386a3a31-4e9e-4073-82bc-2a453241a68f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.5 Knowledge, Skills and Attitude Analysis",
    "content": "20. Although Attitudes may be inferred from observable behaviours this is prone to biases (e.g. a group of soldiers may set up an Observation Point (OP) with no attempt to camouflage their position. This might infer that they do not care (Attitude) about"
  },
  {
    "id": "e4d3893e-f4e6-4dff-8d74-4d5c3389d393",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "concealment. However, they may simply not know (Knowledge), or have forgotten about concealment rather than not care about it. Similarly, they may lack the ability (Skill) to properly conceal their OP). Before remedial training is implemented, identifying the correct domain is critical. Targeting an Attitude may be inappropriate if the knowledge or practical Skill is lacking. 21. In order to develop an optimised training system it is important to consider both how Knowledge, Skills and Attitudes are acquired and how they are retained over time. Understanding the rate at which different types of Knowledge and Skills fade can inform training design and the setting of refresher training intervals. In order to conduct refresher training interval analysis, it can be useful to use a more detailed breakdown of Knowledge and Skills than that discussed in DSAT activity Initial Knowledge, Skills, Attitudes (KSA) Analysis. Literature from psychology and cognitive science suggests that Knowledge and Skills can be broken down as shown in Table 4. Type"
  },
  {
    "id": "4ac04779-ddab-48d3-ad11-9bac0dfe9987",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Description Task Examples Continuous"
  },
  {
    "id": "da100f5b-cf4d-4336-92c5-84435d6cc6f2",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Psychomotor Skills The ability to perform (repeated) motor actions that do not have distinct beginnings or endings."
  },
  {
    "id": "6b1134b2-b1fb-4e37-9ff3-5069bdb3091e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Flying aircraft, driving, soldering and welding. Discrete Psychomotor The ability to conduct physical tasks with discrete beginnings and endings. These physical tasks have a"
  },
  {
    "id": "3739223c-1ffa-4994-8b3c-3306f75ae2e3",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "procedural element. Weapon handling e.g. assembling and dis-assembling a rifle; exchange steering box assembly."
  },
  {
    "id": "42a1b2ed-e5b9-4eff-9f15-c023077ac5f1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Explicit Knowledge Explicit knowledge required to conduct a task such as facts, principles, concepts, and theories. Quality and engineering hygiene measures; safety regulations; knowledge of how to use hand"
  },
  {
    "id": "fb02ed5c-0061-4707-806e-f97b4575f2da",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "tools and testing equipment. Decision Making Application of cognitive processes such as judgement, problem solving, reasoning"
  },
  {
    "id": "10763669-3d79-425e-af23-aa4f12445cd5",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "and analysis in order for an individual to arrive at a decision. Fault diagnosis Procedural Skills"
  },
  {
    "id": "71361af9-7486-4505-8acd-5b370fd6b0c1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Ability to remember a sequence of steps and their order so as to execute a task. Application of this type of skill relies on the working memory capacity of an individual, and hence the procedural aspect of the execution of the task is inherently cognitive in nature. Motor or physical elements are minimal. Fault finding; Navigating through menus and submenus on a digital Battlefield Management System to execute a command."
  },
  {
    "id": "104bd3ec-d154-4232-bed4-a075a5b08240",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Table 4: Knowledge and Skills Domains 22. Without practice, continuous psychomotor skills and explicit knowledge are retained for the longest; discrete psychomotor and decision-making skills have moderate retention over time and procedural skills fade the most quickly. The retention of Knowledge and Skills over time is moderated or influenced by how often the task is performed or practised. Table 5 shows the impact of task performance frequency on the retention of the different types of Knowledge and Skills. For example, if discrete psychomotor skills are performed very frequently then the retention level is High. However, if performed infrequently then the retention level is reduced to moderate. Type"
  },
  {
    "id": "858fa6e5-3282-458c-8fba-c483c1e12d7a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Frequency of task performance Retention level Continuous Psychomotor skills"
  },
  {
    "id": "ee140700-e805-48b0-a0a4-0e9a61d93e8b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Explicit Knowledge Very Frequent High"
  },
  {
    "id": "02e6a837-7d2c-493f-b055-7a720a977b47",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Moderately Frequent High Infrequent"
  },
  {
    "id": "8ed80e69-6c4a-4860-947b-3628fb7cafa4",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "High Discrete psychomotor skills Decision- making skills Very Frequent"
  },
  {
    "id": "f8522d4f-3271-4bf9-8c84-1f0a262f1f55",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "High Moderately Frequent Moderate"
  },
  {
    "id": "8129425c-77b9-493e-b605-abf9144fdd84",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Infrequent Moderate Procedural skills"
  },
  {
    "id": "65ac8321-7b2d-4d47-afdc-f5093adf7298",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Very Frequent Moderate Moderately Frequent"
  },
  {
    "id": "16130703-53c2-4f73-adaf-50ce12a3353d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Low Infrequent Low"
  },
  {
    "id": "4b2deea8-0f50-4374-8a24-86eba1aaf47c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Table 5: Effect of Task Frequency on Knowledge/Skill Retention 23. The retention level of the Knowledge and Skills for a given task should be taken into account when setting refresher training intervals. It is important to note that a number of role-related factors (in addition to frequency of task performance) can also influence Knowledge and Skill fade, e.g. designing equipment, job aids and operating procedures in accordance with good practice (which includes built-in user feedback for equipment and interfaces, logical steps within procedures). 24. Training methods, media and assessment regimes which ensure the effective acquisition of knowledge and skills in the first place also help to reduce skill fade. Table 6 provides a summary of training strategies which can be used to improve knowledge and skill retention. The first column indicates which types of knowledge and skill the strategy is relevant to."
  },
  {
    "id": "a533c078-8eda-4720-bcaf-051dc7182047",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Training Strategies Description Job aids"
  },
  {
    "id": "dd14bb53-2aa8-4c2a-b181-d7eea23a0182",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "(Relevant to all knowledge and skill types) Provision of a job aid. Job aids can reduce operator memory load and the likelihood of skill fade. Their influence depends on their quality and practicality. Feedback"
  },
  {
    "id": "5d8d005d-6572-455f-bfb5-98bc22751fe1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "(Relevant to all knowledge and skill types) Provision of quality feedback. Detailed feedback stemming from a learner s performance, combined with a chance to improve performance, is important to skills acquisition. Reducing the frequency of feedback during training promotes long term retention and skill transfer."
  },
  {
    "id": "3f14dae1-7ed5-49c1-a432-4dbb7efb4e24",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Communicate utility of training (Relevant to all knowledge and skill types) Training is perceived as having high utility when a link is perceived between required performance and outcomes valued by trainees. Those who perceive training as valuable are more likely to apply newly acquired knowledge, skills and behaviours to the job than"
  },
  {
    "id": "0ea1cb06-6011-4b28-a7d0-49c4fe2c5cb8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "trainees who do not. Assessment enhanced learning (Relevant to all knowledge and skill types)"
  },
  {
    "id": "fc8fcae0-959f-4fd4-bd82-d297040740d4",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Assessment enhances retention, whereas continuous training without assessment has a limited effect on retention. When used frequently during initial training, assessment of performance enhances skill acquisition and retention. Assessment combined with the provision of feedback on performance assists learning and retention. Provision of recognition cues"
  },
  {
    "id": "c64d317e-b0d2-4114-ac36-99d8c0fde159",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "(Procedural skill type) Providing recognition cues to learners has been shown to have a beneficial effect on learning and retention, particularly in the retrieval of aspects of long, complex or procedural tasks. For"
  },
  {
    "id": "4dfd5b96-34e2-4a49-bce7-41577861148d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "example, recognition cues can be used to prompt a user as to what the next step should be in a task performed on a digital Battlefield Information Management System (BIMS). Part-task training"
  },
  {
    "id": "f5f589e1-ac9b-450a-9f89-ab1fedbf024e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "(e.g. continuous and discrete psychomotor and procedural skill types) Tasks can be decomposed into components e.g. subtasks. Part- task training involves trainees learning and practising these task components in isolation. Once mastered the whole task should be practised. This strategy is particularly beneficial for very complex tasks with cognitive (e.g. procedural) and psychomotor components."
  },
  {
    "id": "c4d0d64b-989a-487d-9c1e-20c9c17cb102",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Appropriate simulation fidelity (e.g. continuous and discrete psychomotor, procedural, and decision- making skill types)"
  },
  {
    "id": "a2186aad-8daf-4a14-ba0b-8e3309d8a408",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "When the acquisition of cognitive skills (procedural/decision making) is required, it is the psychological fidelity of a task and not its physical fidelity that drives skill acquisition and consolidation. However, where cognitive and psychomotor skills are combined high fidelity simulation helps the consolidation of skills. Procedural instructions (Procedural skill type)"
  },
  {
    "id": "e9610cd1-bb06-4e0a-a8f6-dfa4f4636beb",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Structure instructions in a way that will induce learners to expend the cognitive effort needed for effective learning. Inclusion of more general steps helps learning transfer; they force the learner to try to understand the system or domain and engage in effortful cognitive strategies. Inclusion of examples with general instructions supports initial performance, because it helps the learner understand what they needed to do. Refresher Assessment (e.g. discrete psychomotor, procedural and decision- making skill type)"
  },
  {
    "id": "708ea8d6-d62f-4230-a0b0-3f43aff6b920",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Assessment of core knowledge, skills and behaviours reduces the burden on refresher training. Training is only required for those task components where performance is below the required level of proficiency. This can exploit advances in new training technologies for the assessment of core knowledge, skills and behaviours at any point in time. Decision-making skills can be assessed using novel scenarios. Standardised and recorded assessment"
  },
  {
    "id": "91bac0e4-d188-43b8-a126-1bffc50ab863",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "(Relevant to all knowledge and skill types) Recording trainee performance helps trainers in making objective assessments of learners skill acquisition and in targeting the provision of feedback. Match between training and operational environment"
  },
  {
    "id": "d4f68811-f81a-491e-a42b-794a4738d559",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "(Relevant to all knowledge and skill types) Retention is enhanced if the training context and situational cues are similar to those which are experienced in the operational environment. Individuals should be exposed to as many different situations and content-based scenarios as possible to promote knowledge and skill transfer."
  },
  {
    "id": "152d46d0-7571-49d3-a48f-ab3566d3b9c7",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Overlearning (overtraining) (e.g. discrete and continuous psychomotor, and procedural skill types) Overlearning refers to the continuation of practising a task after error free performance has been achieved. It can enhance speed of performance after accuracy has reached a ceiling. Effective for both psychomotor and cognitive skills, although any benefits provided are stronger for tasks with a cognitive element (e.g. memory for procedures). Overlearning can benefit, e.g. the"
  },
  {
    "id": "1b72201d-ae12-4cdd-9d25-a95dc5c0685d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "acquisition and retention of safety critical drills which can be proceduralised. It has little effect on long-term retention. Variable practice training (Relevant to all knowledge and skill types) Varying the practice of knowledge and different skills so that items are intermixed across the training programme rather than repeated in concentrated blocks; this enhances long term retention after extended periods of no practice. Acquisition can take less total time and the retention can be 50% better. The optimal inter study interval in distributed training protocols lies between 10-30% of the retention interval with longer inter-study intervals enhancing retention more than shorter inter-study interval. A longer-than-optimal spacing is better than shorter-"
  },
  {
    "id": "622f9fd9-e25c-4dea-a810-cb0f9f08bf3a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "than-optimal spacing. Active learning (Procedural and decision- making skill types) Active learning can be more effective than guided learning. The instructor creates a training environment in which the trainee can:"
  },
  {
    "id": "658021c3-c385-45e3-a0dc-65f2eaba9159",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "i) learn to organise new information into existing mental frameworks which hold prior knowledge in order to generate new knowledge about the context; and ii) practise the application of newly acquired knowledge and skills. Knowledge, skills and behaviours attained at a higher (cognitive) level are retained for longer. An example is error management training where trainees are given the opportunity to make errors and learn from them. Trainers should do the following: i) Present trainees with a series of practice examples illustrating the range of different conditions that they may subsequently encounter in the field including any unusual situations; and ii) Encourage trainees to think about these situations, make errors and learn from them. Guided training can be blended with active learning for complex tasks by directing trainees in how to explore training resources and make errors so that it is clear that they are an expected aspect of training. This ensures that trainees experience the same set of errors and do not feel responsible for them."
  },
  {
    "id": "f6424111-7a7c-48ef-ade0-723572956fca",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Task-oriented training (e.g. knowledge and decision-making skill types) Use the context of a given task to train the knowledge, cognitive skills and behaviours required instead of teaching material at an abstract level without reference to how it will be applied on the job. This strategy optimises the level of original learning and retention."
  },
  {
    "id": "19eb01fb-34c3-4202-b804-727f34a1e5c2",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Standard training scenario (Relevant to all knowledge and skill types) Use of standard scenarios that are progressive in difficulty would allow students to build on knowledge and skills already gained. Standardisation also enables comparisons to be made between students and training facilities as all trainees would have a standard background."
  },
  {
    "id": "c1008e5c-554d-49c8-8c52-1ca9b550ae01",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "content": "Table 6: Training Strategies to Improve Retention of Knowledge and Skills"
  },
  {
    "id": "87507a1a-19f9-427a-ad48-9564a40dc46b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.6 Initial Training Categorisation",
    "content": "25. A thoroughly conducted RA will be wide ranging and will include consideration of levels of supervision, work conditions, task criticality, difficulties and distastes, frequency of task performance, Role-related skill fade factors, percentage of personnel performing the Role and consequences of inadequate performance. All of this information, in conjunction with information on trainee entry standards, trainee throughput and knowledge of the likely training environment, can lead to conclusions regarding the balance between training delivered as part of the TPS and training delivered as part of the WTS. These conclusions are expressed through the use of training categories. A number of techniques may be used to derive training categories, with the main analytical tool being the DIF Analysis already conducted. Training categories are defined in Table 7. Training Category Definition"
  },
  {
    "id": "b1d37423-3c5f-491c-802f-858fd688f19e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.6 Initial Training Categorisation",
    "content": "1 By the end of the training activity the trainees will have performed the whole task several times, to the full Role Standard, and under realistic scenarios and conditions in which the physical, functional and environmental fidelities were accurately reproduced. The trainee will be able to perform the task competently, immediately on arrival in the workplace. 2"
  },
  {
    "id": "832d59e8-c390-4044-b581-193aa771c4e5",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.6 Initial Training Categorisation",
    "content": "By the end of the training activity the trainee will have performed the whole task at least once to full Role Standards, under realistic physical, functional and environmental conditions and in a realistic scenario. The trainee should be able to perform the task on arrival in the workplace. 3 By the end of the training activity the trainee will have performed the whole"
  },
  {
    "id": "00dfc12f-46e7-4b9e-a1b5-4ea4cb2d6a8a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.6 Initial Training Categorisation",
    "content": "task in a training environment to a lesser Standard than required in the Role (safety Standards to be met in full). 4 By the end of the training activity the trainee will have demonstrated an adequate level of underpinning Knowledge and principles required but will not have applied it to develop the Skills required to perform the task."
  },
  {
    "id": "baf4acd3-1e98-4fa2-b650-4ea671bcfe04",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.6 Initial Training Categorisation",
    "content": "5 All training delivered in, or under the auspices of, the workplace. 6"
  },
  {
    "id": "4e7ff4af-93ed-4140-9504-d971085e2ba6",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.6 Initial Training Categorisation",
    "content": "Trainees do not require any training. Table 7: Training Category Definitions22 26. Other criteria influencing training categories. Once a suggested training category has been selected (using information from the DIF Analysis), it should be subject to further review as other factors may result in an increase or decrease in category. Other criteria that may influence the training categories that relate to the Role environment are listed below:"
  },
  {
    "id": "cd380cbb-012e-41ab-bf91-9aba2cecf7cf",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.6 Initial Training Categorisation",
    "content": "a. How many people perform the task? This may determine the need for training and the priority given. b. How much time is spent on the task? This can sometimes be more important than frequency. c. Realism and safety. These considerations may make it impossible to conduct any training. Tasks falling into this category, and how they are dealt with, are covered in the next section (Element 2, Design, 2.2.3, RTGS)."
  },
  {
    "id": "191022a2-32b9-40f2-807f-eaca58e22b36",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.6 Initial Training Categorisation",
    "content": "d. Degree of supervision in the workplace. If closely supervised when performing a task, the training category may be reduced since the supervisor can detect errors in- role and then correct them. e. Time interval between training and first performing the task. The training Standards may deliberately be higher than the required Defence standard in terms of timing or accuracy to avoid knowledge/skill fade."
  },
  {
    "id": "111290bb-291e-4318-9872-6befbb19e199",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "22 It is recognised that Training Categories require further review to reflect the blended approach to Defence training.",
    "content": "f. Legislation, regulations and government policy. Regardless of training category, a task may have to be included in training if those trained are to be authorised to carry out the task. g. Legally mandated civilian accreditation. The inclusion of training for a task originally allocated a low category may be critical for obtaining legally mandated civilian accreditation, which is a mandated requirement of that Role. An example is the requirement to obtain a civilian driving licence before progressing to driving military vehicles."
  },
  {
    "id": "7c91b398-019c-4dfd-9a5c-9a8f7c97de98",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.7 Role Performance Statement",
    "content": "1. A Role PS is produced and maintained by the TRA and is a detailed statement of the tasks, sub-tasks and so forth that are required to be undertaken by an individual to achieve the articulated workplace Performance. It includes the Conditions under which the tasks will be undertaken, the Standards that must be achieved, and adds an indication of the importance of the training required to achieve the task Performance. It forms the basis for all subsequent work leading to the production of TOs. This ensures that the need for training and associated resources is justified by the needs of the Role. It also ensures that the training undertaken remains focused on the Role. Whilst a single Role PS can be produced to cover all the duties associated with a Role, a Role PS may alternatively be written for a specific duty where it is shared across many Roles (such as the duty of firefighting). The Role PS is developed using: a. Role Scalar. Carry across the duty, task and, if appropriate, sub-task statements from the Role Scalar. The numbering system used should be used on the Role PS to ensure the two documents are linked. b. Conditions. Identify and list the important Conditions under which the tasks will be performed (an exhaustive list of every trivial condition is not necessary). The Conditions statements should specify the physical location, level of supervision and any other particular environmental factors associated with the task. It may be helpful to breakdown the Conditions into categories of physical , intrinsic , social and psychological ."
  },
  {
    "id": "13dc5d1a-179d-4040-8115-7f072e834940",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.7 Role Performance Statement",
    "content": "c. Standards. Identify and list the Standards to which the tasks will be performed. They will be either: (1) Product Standards. Minimum absolute Standards, such as time, accuracy and safety limits. (2) Process Standards. It may be important that certain procedures are followed in a particular sequence in order to successfully achieve the Performance. Often these will be listed in a technical manual and the Standard"
  },
  {
    "id": "3b129efa-4000-4c23-a003-4db3833c793b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.7 Role Performance Statement",
    "content": "may include a reference to this. If not, these steps may be given as process Standards and are the essential sub-tasks and task-elements from the HRA. (3) Combination of Process and Product Standards. Where Standards are defined in more detail in other documents, the references should be in full and include the issue number and date. Where publications change frequently reference may be made to the most recent issue 23. 2. Training category. As covered in training categorisation (Section 3.3), this states the training level required to achieve the task Performance and the balance between training to be managed and/or delivered by the TDA (e.g. in a training establishment) and training conducted in the workplace. Tasks not requiring any training should also be identified."
  },
  {
    "id": "c94f6aa3-0aa8-4c44-91f1-6e81b293dabe",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.7 Role Performance Statement",
    "content": "3. Performance, Conditions and Standards. It is essential that the Performance, Conditions and Standards identified reflect the realities of the Role. An example of a detailed Role PS format is at Annex A."
  },
  {
    "id": "2ff31b9a-bce5-40a3-8a1a-dc94f4de8719",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8.7 Frameworks",
    "content": "1. The user may wish, as a result of the RA (particularly the KSA Analysis), to consider the production of either a competence framework or competency framework, or both; either in addition to, or instead of, a Role PS. This could be done if a people focus, rather than pure task focus, is required. 2. Competency & Competence. The human element of operational capability is a complex area to analyse. It is, however, important to understand both the people and training aspects, as different methodologies of analysis fit different needs, and, within the Defence context, they are sometimes confused. The relationship between competency, competence and performance needs to be understood in a consistent manner: a. Competency (plural: competencies) is the underlying characteristic(s) of an individual which results in effective and/or superior performance within a Role. OJAR/SJAR is an example of an organisational level competency framework that is common to all Service personnel. Professional competency frameworks can also be used in order to provide guidance to defined professional groups, such as the Royal Navy s Command Competency Framework, where there is a need for longer term individual professional development and/or selection."
  },
  {
    "id": "25828427-6552-43d5-9744-c822fb9802db",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8.7 Frameworks",
    "content": "b. Competence (plural: competences) is the measured ability of an individual to consistently perform a particular occupational skill or range of skills to a required Standard, under prescribed Conditions. The Role PS serves as the statement of the"
  },
  {
    "id": "925aad4c-6240-4a94-af44-dddbf292b5e8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "23 In this instance, however, analysts must ensure that their references are up to date.",
    "content": "Competence performance required for Defence under the DSAT model, articulating the skill orientated requirements of a Role. 3. Although linguistically similar, competence and competency are distinct concepts. The essential distinction is between aspects of the role at which the individual is competent (the competence), and aspects of the individual that enable them to be competent (the competency). The relationship between competence, competency and performance is illustrated in Figure 5. INDIVIDUAL JOB"
  },
  {
    "id": "8553c89a-1ce9-4d9b-9d0a-485102307977",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "23 In this instance, however, analysts must ensure that their references are up to date.",
    "content": "What they are like What they can do Select & Develop COMPETENCY"
  },
  {
    "id": "3ac92105-6c66-490b-bfdf-fead561d3ca7",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "23 In this instance, however, analysts must ensure that their references are up to date.",
    "content": "Source: Young, M. (2005). A model linking competency, competence and performance . Competency and Emotional Intelligence. Summer 2005. Figure 4: Relationships between Competency, Competence and Performance"
  },
  {
    "id": "4dc35a99-e6a3-45a9-acc2-4c9303bf3498",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "23 In this instance, however, analysts must ensure that their references are up to date.",
    "content": "4. Figure 5 illustrates that both competency and competence are essential enablers of individual performance; they are not mutually exclusive. Selection, development (including education) and training have key roles in growing necessary competencies and competences. Therefore, effective human capability development should not neglect either; instead, consideration of both will result in optimal requirement setting and solution development. Competence development (in the form of a Role PS and associated training solutions) is covered under the DSAT training analysis process contained within this policy. Furthermore, DSAT derived training solutions may either require some competencies as a pre-requisite or be developed during a training solution (often at the EO level)."
  },
  {
    "id": "ff5e56c0-10e6-4e5a-8752-876164d4fe36",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.8.1 Competence Frameworks",
    "content": "5. Competence frameworks are not the sole preserve of Defence and many external bodies and organisations utilise and develop them. Where an external awarding body has already developed an appropriate competence framework (usually in the form of job-related standards/qualifications grouped under competence areas) it is acceptable within the DSAT process to utilise this, as appropriate, rather than developing bespoke a Role PS from scratch. This has the added benefit of easing the accreditation process and aiding skills transfer from both within Defence and externally (particularly during transition to civilian life). Furthermore, where similar competences are employed over a wide range of roles across Defence (e.g. more than one TLB), it may be appropriate to develop a competence framework for particular professions/trades in Defence. The use of an established competence framework does not absolve the analyst from capturing both the requirement and solution within the TrAD along with the necessary documentation; ensuring it is endorsed by the CEB. In particular, where a competence framework is used, CEBs should assure themselves that the solution does not greatly exceed the requirements of the role just in order to meet desirable external accreditation or to save resource expenditure on the analysis phase, which may be detrimental to the final training solution."
  },
  {
    "id": "c935b382-fbb2-418b-98c4-e61501ee77fa",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.8.2 Competency Frameworks",
    "content": "6. Similarly, competency frameworks are also used outside of Defence as they are recognised to have applications across a whole range of developmental activities, including training. Competency frameworks are now seen as an essential vehicle for achieving organisational performance through the development of human capital by reviewing individual capability and potential. Essentially, competency frameworks are a human resource tool and are generally used at organisational or functional level and can be used in selection, performance development and training. Competency frameworks are used to document required organisational behaviours, under grouped competency areas; such as Leadership, Communication, Problem-solving and Team-working. Where competency frameworks exist, it is acceptable to use them within DSAT, if the behavioural descriptors are appropriate within the context of Defence."
  },
  {
    "id": "ed4ad72d-59ed-4ceb-bd31-cd98e19ba3b7",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.8.3 Competence Retention Analysis Handbook.",
    "content": "Competence Retention Analysis (CRA) is a scientific methodology developed as a practical approach to predicting the retention of different knowledge and skills that underpin military tasks at the workforce level. CRA is intended to assist Defence to reduce the impact of skill fade and enhance competence retention. It is relevant to two audiences as follows: Training analysts can use the outputs of CRA during the Training Needs Analysis (TNA) process to justify training solutions and the training budget; and Training designers can use the outputs of CRA during the design phase to inform the scheduling of refresher training or practice intervals, and during the development of training to mitigate knowledge and skills fade. CRA can also be used retrospectively to improve training design and to inform decision making about the specification of training priorities (initial and refresher), where issues are identified during the TNA evaluation process."
  },
  {
    "id": "b9e2e432-7024-4b7a-a78f-722333fba93d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.8.3 Competence Retention Analysis Handbook.",
    "content": "Link: Competence Retention Analysis Handbook"
  },
  {
    "id": "1b4b773e-a0a3-417a-942d-3a4db23a1b93",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6.1 Introduction",
    "content": "1. The purpose of the TGA is to identify the additional training requirement of the affected Role holders by determining the training gap between the Performance as stated in the Role PS / Framework(s), and any existing training Performance Standard(s). This analysis also enables the impact upon Defence capability to be assessed if the new or changed Defence capability is implemented without additional training. The TGA should provide: a. an update of the information contained in the Scoping Exercise Report and RA (if required). b. the additional learning requirements, if any, of the Role holders in terms of KSA at the sub-task and task-element levels."
  },
  {
    "id": "24ed5809-a90e-4d20-a9b8-b68c15431e89",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6.1 Introduction",
    "content": "c. a summary statement of the tasks identified for training. d. statements of Training Gaps24, in terms of any Performance delta, between the requirements of the Role PS / Framework(s) and any existing TOs. e. The decision whether to provide additional training or not, by providing a summary of the implications of the new Performance requirements when compared to existing training. This should be presented as statements for each task, identifying additional workplace and unit training requirements with a statement of any associated penalties regarding reduction in capability. If the option to continue existing training with existing resources is an acceptable risk for all Role PS identified in the RA, then the TNA is complete and a TOA may not be required."
  },
  {
    "id": "33d009dd-8cf5-4faa-88f0-021d6677d676",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6.1 Introduction",
    "content": "f. Whilst the TNA is designed to look at the gap that cannot be delivered by existing training, it should also consider the resource implications on existing training activities and the ability of those Training Providers to deliver in respect of a change in training throughput."
  },
  {
    "id": "59a0d7d8-61ab-46d7-9f0f-eada21b7d822",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "6.2 Statement of Training Gaps",
    "content": "2. These are statements in terms of the Performance delta between the requirements of the Role PS / Framework(s) and any existing TOs and EOs, including associated specialist qualifications, for each affected Role holder. These gaps represent the impact on the training requirement for the continuation of existing training using existing resources."
  },
  {
    "id": "f8a80973-53f7-4152-a7a4-9ca0fe861b8a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "7 Training Objectives",
    "content": "1. TOs ensure that the training activity has a definite purpose such that the Defence need is met. They help ensure that the associated trainers, support staff and trainees have a clear understanding of what the trainees are required to learn and to be able to do at the end of the lesson/learning event. TOs form the basis of the detailed design of each of the training lessons as well as identification of appropriate training resources. They may also be used in support of the award of civilian accreditation. Therefore, the development and maintenance of accurate TOs is essential. TOs are drafted during Element 1 and then these draft TOs should be further refined and developed during Element 2 (Design). 2. TOs are precise statements of what tasks a trainee should be able to do, post training, in the Role that the training was designed to prepare them for. A TO is measurable and has three constituents: the Performance required, the Conditions under which the trainee must perform, and the Standard to which the trainee must perform. These statements should be in the form of observable and measurable behaviours which allow the achievement of the TOs to be confirmed through assessment. A TO defines what a successful trainee is able to do at the end of a period of training, i.e. the learning outcome25. It does not describe the learning process or any learning experience. 3. TOs should be derived from the respective Role PS / Framework(s). The determination of TOs is a skilled process and the product must accurately reflect the needs of the Role. The production of TOs may be an iterative process and should be reviewed at each stage of the design process."
  },
  {
    "id": "0787b5fc-d5ae-49ac-989b-27152f708d68",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "7 Training Objectives",
    "content": "4. The three component parts of a TO are summarised in Table 9: Individual Training Objectives (three part format) Performance"
  },
  {
    "id": "1fca0614-65fd-4d86-bae9-cb5344f1d7c4",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "7 Training Objectives",
    "content": "Conditions Standard What the trainee should be able to Do after training..."
  },
  {
    "id": "b59a8825-4971-4a5c-b909-3ed33f2dd6e8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "7 Training Objectives",
    "content": "Use an observable and measurable action verb with What and Where... Specify the circumstances of the Performance"
  },
  {
    "id": "668aafe1-d123-4dfd-aea3-16c107d86d9c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "7 Training Objectives",
    "content": "and How well. State the Standard to be achieved for the Performance Table 8: Individual Training Objectives (Performance, Conditions, Standards)"
  },
  {
    "id": "dc38f16d-3d3f-4d42-a064-39490bd9df73",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "25 A lesson, series of lessons, a course, exercise, or training activity.",
    "content": "5. Performance. The Performance (and sub-Performance) element of a TO states what a trainee should be able to do at the end of training and should be derived26 from the task (stated in the Role PS / Competence Framework) and therefore has an active verb as the first word in the performance element. When writing a TO performance for a task, the wording may need to be adjusted: a. if the task wording is not precise b. if the task has more than one objective."
  },
  {
    "id": "4cca031b-364f-4257-a0cb-9db7cfc92cba",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "25 A lesson, series of lessons, a course, exercise, or training activity.",
    "content": "c. to make the Performance absolutely clear to any reader. 6. The choice of verb for the Performance element of the TO is critical. To ensure the trainee has achieved the desired behaviour, a response must be witnessed. Performance elements need to use action verbs27. 7. Conditions. The Conditions element of a TO, specifies the actual Conditions, or circumstances, in which the training Performance will take place. In training, the ideal solution is to provide the same Conditions normally experienced in the Role, e.g. using the real equipment. As this is not always possible, the Conditions element must clearly indicate what the training environment can provide. The Conditions element should fully describe the environment in which the trainee should carry out the task. Conditions can be considered in these broad categories:"
  },
  {
    "id": "4c10b8ef-69cb-4e1a-b787-7a32a679b26c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "25 A lesson, series of lessons, a course, exercise, or training activity.",
    "content": "a. Limitations to the range of Performance. Such as, security, safety or legislative. b. Equipment. Such as tools, role aids, clothing, equipment. c. General situation. Indication of location, terrain, weather, daylight, climate, the threat, psychological, physical and social factors under which the training Performance is delivered should be detailed."
  },
  {
    "id": "cb8ce341-ba4e-4ff1-953c-aac7303f480d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "25 A lesson, series of lessons, a course, exercise, or training activity.",
    "content": "d. Support. People, agencies, orders, standard and emergency operating procedures, manuals, references, check lists etc that are available to the trainee. 8. Standards. The Standards element specifies the Standard that should be achieved by the trainee at the end of training. This should be related as far as possible to the Standard required in the Role. The Standards must be detailed enough to accurately assess if a trainee has achieved the Standard or not. Regarding the Role PS, Standards can either be product Standards (minimum absolute Standards) or process Standards (certain procedures that need to be followed in a particular sequence) or a mixture of the two. 9. Determining the Standard of Performance required for all training environments is difficult. The nature of the Performance (which could be dangerous, critical, or an emergency task), the consequence of not meeting the Standard and/or the training category should be considered. The Standard required will ultimately affect how that Performance is"
  },
  {
    "id": "41688625-909c-4c85-bb3a-a7ad3b1294f9",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "27 Verbs such as  know  or  understand  do not adequately define an action on the part of the trainee and are not observable or measurable.  Diagnose ,  assess ,  select ,  identify ,  distinguish  are much more readily witnessed and can be assessed more easily.",
    "content": "taught and how the trainee is assessed. For example, if a very high Standard is required, the trainee will receive a large amount of training for the Performance (creating the possibility of becoming over-trained) and may be subject to strict assessment, such as no mistakes. The Standard should be accurate. Some Performances may be subject to external rules and regulations, i.e. the Standard is dictated such as28: a. Health and Safety. b. Nuclear."
  },
  {
    "id": "0736d708-fddb-4b81-99f7-6c46ece13346",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "27 Verbs such as  know  or  understand  do not adequately define an action on the part of the trainee and are not observable or measurable.  Diagnose ,  assess ,  select ,  identify ,  distinguish  are much more readily witnessed and can be assessed more easily.",
    "content": "c. Weapons handling. d. Flying regulations (such as Civil Aviation Authority). e. Legal requirements, both national and international."
  },
  {
    "id": "3d43fae0-1d87-4d8e-b37a-a6ff4e458c66",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "27 Verbs such as  know  or  understand  do not adequately define an action on the part of the trainee and are not observable or measurable.  Diagnose ,  assess ,  select ,  identify ,  distinguish  are much more readily witnessed and can be assessed more easily.",
    "content": "10. Any restrictions in Conditions may impact on the Standards. Differences may occur if the Standard cannot be achieved because the Conditions cannot be simulated. Standards in TOs should not be confused with the standards of tests. Whilst test standards should be set as closely as possible to those stated against the TO, there are certain areas where compromise may be necessary when setting test standards. 11. The identification of Standards relating to personal qualities, attitudes and behaviours is perhaps the most challenging part of TO development. This is because attitudes cannot be observed directly and hence the precision associated with other Standards is rarely possible. For subjective judgements objective criteria should, where possible, be used to support the decision (e.g. what observable behaviour is the key indicator that a trainee has acquired the appropriate Standard?). Defining the negative, what is unacceptable behaviour, can result in a simpler and more precise Standard. 12. TO Tagging and Numbering. TOs should be tagged to identify them as a Core (training) requirement, Legal requirement and/or Accreditation requirement, which is denoted using a letter (C, L, A) or a mark in the relevant column on the training statements with amplifying comments if appropriate. To ensure that training is allocated to all tasks, the link between tasks and TOs should be shown through an auditable numbering/identification system. This can be achieved by using the task numbers from the Role PS to identify their dependent TOs. An example is at Table 10."
  },
  {
    "id": "030a2cf0-c8ee-4245-af41-8a51631b4573",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "27 Verbs such as  know  or  understand  do not adequately define an action on the part of the trainee and are not observable or measurable.  Diagnose ,  assess ,  select ,  identify ,  distinguish  are much more readily witnessed and can be assessed more easily.",
    "content": "Original task number: 2.1 Single TO derived from one task:"
  },
  {
    "id": "a33215d0-fe6f-472f-ac78-c1c0a3771a38",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "27 Verbs such as  know  or  understand  do not adequately define an action on the part of the trainee and are not observable or measurable.  Diagnose ,  assess ,  select ,  identify ,  distinguish  are much more readily witnessed and can be assessed more easily.",
    "content": "TO 2.1 Multiple TOs derived from one task: TO 2.1a TO 2.1b"
  },
  {
    "id": "bccf89b2-6cca-4bb6-ae2b-d6a41706ac2b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "27 Verbs such as  know  or  understand  do not adequately define an action on the part of the trainee and are not observable or measurable.  Diagnose ,  assess ,  select ,  identify ,  distinguish  are much more readily witnessed and can be assessed more easily.",
    "content": "Table 9: Task Numbering System"
  },
  {
    "id": "b2549793-3c52-4d83-9105-644de8a342ce",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8.1 Introduction",
    "content": "1. The TOA should primarily make a recommendation as to a cost-effective training solution that meets the identified tasks or competences that require training. The TOA should comprise of a Fidelity Analysis29, Location/Environment implications and Methods & Media options."
  },
  {
    "id": "f46acf23-b936-4f0e-b517-04fdbf0d626c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8.2 Fidelity Analysis",
    "content": "2. The term fidelity denotes how closely a set of procedures were implemented as they were supposed to have been30. Fidelity can be defined as, the exact correspondence with fact or with a given quality, condition, or event; accuracy (e.g. the fidelity of the movie to the book or the degree to which an electronic system accurately reproduces the sound or image of its input signal ). This analysis should be conducted as a result of the production of a Role PS derived from the RA and include any existing Training Performance Standards. Fidelity Analysis considers each relevant Performance objective in the Role PS to assess the extent to which the training environment should replicate the workplace (real) environment to enable training to be effective. Decisions made at this stage can have a significant impact on the nature and cost of training solutions, as fidelity can be a significant cost driver, so it is important not to gold plate the fidelity requirements, but instead determine the appropriate level of fidelity that is essential to achieve the desired training effect. The results of Fidelity Analysis will help inform the Conditions under which training should be conducted to adequately prepare trainees for their future Roles. 3. Categories. Fidelity can be divided into four categories and sub-categories, combinations of which may apply to each Role PS task / Competence / Competency being analysed."
  },
  {
    "id": "96fc65ee-8f65-4522-af7a-b7c2aeb120f3",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "30 For example, if the Role conducted in the workplace environment (the real world) must be done at 100%, and the training environment can only replicate the workplace environment to 89%, then that is the fidelity to which the training requirement matches the role requirement. It is not to be confused with Gap Analysis, as fidelity is about replicating the totality of the real environment in training, rather than seeking the gap between existing training and new/changed training requirements.",
    "content": "a. Physical fidelity. Physical fidelity can be useful to familiarise trainees with the visual, spatial and tactile characteristics of equipment, consoles, compartments, platforms and threats (including applicable reference manuals, Standing and Emergency Operating Procedures etc). Physical fidelity can be broken down into these sub-categories: (1) Layout. Position of the controls etc, relative to each other. (2) Look. Shape, colour, luminescence and size of interface."
  },
  {
    "id": "e34a9e1b-b6e6-454b-b4b0-096583689004",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "30 For example, if the Role conducted in the workplace environment (the real world) must be done at 100%, and the training environment can only replicate the workplace environment to 89%, then that is the fidelity to which the training requirement matches the role requirement. It is not to be confused with Gap Analysis, as fidelity is about replicating the totality of the real environment in training, rather than seeking the gap between existing training and new/changed training requirements.",
    "content": "(3) Feel. Feel and movement of the interface during use. b. Functional fidelity. Functional fidelity is useful in providing trainees with exposure to equipment functionality, doctrinal procedures, and maintenance routines which are required to be exploited in order to deliver the desired military effect. Functional fidelity can be broken down into these sub-categories: (1) Format. Format of data displayed, or action taken."
  },
  {
    "id": "02ea1c12-558f-4dfd-ba84-79b6cf0e8dd2",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "30 For example, if the Role conducted in the workplace environment (the real world) must be done at 100%, and the training environment can only replicate the workplace environment to 89%, then that is the fidelity to which the training requirement matches the role requirement. It is not to be confused with Gap Analysis, as fidelity is about replicating the totality of the real environment in training, rather than seeking the gap between existing training and new/changed training requirements.",
    "content": "(2) Content. Information displayed or heard, frequency, text colour etc. (3) Response. Data change rate and display response times. c. Environmental fidelity. Environmental fidelity can be useful in preparing or acclimatising trainees for the conditions they will be operating under and simulating some of the conditions that can hinder Performance. It can be easy to gold plate environmental fidelity requirements beyond what is essential to provide the necessary cues, stimuli and responses, but high levels of environmental fidelity can be beneficial in exposing trainees to complex operating environments and fog of war type issues. Environmental fidelity can be broken down into these sub-categories:"
  },
  {
    "id": "dc34acbf-ab95-447f-9a11-0454ac98c72f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "30 For example, if the Role conducted in the workplace environment (the real world) must be done at 100%, and the training environment can only replicate the workplace environment to 89%, then that is the fidelity to which the training requirement matches the role requirement. It is not to be confused with Gap Analysis, as fidelity is about replicating the totality of the real environment in training, rather than seeking the gap between existing training and new/changed training requirements.",
    "content": "(1) Sound. Background noise, conversation and sympathetic resonance. (2) Motion. Incidental movement of the system, equipment or platform. (3) Ambience. Heat, light, smell, smoke, humidity etc."
  },
  {
    "id": "18bdf514-1425-4e70-977d-fdfb0370c359",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "30 For example, if the Role conducted in the workplace environment (the real world) must be done at 100%, and the training environment can only replicate the workplace environment to 89%, then that is the fidelity to which the training requirement matches the role requirement. It is not to be confused with Gap Analysis, as fidelity is about replicating the totality of the real environment in training, rather than seeking the gap between existing training and new/changed training requirements.",
    "content": "(4) Geographic features. Effects on sensors, infrastructure, SOPs etc. d. Tactical and cultural31 fidelity. Tactical and cultural fidelity will help identify requirements that enable individuals and teams to train as they intend to operate. Exposing trainees to the types of units, threats, allies (including neutral or white forces), cultural issues and geographical locations that they will experience on operations, can also be used for mission rehearsal training or tactical development. Modern training technology, particularly simulation, enables accurate representations to be included in training quickly and cheaply. Tactical and cultural fidelity can be broken down into these sub-categories:"
  },
  {
    "id": "7df94a95-349a-47ca-9d8a-ed637c29f64f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "31 To succeed on many operations, UK Armed Forces will need to understand and interpret the nuances of local cultures with and within which they will be operating. Introducing cultural elements into training will be essential in many cases - Future Operating Environment 2035, Development, Concepts and Doctrine Centre, 2015.",
    "content": "(1) Threats. Enemy characteristics (number, tactics, equipment etc). (2) Allies/Neutrals. Allied and neutral forces characteristics (number, tactics, equipment, culture etc). (3) Conflict character and location. Type of operation, presence of media and/or Very Important Persons (VIPs), cultural/religious behaviours, historical implications, infrastructure and building implications etc."
  },
  {
    "id": "e15c5bc7-96c8-4276-a381-02d281e0ee04",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "31 To succeed on many operations, UK Armed Forces will need to understand and interpret the nuances of local cultures with and within which they will be operating. Introducing cultural elements into training will be essential in many cases - Future Operating Environment 2035, Development, Concepts and Doctrine Centre, 2015.",
    "content": "(4) Team interactions. Command and control (C2) relationships, communications, situational awareness. Fidelity Requirements 4. Task and sub-task level. Every relevant task contained in the Role PS / Competence Framework should be analysed for its respective Fidelity requirements, based on the applicable fidelity categories. Depending on the complexity of the capability involved, it may be necessary to articulate fidelity requirements at the sub-task level if those stated at the task level do not adequately capture the relevant fidelity criteria details."
  },
  {
    "id": "6d141ffe-d306-4458-be9c-619a422e6e10",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "31 To succeed on many operations, UK Armed Forces will need to understand and interpret the nuances of local cultures with and within which they will be operating. Introducing cultural elements into training will be essential in many cases - Future Operating Environment 2035, Development, Concepts and Doctrine Centre, 2015.",
    "content": "5. Team/collective performance. Analysts should also consider the fidelity requirements of any team/collective Performance criteria that have been established in support of the new or revised capability, to contextualise the individual training need. 6. Fidelity factor levels. Table 11 defines 4 levels against which each of the fidelity sub-categories can be measured for each task/sub-task. However, analysts should not state fidelity requirements simply as high, medium, low, none as this is unquantifiable and gives no meaningful guidance to designers of the eventual training solution. Users should also include specifics of the fidelity requirements for each Performance criteria within each applicable category and sub-category. Factor"
  },
  {
    "id": "5bbbe4a5-92ed-4f1b-94a5-b565fac2a6b4",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "31 To succeed on many operations, UK Armed Forces will need to understand and interpret the nuances of local cultures with and within which they will be operating. Introducing cultural elements into training will be essential in many cases - Future Operating Environment 2035, Development, Concepts and Doctrine Centre, 2015.",
    "content": "Indicator Definition Impact"
  },
  {
    "id": "5a839d8e-5025-4193-9f24-0b2f8f66aa7c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "31 To succeed on many operations, UK Armed Forces will need to understand and interpret the nuances of local cultures with and within which they will be operating. Introducing cultural elements into training will be essential in many cases - Future Operating Environment 2035, Development, Concepts and Doctrine Centre, 2015.",
    "content": "0 None Not applicable"
  },
  {
    "id": "5a06e8f5-6535-4245-9b8a-34a8d72382bd",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "31 To succeed on many operations, UK Armed Forces will need to understand and interpret the nuances of local cultures with and within which they will be operating. Introducing cultural elements into training will be essential in many cases - Future Operating Environment 2035, Development, Concepts and Doctrine Centre, 2015.",
    "content": "Has no impact on training 1 Low"
  },
  {
    "id": "0da6e43d-db5c-46d5-874c-211c3f6e7c88",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "31 To succeed on many operations, UK Armed Forces will need to understand and interpret the nuances of local cultures with and within which they will be operating. Introducing cultural elements into training will be essential in many cases - Future Operating Environment 2035, Development, Concepts and Doctrine Centre, 2015.",
    "content": "Replication not important Little impact would be made on training except to add realism 2"
  },
  {
    "id": "0ed379ca-a1ae-46ff-bc39-9dd5bd9b870f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "31 To succeed on many operations, UK Armed Forces will need to understand and interpret the nuances of local cultures with and within which they will be operating. Introducing cultural elements into training will be essential in many cases - Future Operating Environment 2035, Development, Concepts and Doctrine Centre, 2015.",
    "content": "Medium Replication moderately important Significant impact would be made on the training. The task contains elements which requires exact replication"
  },
  {
    "id": "183c5fe7-9830-43bc-a070-8bd1fe900a14",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "31 To succeed on many operations, UK Armed Forces will need to understand and interpret the nuances of local cultures with and within which they will be operating. Introducing cultural elements into training will be essential in many cases - Future Operating Environment 2035, Development, Concepts and Doctrine Centre, 2015.",
    "content": "3 High Exact replication important"
  },
  {
    "id": "cbb698f6-3314-497b-ac3e-6fe007a4b9f1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "31 To succeed on many operations, UK Armed Forces will need to understand and interpret the nuances of local cultures with and within which they will be operating. Introducing cultural elements into training will be essential in many cases - Future Operating Environment 2035, Development, Concepts and Doctrine Centre, 2015.",
    "content": "Has a significant impact and is essential to training Table 10: Levels of Fidelity"
  },
  {
    "id": "4828b29e-1aac-45d0-abe6-ee8891ef1ef1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8.3 Location / Environment Implications",
    "content": "7. The training environment and implications of location for each training solution may well require analysis at this stage. For example, constraints on training resources and the availability of real equipment for training may force the emphasis towards workplace training. The same would be true if it is not possible to replicate critical Role PS Conditions in training establishments or via distributed training. Alternatively expensive and scarce training equipment or qualified trainers may only be available in [some] training establishments. It is therefore important to determine an estimate of where the balance between training to be delivered in a training establishment and workplace training will fall. It is based on a careful analysis of exactly what the TRA requires, tempered by that which is deliverable and can only be achieved by consultation with the TRA and the Training Provider, who will have knowledge of existing training and current training facilities and resources. This will later result in the allocation of TOs to a TPS, WTS, or, where no training will take place, the Performance, Conditions and Standards to a RTGS32. The output from this work could be an amendment to the Initial Training Categories or recommendations that take account of both DIF Analysis results and the impact of all other Role, training and resource factors."
  },
  {
    "id": "8eafcde1-60e3-4230-b1ec-498af79f5a63",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8.4 Methods and Media Options",
    "content": "8. Methods and Media Options. It is important to consider the most appropriate and effective blend of training Methods & Media options that provides the most effective balance of performance, cost and time in achieving the required KSA. These options should be further refined as part of the Design process by exploring, in order: a. Methods. These are the strategies or techniques used to achieve the required KSA. b. Media. These are the tools and means used to apply the Methods selected."
  },
  {
    "id": "f343c65c-c852-462a-8732-70d623e98774",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "32 Which all form parts of the FTS. These are covered in Element 2 (Design, 2.2).",
    "content": "FACTORS TO BE CONSIDERED WHEN DETERMINING THE TRAINING EFFECTIVENESS OF DIFFERENT METHODS Learning factors. 9. Type of learning. The Method used to deliver training depends on whether learning is categorised as Knowledge, a mental or physical Skill, or an Attitude. Each EO must be examined to determine whether it is primarily expressed as a KSA. This will suggest the appropriate choice of Method (e.g. a Skills-based EO must have some element of practice involved in the Method; whilst role-play is an example of a training Method suitable for a Behaviour-based EO). The aim must be to choose a Method that is compatible with the material to be learned. Learning a physical Skill may require equipment and machinery and a low trainee-to-trainer ratio as it tends to be trainee-centric. Knowledge learning is most effective and efficient via e-learning, in the form of a lecture, or with links to information. This works best in a flipped classroom, where learning is then consolidated through discussion."
  },
  {
    "id": "e3eecab7-a03a-4518-8445-6da9baec0a99",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "32 Which all form parts of the FTS. These are covered in Element 2 (Design, 2.2).",
    "content": "10. Retention ability. A basic categorisation of training Methods should state that these can either be trainer or learner centric. The appropriate selection of training Methods improves the effectiveness and efficiency of learning. Wherever possible, a learner-focused approach should be adopted although this is not always as simple as it seems as it can be time consuming and resource heavy. A learner-focused approach aids information retention by considering the needs of the trainees and increasing their involvement in the learning process. A trainer-focused approach, whilst increasing trainee-to-trainer ratios, is not as effective for aiding trainee retention. The more active the trainee is in the learning process, the higher the rate of retention. 11. Learning preferences. Learning takes place when learners reflect on what they have done, or from what others have done. Therefore, it is imperative that for the effective and efficient acquisition of the required KSA, time is built into the programme, to facilitate learning through reflection. People learn from reflecting on their own, or others experience. Therefore, enabling experiential learning is the most effective and efficient way of enabling learning. Trainee characteristics."
  },
  {
    "id": "65743735-d0f0-4364-9d8b-6aa2c7bdbd76",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "32 Which all form parts of the FTS. These are covered in Element 2 (Design, 2.2).",
    "content": "12. Motivation. Learners are motivated to learn when they know the relevance of the learning, and when they are enabled to learn through a learner-centric way. For knowledge acquisition, motivation best comes through a flipped classroom, where the learners are required to access the learning (through e-learning for example) before they consolidate and reflect on what they have learnt, in the classroom. 13. Literacy level. Information should only be presented to learners in a form they can cope with. Information should not be at a level that they cannot comprehend, nor should it be at a level which will patronise. Key questions should include What is the literacy level of the trainees? and What is the most appropriate language for passing information? 14. Numbers. How many trainees should there be in each group? A large group will make trainer demonstrations difficult to plan. A small group will limit trainee discussions and peer learning."
  },
  {
    "id": "1d96ddcd-997e-4c80-961e-ebcc36116325",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "32 Which all form parts of the FTS. These are covered in Element 2 (Design, 2.2).",
    "content": "Practical constraints. 15. Facilities and resource availability are likely to limit the choice of Method and the most appropriate Media are not always practical or within budget. The medium may be unavailable; there may not be time to meet all the TOs; it may be difficult logistically or financially; or the group may be of mixed ability and unable to make the best use of the Media selected. Where resources to support the optimum training Method are not available, lack of availability is likely to affect the successful achievement of the TOs. Such constraints should be captured in the Constraints Analysis and/or the Risk Register. The TRA and Customer should be advised of this fact and made aware of the likely consequences. Trainer attitude and ability."
  },
  {
    "id": "ece6654b-89db-4668-8bcf-65ea3e9a3747",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "32 Which all form parts of the FTS. These are covered in Element 2 (Design, 2.2).",
    "content": "16. A question that will need to be asked is: can, or will, the trainers be able to use the Media selected? Trainers are unlikely to use Media that they do not understand, which increases their workload, or which is complex to manage. If new teaching Methods are to be introduced, then due regard must be given to ensuring that trainers are both willing and able to cope. To avoid such issues designers should: a. involve trainers in the Design process as early as possible. b. identify any additional trainer training requirements."
  },
  {
    "id": "91257987-a183-406c-863d-bea997f0dc31",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "32 Which all form parts of the FTS. These are covered in Element 2 (Design, 2.2).",
    "content": "c. develop a trainer training strategy to enable trainers to explore new technologies followed by localised CPD activity to ensure awareness is maintained on TEL developments, including opportunities for TEL exploitation; as a minimum, trainers should be able to facilitate learning using the DLE. Training designers. 17. Training designers should maintain awareness of emergent TEL and have a working knowledge of the DLE as a minimum. The requirement to design training to meet the needs of different types of learners, including skill fade and learner-centric approaches in an increasing resource constraint environment places the training designer at the centre of the training design process. Training Providers and 3rd Party Contractors will need to ensure their training designers are provided with sufficient training, expertise and resources in order to design training to meet the needs of Defence. The TDA should ensure the following:"
  },
  {
    "id": "88b12885-00d7-42c8-bb69-860f308faf71",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "32 Which all form parts of the FTS. These are covered in Element 2 (Design, 2.2).",
    "content": "a. Liaison with the DLE Subcategory Manager for potential DLE inclusion. b. Creation of a DLE front page for every course iteration. c. For any NTS training design, key training design personnel should be invited to the TNA WG during TOA and TNR stage to plan for TEL interventions."
  },
  {
    "id": "fab6055e-9db8-47ef-9189-404e957626fd",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "32 Which all form parts of the FTS. These are covered in Element 2 (Design, 2.2).",
    "content": "d. Training Providers/3rd Party Contractors to develop a training designer training strategy and plan to enable training designers to intelligently utilise TEL to facilitate a blended learning approach as to optimise efficiencies. This should be followed by ongoing coaching CPD to ensure training designers maintain TEL and blended learning currency. e. Where applicable, ensure that Training Providers /3rd Party Contractors training designers are provided with OEM Train the Trainer (TtT) training prior to RFTD for all NTS capabilities. f. Ensure the training designers are provided with all OEM TEL training documentation (hardcopy, electronic (Word, PDF, Interactive Electronic Training Manuals/Publications (IETM/Ps), media prior to any training design."
  },
  {
    "id": "335ab233-293d-4ad4-8158-fbaeea619203",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "32 Which all form parts of the FTS. These are covered in Element 2 (Design, 2.2).",
    "content": "g. Develop a trainer training strategy to enable trainers to explore new technologies followed by localised CPD activity to ensure awareness is maintained on TEL developments, including opportunities for TEL exploitation. As a minimum, trainers should be able to facilitate learning using the DLE. Time availability. 18. Care should be taken to avoid false economies. A lecture may seem to be an attractive option for passing large amounts of information in a relatively short time, but the information received by the trainees may be processed at only the most superficial level. This is why lectures should be front-loaded into a flipped classroom."
  },
  {
    "id": "43d055d1-b7aa-4558-b894-1e78087f5bbb",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "32 Which all form parts of the FTS. These are covered in Element 2 (Design, 2.2).",
    "content": "Need for transfer of learning. 19. Apart from some types of workplace training, the training environment will differ to some extent from the work environment. It is therefore important that the training Method chosen should minimise this difference to make the transfer of KSA from the training environment to the work environment as easy as possible. Priority of learning."
  },
  {
    "id": "62282365-cd9f-4aee-8640-e1cdda29eb3a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "32 Which all form parts of the FTS. These are covered in Element 2 (Design, 2.2).",
    "content": "20. It is unlikely that the various subjects to be trained will all be of equal importance to the trainees in their future Role. Some Skills may be used on a daily basis while others may be only used sporadically but, when they are used, are essential. This requires Performance to be maintained at a consistently high Standard. The results of the DIF Analysis (1.3.3), the consideration of skill fade factors and/or the analysis of Critical Errors (1.3.3B) may have a significant influence on the Method selection. In subjects where the possibility of skill fade could have dire consequences, consideration must be given to ensuring that appropriate Methods & Media are implemented to enhance retention. This may or may not require the allocation of extra training time. THE DIFFERENT CHARACTERISTICS OF MEDIA Variety of Media."
  },
  {
    "id": "5e383858-78be-4829-b238-3cc994611136",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "32 Which all form parts of the FTS. These are covered in Element 2 (Design, 2.2).",
    "content": "21. Consideration should be given to the characteristics of Media, in terms of whether they are essential or optional: a. Essential Media characteristics. Essential Media characteristics control the clarity of the message. For example, learning a foreign vocabulary requires print (to recognise words) and audio Media (to pronounce them). Training designers should consider: (1) media that is appropriate to deliver the desired learning outcomes."
  },
  {
    "id": "0220588e-b578-4d5b-a3cd-c6a59093da59",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "32 Which all form parts of the FTS. These are covered in Element 2 (Design, 2.2).",
    "content": "(2) media that provides an appropriate level of fidelity. (3) media that can cope with trainee throughput. b. Optional Media characteristics. Optional Media characteristics improve the quality of the training. There are some considerations that can influence selection:"
  },
  {
    "id": "02813285-7fb0-43fb-9b39-85265469dbc8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "32 Which all form parts of the FTS. These are covered in Element 2 (Design, 2.2).",
    "content": "(1) attractiveness to the learner: colour, animation, illustration. (2) the trainees study habits. (3) the trainers style, habits and Skills."
  },
  {
    "id": "3fc20cb0-97f3-4beb-ada5-50b09516272c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "32 Which all form parts of the FTS. These are covered in Element 2 (Design, 2.2).",
    "content": "(4) media that, from experience and research, improves learning efficiency. (5) media that allows the efficient management of training. (6) media that has low risk of failure (for whatever reason)."
  },
  {
    "id": "4ba0473f-85b2-419c-8205-fc9d53754083",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8.5 Cost Benefit Analysis",
    "content": "22. In accordance with Defence and HM Treasury guidelines, an examination of the broad order costs of various options to recommend the most cost-effective training solution must be undertaken. It is important that costing and investment appraisal are undertaken strictly in accordance with the current Defence and Service or Strategic Command policies and conventions. If training specialists become involved with costing or investment appraisal, they should obtain current advice from the TNASG or other authoritative body. CBA activity does not start at this stage of the TNA but the result of it is included in the Training Needs Report hence its inclusion here. Like many aspects of DSAT, CBA is an iterative process with initial activity commencing much earlier in the TNA process, as appropriate. The CBA will likely be further refined during the Method & Media selection process in Element 2 (Design). An estimate of the financial risks and/or opportunities associated with each training solution option should be undertaken. Training staffs are unlikely to be qualified to conduct financial risk analysis at anything other than a superficial level33. However, these analyses will be a significant factor in selecting training solution options."
  },
  {
    "id": "5a67dbb0-c6f2-40ed-afd3-4f22fbfd39bf",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8.6 Options Evaluation",
    "content": "23. The final activity of the TNA is to decide on training options. To evaluate the merits of the training locations and/or environments one of them should be selected as a baseline option. The selection of a baseline will depend on the context, which then permits the construction of a table to display the relative merits of each option against the baseline. Options can be assessed via several criteria: a. The extent to which the option meets the requirements. b. Through-life cost 34 , including the costs of maintenance, trainers and integration with existing training locations/environments."
  },
  {
    "id": "34441d4c-f7f1-425a-be2f-fd4ac3d55f69",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8.6 Options Evaluation",
    "content": "c. Implementation time, which may prove important to meet an operational need or a RFTD. d. Trainer load, or any consideration of the availability and competence of trainers to support training. e. An assessment of the risk35 associated with the options."
  },
  {
    "id": "3a89c72c-ed69-44e4-94ef-ddd2fcb0347c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8.6 Options Evaluation",
    "content": "f. Flexibility, or the ease with which the new training can be integrated with existing and potential future training, as appropriate. 24. It will typically be appropriate for the options evaluation to be undertaken in consultation with SMEs before presentation to the TNASG for endorsement. Table 12 provides an example format: Option"
  },
  {
    "id": "724cc57c-cb5c-4d62-a609-79ad8d2fdb04",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8.6 Options Evaluation",
    "content": "Meets the requirement Through- life Cost Implementation time"
  },
  {
    "id": "1ecdb468-92e0-401a-b1ff-bc0aa211e34b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8.6 Options Evaluation",
    "content": "Trainer load Risk Flexibility"
  },
  {
    "id": "6f88e2a3-d735-4f45-80a0-8a0cf3409ff8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8.6 Options Evaluation",
    "content": "Option 1 (baseline) Option 2 Option 3"
  },
  {
    "id": "2787f6bb-c5dc-4bba-bf93-a3b8547f1e68",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8.6 Options Evaluation",
    "content": "Table 11: Example of an Options Evaluation Table"
  },
  {
    "id": "3b9a4ead-b3e9-4193-b7cc-e7b5388dae2e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8.7.1 Guidebook of Decision Support Tools for Training Design and Delivery: Part 7",
    "content": "- Fidelity Analysis This guidebook is intended to support staff in the MOD, and contractors working for the MOD, in the challenges faced in understanding the effectiveness of training prior to it being delivered. The aim of the Guidebook is to review the range of tools, methods and approaches that is available and recommend the most suitable approach. Part 7 of the handbook provides checklists for training fidelity and instructional features to assist the training designer."
  },
  {
    "id": "59fbd426-a84c-4b80-9190-4c19bda3977e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "8.7.1 Guidebook of Decision Support Tools for Training Design and Delivery: Part 7",
    "content": "Link: Guidebook of Decision Support Tools for Training Design and Delivery Part 7 Fidelity Analysis"
  },
  {
    "id": "6c8e2483-b306-4c24-906b-31ade04269b1",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "9 Training Needs Report",
    "content": "1. The Training Needs Report specifies the training requirement and recommends a training solution through the evaluation of options. It should include the resources required to design and support the training. Training Needs Reports should collate all the information from the scoping exercise and analyses stages, adding an Implementation Plan and TNE strategy. It should also include a description of the TNA methodology in terms of the data gathering and analysis techniques and clearly reference the data sources consulted. The TNA can then be written up as a Training Needs Report that provides or supports detailed user and system requirements. Training Needs Reports should include: a. Identification of the Performance requirement: a Role PS / Framework(s) for each Role holder, as identified in the RA. b. Identification of the training requirement: the results of the TGA."
  },
  {
    "id": "2e1a88c4-78e6-418d-bbfe-2158ffcb4a4a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "9 Training Needs Report",
    "content": "c. A Role PS and/or Framework(s) for the Role(s) affected by the recommended training solution with recommended training categories and supportive notes to amplify specific requirements to be included as appropriate to assist designers with the production of the FTS. d. Implementation plan, including where responsibilities lie (e.g. conversion training, date of new legislation and/or policy change, and design). At this stage the draft TOs endorsed by the TNASG should be available and expressed as Performance, Conditions and Standards to enable implementation by the design team. Any recommendation regarding estimation of resources, timings and assessments should be clearly referenced to aid the design team. e. Input to inform or refine the SOTR (for formal endorsement), to focus and direct the design stages."
  },
  {
    "id": "0565d502-f0e4-4056-8060-282dc74b00fd",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "9 Training Needs Report",
    "content": "f. TNE strategy. g. The TNASG endorsed training solution, resulting from the CBA and final selection using the Options Evaluation. Fidelity requirements and associated risks, assumptions, constraints should be included in the Report."
  },
  {
    "id": "ba4f1849-65a2-4f4a-a250-e8668db403f0",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10 Annexes",
    "content": "A - Initial KSA Analysis (KSA) Example B - Role Performance Statement (Role PS) Example C Fidelity Analysis Example"
  },
  {
    "id": "d4693a74-8860-41c8-a212-110d73bc4a48",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "10 Annexes",
    "content": "ANNEX A TO DTSM 2"
  },
  {
    "id": "89bb8f2a-12ee-44c0-884a-545a2d1cde68",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "Initial KSA Analysis (KSA) Example PDF / WORD Formats ROLE TITLE"
  },
  {
    "id": "e93b0523-5c80-465b-b71c-9e20034909e8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "Motivational Outreach Team (MOT) ID NUMBER TRA"
  },
  {
    "id": "8812d8f1-5798-4340-b1de-61ac6d9ce6e4",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "Inspectorate of Recruiting ROLE PS NUMBER 123/01"
  },
  {
    "id": "fc5a08cf-4a96-41ff-8c93-ab6d6e171338",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "TDA ISSUE STATUS V1-00"
  },
  {
    "id": "d3263ee6-90b1-4d82-9787-b675ac0414b3",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "Performance (number) TASK Underpinning Knowledge"
  },
  {
    "id": "c26793fd-6696-43d0-b4b3-56d2e902ff98",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "Skills Attitudes Attributes"
  },
  {
    "id": "d1ed85cd-ebc3-4112-86a0-0dc25f74a3cd",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "1 Advertise and market the RAF Knowledge of the RAF trades, branches, entry procedures and entry requirements"
  },
  {
    "id": "dc65befb-a6dc-42d1-8ce1-19d997719111",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "Ability to communicate effectively with members of the public; adjusting communication style depending on audience. With due regard for AP1 Ethos, Core Values and Standards"
  },
  {
    "id": "6854db2c-5002-4bbc-b6df-ce1e7838d23b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "With positivity, enthusiasm and tact. ROLE TITLE ID NUMBER"
  },
  {
    "id": "2fe174d5-e39f-4040-8f6f-333e62abcab9",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "TRA ROLE PS NUMBER TDA"
  },
  {
    "id": "0475f2f8-2970-40ca-ac30-3b09f01e8bdb",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "ISSUE STATUS Performance (number) TASK"
  },
  {
    "id": "0ee56276-df18-4de0-9f70-164a2b441051",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "Underpinning Knowledge Skills Attitudes"
  },
  {
    "id": "f8e0c6a6-7804-4e7a-b80d-5dc639412c01",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "Attributes 1 Conduct immediate aircrew actions"
  },
  {
    "id": "480ccf78-3328-4d26-aebb-edfabddf4ecd",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "Knowledge of SE, SSLR and MSLR (as necessary), content of survival kits and winchman procedure. Ability to apply sea survival procedures to reduce risk of exposure and drowning whilst awaiting rescue from SAR helicopter or boat. If SAR helicopter, there is a need to apply suitable procedures to assist a winchman With due regard to all safety and survival procedures within time constraints."
  },
  {
    "id": "001d1eac-04ae-4698-b2d6-62027dd7b618",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "Determination, confidence of own and team and ability. ANNEX B TO DTSM 2"
  },
  {
    "id": "962a47e7-9a87-4ee5-a9ce-07b3b7af2eeb",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "Role Performance Statement (Role PS) Example PDF / WORD Formats OFFICIAL"
  },
  {
    "id": "64debc5a-f93f-4de0-ba57-d9b8317b467e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "JOB NUMBER (S): 2008/JUL/001 ROLE TITLE(S):"
  },
  {
    "id": "1a657080-2e15-4251-96b3-38123e59d42a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "Weapon Technician Tradesmen For Initial Employment DUTY NUMBER: 13.0"
  },
  {
    "id": "02cf0e20-f7e1-45a2-9763-4b8b0970663b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "DUTY TITLE: Carry out Aircraft Area Based Maintenance RPS REFERENCE:"
  },
  {
    "id": "ec8ea4a3-52b4-49f0-acc0-2f90961e6ae0",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "76/09 TRA: Engineering Branch & Trades Sponsor"
  },
  {
    "id": "e0c95e8f-8cd7-4e71-8372-087f6d6f34b3",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "ISSUE STATUS: Version 3-00 Task/"
  },
  {
    "id": "8296d728-c3e8-497c-ac65-d95b05f1db6a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "Sub Task Number Performance Condition"
  },
  {
    "id": "341166b4-c8b5-4e71-ad40-916014b17ee3",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "Standard Training Category Notes"
  },
  {
    "id": "aeae17cd-c57f-4afe-bb74-9cd80dc53cfa",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "13.34 Carry out bomb 1. Work in all Theatres"
  },
  {
    "id": "17331c3b-2167-4038-85be-29a1b158c39a",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "1. MAP-01. 3 loading on"
  },
  {
    "id": "9228f712-63c2-4bbf-9f8c-69fa2a1d9992",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "In times of conflict aircraft. 2. During times of Peace, peace support"
  },
  {
    "id": "ce6167b8-b3fa-4f8f-b79a-645761910161",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "2. MAP-02. operations, peace enforcement operations, and transition to war"
  },
  {
    "id": "1c27631e-5a88-4122-a6dc-3fcdc2f736a5",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "3. JSP 375. 3. Work in extreme heat and cold 4. Work effectively while fatigued"
  },
  {
    "id": "abdbe00b-5469-486f-b980-ebe8ede05052",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "4. JSP 418. 5. In Chemical, Biological Radiological & Nuclear (CBRN) environment."
  },
  {
    "id": "f57d3433-c221-4728-b0ce-442b3094f83e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "5. DSA 03 - OME Part 2 - Defence 6. Working in hangers, Hardened Aircraft Code of Practice (DCOP) and"
  },
  {
    "id": "28ff9c49-2ad9-4091-86be-8574daba7a47",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "Shelters, Flight line. Guidance Material for In-Service and 7. Access to all relevant publications and"
  },
  {
    "id": "bb530dbd-2768-41d3-9612-bc6af5230710",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "Operational Safety Management of references. OME (Replaced JSP 482)"
  },
  {
    "id": "3f7e4444-67ec-443e-b14a-9b537e0a0b69",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "8. Access to all relevant equipment. 9. Access to all relevant tools. 6. DSA01.1 Defence Policy for Health,"
  },
  {
    "id": "fe5de59f-1430-40c4-bb58-8e31421d229d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "10. Access to all relevant spares. Safety and Environmental Protection. 7. AP100B-01."
  },
  {
    "id": "b14c42d8-4770-4910-bd22-6284d6faa5d8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "8. In accordance with all relevant aircraft Maintenance Manuals. 9. Tornado AP101B-4104-5A6A."
  },
  {
    "id": "a7835f32-4061-4e91-b412-45ab53b80970",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "10. Typhoon AP101B-5400-5A6A. ANNEX C TO DTSM 2"
  },
  {
    "id": "56cfeec6-c45f-49bc-ad1c-f5b64c53a6ec",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "2023 EDITION, V1.0",
    "content": "Fidelity Analysis Example PDF / WORD Formats Training Task"
  },
  {
    "id": "67260dbd-b689-4f24-9c99-3b608ca571a4",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3 Use FCC Controls",
    "content": "Sub-task (if applicable)"
  },
  {
    "id": "20c7ff2b-ea1a-4904-b26c-3792dfcbb130",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Physical Fidelity Requirements Subcategory Fidelity Factor"
  },
  {
    "id": "f3c8f5f2-ed7a-4128-9767-cbfa344dfb90",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Justification Layout 2"
  },
  {
    "id": "2cbc28d7-ce7c-4467-a739-2a1283a7023e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Controls and switches must be in the correct position in relation to the operator s position Look 1"
  },
  {
    "id": "86eaea2b-e694-49f6-a58f-243b9c2fa6af",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Actual feel of controls is not required for training Feel 1"
  },
  {
    "id": "60a21466-c7ec-4ac6-a455-bc4949b01998",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Appearance not important to training but spatial representation of the console is required Functional Fidelity Requirements Subcategory"
  },
  {
    "id": "c614c02e-b8e4-4d7b-89f1-0e618c7b8126",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Fidelity Factor Justification Format"
  },
  {
    "id": "8305d490-5bf4-43cb-bddd-5b887da815b6",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "3 Essential that data displayed is an accurate representation to provide the correct cues to the operator Content"
  },
  {
    "id": "0dfe2eb6-961d-4ef6-baab-0be4c04f915c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "3 Essential that the content of the data is accurate to ensure correct interpretation of the data Response"
  },
  {
    "id": "1f77ae12-82c6-41e5-bc2e-c0d236df44d2",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "3 Essential that response is exact to ensure correct identification of faults and interpretation of data Environmental Fidelity Requirements"
  },
  {
    "id": "b1d59529-561c-424f-9c73-9512a61d3456",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Subcategory Fidelity Factor Justification"
  },
  {
    "id": "5bc882f8-9883-4df2-b7e9-30fc48c37448",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Sound 1 Typical control room sounds would enhance realism"
  },
  {
    "id": "e238c337-426c-45db-86fc-e46c47caf07b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Motion 0 Not applicable"
  },
  {
    "id": "b30ec032-6bac-4b9d-ae9d-0184a270e620",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Ambience 0 Not applicable"
  },
  {
    "id": "f2a6a791-50ff-4cde-b88f-6e465386a4c5",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Geographic Areas 0 Not applicable"
  },
  {
    "id": "bcfe2320-8f43-4a1c-801c-bf091ed82ca3",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Tactical/Cultural Fidelity Requirements Subcategory Fidelity Factor"
  },
  {
    "id": "0a2c0209-0e57-455c-a10b-23ae2a749079",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Justification Threats 3"
  },
  {
    "id": "d6613fce-3da2-4049-963d-cb327f0762c7",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Essential that all threats be realistically portrayed Allies/Neutrals 3"
  },
  {
    "id": "96810c28-5c93-4862-8a25-53bf77240abe",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Essential that all Allies/Neutrals be realistically portrayed Conflict Character/ Location 1"
  },
  {
    "id": "cbced8a6-4663-46bb-95d1-55ad58061e8c",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Actual conflict character and location not important Team Interactions 2"
  },
  {
    "id": "f69be9c5-0578-4fad-8d68-cab046de0b2d",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Interaction with team through radio communications only Factor Indicator"
  },
  {
    "id": "a2c25bcc-5d63-4be3-950c-566b5646fd4b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Definition Impact 0"
  },
  {
    "id": "e940366b-ebcb-4812-b218-f8c08a3c5fa9",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "None Not applicable Has no impact on training"
  },
  {
    "id": "81d3be90-97e3-43b0-a4c5-07da965cbd1b",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "1 Low Replication not important"
  },
  {
    "id": "bf5464f5-7f92-46aa-ba5c-606009de5ba0",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Little impact would be made on training except to add realism 2 Medium"
  },
  {
    "id": "73e2ae85-e8e7-4ac7-b6e1-2a425f362f84",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "Replication moderately important Significant impact would be made on the training. The task contains elements which requires exact replication 3"
  },
  {
    "id": "4769bee8-332f-4a2b-a2a1-594da6c75166",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "5.3.3 Manually guides the weapon using the FCC controls and light pen to input guidance data for the weapon",
    "content": "High Exact replication important Has a significant impact and is essential to training"
  },
  {
    "id": "7a9e945d-3a16-4ef6-a433-39e7a9ef4688",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11.1 Document Coverage",
    "content": "This DTSM supersedes all previous DTSMs on Analysis of Individual Training The totality of DTSMs included in the DTSMs Suite, of which this document is a part, are listed on the DTSMs SharePoint site"
  },
  {
    "id": "76fb1b1b-1e4c-4354-a1c8-d3f5116349e8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11.2 Document Information",
    "content": "Filename: Analysis of Individual Training Document ID:"
  },
  {
    "id": "627b456b-5779-4402-9adc-1a62428b54e8",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11.2 Document Information",
    "content": "DTSM 2 Owning Function / Team: Talent, Skills, Learning and Development (TSLD)"
  },
  {
    "id": "cae8d4a7-71ce-4a8b-941a-d0983297b886",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11.2 Document Information",
    "content": "Service Owner (1*): People-TSLD-Hd OF6"
  },
  {
    "id": "82ac0530-7ff7-4744-9cc3-fcad7a671b85",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11.3 Document Editions / Versions",
    "content": "Edition Edition Version Publication Date"
  },
  {
    "id": "bb22e6ef-4805-40f8-967b-e5fa8e008f5e",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11.3 Document Editions / Versions",
    "content": "Revision History Revised Pages 2023"
  },
  {
    "id": "6d83df91-e81b-4db0-ab97-8d8ab250bb14",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11.3 Document Editions / Versions",
    "content": "1.0 17/10/2023 First Edition"
  },
  {
    "id": "847b5fa3-1548-4b98-b09e-43fd1e425a9f",
    "document": "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.txt",
    "section": "11.3 Document Editions / Versions",
    "content": "N/A Annual editions of this DTSM will be published every December in time for upcoming year relevant to the DTSM. Throughout the year, different versions of the current edition may also be published. When every new edition is published, the versions will reset to 1."
  }
]