{
  "DTSM 2 Analysis of Individual Training 2023 Edition V1.0.docx": [
    "2023 Edition",
    "1 E.g. Comptency or Competence Frameworks.",
    "2 Equally, it may not recommend a training solution, in which case the TNA would cease.",
    "3 Across Defence this SG may be known by alternative names.",
    "4 Such as, for example: a Warship, a Brigade, or an Air Wing.",
    "5 RFTD is defined as the point at which all the necessary resources required to conduct training have been accepted by the TRA.",
    "6 The Defence Human Factors Integration Policy for Defence Systems (JSP 912) also requires the development of a Target Audience Description so there is the potential for re-use of information here.",
    "7 Political, Economic, Social, Technological, Legal and Environmental.",
    "8 Training, Equipment, Personnel, Information, Concepts and Doctrine, Organisation, Infrastructure and Logistics, along with Interoperability.",
    "9 Contained within Volume 6 of the JSP 822.",
    "10 See",
    "11 That is, in order to potentially optimise efficiency and effectiveness.",
    "12 For example, access to training areas and the capacity of existing training solutions or infrastructure.",
    "13 To be undertaken in accordance with the Cabinet Office’s Management of Risk Best Practice Guidance.",
    "14 Including current resourcing such as course design and the digital skills of trainers and designers.",
    "15 Particular reference should be made to the Service policies/directives for individual training",
    "17 A ‘job’ can be made up of many Roles. Therefore, it can be argued that jobs (in the traditional sense of a person conducting a single task requiring a single skill, for example) seldom exist. Accordingly, it is more appropriate to analyse a Role that a person will fulfil. An example would be a RN Catering Services rating, who is trained in the primary Role but routinely has other Roles and duties aboard ship that are not related to the primary role (such as firefighting and First Aid). Training that person for the job of Catering Services/Fire Fighter/First Aider is impractical, but training that person for the primary Role , then the Role of fire fighter and the First Aider makes more sense. Thus RA is a more logical term than Job Analysis and more reflective of what this analysis actually does.",
    "18 TAFMIS has forms entitled ‘Role Specification’ and ‘Role Description’ to assist with this process.",
    "5.7 Production of Role Scalar",
    "19 The choice of verb is critical when writing tasks, sub-tasks (and, later, training objectives). Verbs must be observable and measurable. More guidance on this aspect of Analysis and Design is given on the DSAT courses delivered at DCTS.",
    "20 In TAFMIS, Initial Training Categories are listed as DIF Training Categories.",
    "21 Defence uses a Continuous Attitude Survey which measure and captures Attitudes towards many aspects of military life.",
    "22 It is recognised that Training Categories require further review to reflect the blended approach to Defence training.",
    "8.7 Frameworks",
    "23 In this instance, however, analysts must ensure that their references are up to date.",
    "8.7 Recommended Further Reading",
    "24 There may be multiple training gaps. For example, there will be two gaps if some personnel are migrating from a predecessor system to a new system, while others are coming directly from basic training to the new system. Early knowledge of workforce plans is important; if this information is unavailable, assumptions must be made and clearly stated.",
    "25 A lesson, series of lessons, a course, exercise, or training activity.",
    "26 Derived from the task but not always a directly matching the task.",
    "27 Verbs such as ‘know’ or ‘understand’ do not adequately define an action on the part of the trainee and are not observable or measurable. ‘Diagnose’, ‘assess’, ‘select’, ‘identify’, ‘distinguish’ are much more readily witnessed and can be assessed more easily.",
    "28 If a performance is affected by such factors, the document or regulation should be clearly referenced in the Standards element, such as, “in accordance with publication/law/act, section X, paragraph Y, date and version.”",
    "29 Not all organisations carry out Fidelity Analysis at this stage. Some organisations carry it out later on in the design process.",
    "30 For example, if the Role conducted in the workplace environment (the real world) must be done at 100%, and the training environment can only replicate the workplace environment to 89%, then that is the fidelity to which the training requirement matches the role requirement. It is not to be confused with Gap Analysis, as fidelity is about replicating the totality of the real environment in training, rather than seeking the gap between existing training and new/changed training requirements.",
    "31 To succeed on many operations, UK Armed Forces will need to understand and interpret the nuances of local cultures with and within which they will be operating. Introducing cultural elements into training will be essential in many cases - Future Operating Environment 2035, Development, Concepts and Doctrine Centre, 2015.",
    "32 Which all form parts of the FTS. These are covered in Element 2 (Design, 2.2).",
    "33 Trainers should therefore seek specialist advice and support from Defence, or, for industry, from specialists in the field.",
    "34 It may be necessary to break down costs into greater detail to conduct evaluation.",
    "35 This may include safety considerations or it may be appropriate to assess safety separately.",
    "2023 EDITION, V1.0",
    "2023 EDITION, V1.0",
    "2023 EDITION, V1.0"
  ]
}